public/Biology.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Biology</title>
<meta name="description" content="Personal notes on biochemistry, according to the syllabus of MU-Sofia 2022" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Biology</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0f08b03">Resources I've used</a></li>
</ul>
</li>
<li><a href="#orgf705217">1. Origin and evolution of cells.</a>
<ul>
<li><a href="#org0c40b5d">Nature constructs cells</a></li>
<li><a href="#org9430267">RNA World</a></li>
<li><a href="#org6239700">Last Universal Common Ancestor(LUCA)</a></li>
<li><a href="#org6f3ed24">Prokaryotes vs Eukaryotes</a></li>
</ul>
</li>
<li><a href="#org19bae54">2. Proteins. Protein domains. Protein families.</a>
<ul>
<li>
<ul>
<li><a href="#org13dfd69">Protein functions</a></li>
<li><a href="#orgc709e96">Protein structure</a></li>
<li><a href="#orga6021e9">Protein domains</a></li>
<li><a href="#org03b5751">Protein Families</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5fa00fa">3. Nucleic acids. DNA. RNA</a>
<ul>
<li>
<ul>
<li><a href="#org6a5ea6f">Nucleic Acids</a></li>
<li><a href="#orge4367ef">RNA structure</a></li>
<li><a href="#org178797a">RNA - types and functions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org959e758">4. Recognition and self-assembly of macromolecules. Cytoskeleton.</a>
<ul>
<li>
<ul>
<li><a href="#orgdf07bd1">Self-assembly of macromolecules</a></li>
<li><a href="#org1615182">Cytoskeleton</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org142af55"><span class="todo TODO">TODO</span> 5. Transcription.</a></li>
<li><a href="#orgd318799"><span class="todo TODO">TODO</span> 6. RNA processing.</a></li>
<li><a href="#org09fb35c"><span class="todo TODO">TODO</span> 7. Genetic code. Translation.</a></li>
<li><a href="#org90061fe"><span class="todo TODO">TODO</span> 8. Proteins after translation: sorting, folding, modifications, degradation.</a></li>
<li><a href="#org05f6591">9. DNA replication.</a>
<ul>
<li>
<ul>
<li><a href="#orge11a667">DNA Replication</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf63b7b7"><span class="todo TODO">TODO</span> 10. RNA replication. Reverse transcription</a></li>
<li><a href="#org9bbae2f"><span class="todo TODO">TODO</span> 11. DNA repair.</a></li>
<li><a href="#orgccef6d4"><span class="todo TODO">TODO</span> 12. Prokaryotic genome and regulation of gene expression.</a></li>
<li><a href="#orgedec917"><span class="todo TODO">TODO</span> 13. Eukaryotic genome and regulation of gene expression.</a></li>
<li><a href="#orgb6fd41c"><span class="todo TODO">TODO</span> 14. Cytoplasmic (extrachromosomal) inheritance in prokaryotes and eukaryotes.</a></li>
<li><a href="#org8cbb67d"><span class="todo TODO">TODO</span> 15. General (homologous) recombination. Molecular mechanisms of crossing over.</a></li>
<li><a href="#org27664aa"><span class="todo TODO">TODO</span> 16. Site-specific recombination.</a></li>
<li><a href="#orgb338e0c"><span class="todo TODO">TODO</span> 17. Reproduction of viruses.</a></li>
<li><a href="#org5efb754"><span class="todo TODO">TODO</span> 18. Chromatin. Nucleosomes.</a></li>
<li><a href="#org1909bd3"><span class="todo TODO">TODO</span> 19. Human karyotype. Types of chromosomes.</a></li>
<li><a href="#org25ffa47"><span class="todo TODO">TODO</span> 20. Gene mutations. Mechanisms and mutagenic factors.</a></li>
<li><a href="#org591ed08"><span class="todo TODO">TODO</span> 21. Chromosomal mutations. Evolution of karyotype.</a></li>
<li><a href="#orgb776e49"><span class="todo TODO">TODO</span> 22. Genes and alleles. Dominance and recessivity - mechanisms, medical examples. Penetrance and expressivity.</a></li>
<li><a href="#orge3f4f50"><span class="todo TODO">TODO</span> 23. Phenotype, genotype and allele frequencies. Hardy – Weinberg law.</a></li>
<li><a href="#org9b3e655"><span class="todo TODO">TODO</span> 24. Factors influencing allele frequencies: mutations, migrations, natural selection.</a></li>
<li><a href="#orgd99a6a9"><span class="todo TODO">TODO</span> 25. Effects of isolation: genetic drift, inbreeding.</a></li>
<li><a href="#org910313a"><span class="todo TODO">TODO</span> 26. Quantitative traits.</a></li>
<li><a href="#org152e6bc">27. Cell cycle. Mitosis. Cell cycle control.</a>
<ul>
<li>
<ul>
<li><a href="#org03703ae">Interphase</a></li>
<li><a href="#orgd55efc7">Mitosis</a></li>
<li><a href="#org7cd38db">Cell cycle control</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8ad32b1"><span class="todo TODO">TODO</span> 28. Growth factors, protooncogens, oncogenes, tumor suppressors. Oncogenic viruses</a></li>
<li><a href="#org6d4b883"><span class="todo TODO">TODO</span> 29. Cell senescence. Cell death: apoptosis, necrosis.</a>
<ul>
<li>
<ul>
<li><a href="#org9b40395">Cell senescence</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd5ac99f"><span class="todo TODO">TODO</span> 30. Cell signaling. Cell receptors.</a></li>
<li><a href="#orge0b8e12"><span class="todo TODO">TODO</span> 31. Meiosis. Origin of germ cells.</a></li>
<li><a href="#org5cd5169"><span class="todo TODO">TODO</span> 32. Spermatogenesis. Mammalian spermatozoa.</a></li>
<li><a href="#org191a62d"><span class="todo TODO">TODO</span> 33. Oogenesis. Mature mammalian ova.</a></li>
<li><a href="#org193bb8e"><span class="todo TODO">TODO</span> 34. Fertilization. Interaction of maternal and paternal genomes.</a></li>
<li><a href="#org31f8b4b"><span class="todo TODO">TODO</span> 35. Assisted reproduction: IVF, ICSI.</a></li>
<li><a href="#orgc162214"><span class="todo TODO">TODO</span> 36. Embryonic development – early stages (zygote to neurula).</a></li>
<li><a href="#orgef48a7a"><span class="todo TODO">TODO</span> 37. Embryonic development – regulative and mosaic. Morphogens and embryonic induction.</a></li>
<li><a href="#orgac21747"><span class="todo TODO">TODO</span> 38. Preimplantation mammalian embryo.</a></li>
<li><a href="#org165d0be">39. Sex determination and differentiation.</a>
<ul>
<li>
<ul>
<li><a href="#org381062e">Genotypic sex determination</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgca56aeb"><span class="todo TODO">TODO</span> 40. Methods of karyotyping and chromosome analysis.</a></li>
<li><a href="#orga64f15f"><span class="todo TODO">TODO</span> 41. Basic methods in molecular biology – electrophoresis, PCR, blotting, sequencing.</a></li>
<li><a href="#org66168aa"><span class="todo TODO">TODO</span> 42. Immunological methods. Diagnosis of viral infections.</a></li>
<li><a href="#org51f3c14"><span class="todo TODO">TODO</span> 43. Recombinant DNA technology – restriction endonucleases, DNA vectors, recombinant proteins.</a></li>
<li><a href="#orgcab6ff3"><span class="todo TODO">TODO</span> 44. Cell micro-manipulations.</a></li>
<li><a href="#orgf7a657a"><span class="todo TODO">TODO</span> 45. Transgenic animals. Gene therapy.</a></li>
<li><a href="#orgcfd8414">46. Innate immunity.</a>
<ul>
<li>
<ul>
<li><a href="#org4fb3a8f">Barriers</a></li>
<li><a href="#orgaf357b3">Internal defenses | Tissues</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4a9bc89">47. Structure of antibodies.</a>
<ul>
<li>
<ul>
<li><a href="#org19648de">Antibodies | Structure</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7da9a28">48. Functions of antibodies.</a>
<ul>
<li>
<ul>
<li><a href="#org80cbde8">How antibodies work</a></li>
<li><a href="#org9f28ba4">Functions and Usage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb018f4b"><span class="todo TODO">TODO</span> 49. Molecules of cell-mediated immunity.</a></li>
<li><a href="#orgfe46421"><span class="todo TODO">TODO</span> 50. Cytotoxic and helper T lymphocytes.</a></li>
<li><a href="#orgfdecb2b"><span class="todo TODO">TODO</span> 51. Genetic basis of antibodies and T-cell receptors.</a></li>
<li><a href="#orgfbabce3"><span class="todo TODO">TODO</span> 52. Lymphocyte differentiation in central lymphoid organs.</a></li>
<li><a href="#orgb9b9b2b"><span class="todo TODO">TODO</span> 53. Lymphocyte differentiation in peripheral lymphoid organs. Immune response</a></li>
<li><a href="#org4a1a313"><span class="todo TODO">TODO</span> 54. Immune memory.</a></li>
<li><a href="#org201b614"><span class="todo TODO">TODO</span> 55. Immune tolerance. Regulatory T lymphocytes.</a></li>
<li><a href="#org036d7f6"><span class="todo TODO">TODO</span> 56. Transplantation immunity.</a></li>
<li><a href="#org9eeff72"><span class="todo TODO">TODO</span> 57. Antitumor immunity. Evolution of immunity.</a></li>
<li><a href="#org905175e"><span class="todo TODO">TODO</span> 58. Blood group alloantigens. ABO and H blood groups.</a></li>
<li><a href="#org20bf4e6"><span class="todo TODO">TODO</span> 59. Rhesus blood groups.</a></li>
<li><a href="#orgef9273f"><span class="todo TODO">TODO</span> 60. Animal evolution before vertebrates.</a></li>
<li><a href="#org3c7d2ec"><span class="todo TODO">TODO</span> 61. Sequence of evolutionary innovations in vertebrate classes</a></li>
<li><a href="#org2d25af8">62. Phylogeny and development of the skull</a>
<ul>
<li>
<ul>
<li><a href="#orgd25265c"><span class="todo TODO">TODO</span> Composition</a></li>
<li><a href="#orgb563d76">Phylogeny</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5d64a62"><span class="todo TODO">TODO</span> 63. Phylogeny and development of the postcranial skeleton</a></li>
<li><a href="#org7b38720">64. Phylogeny and development of the skin</a>
<ul>
<li>
<ul>
<li><a href="#orgba8fa75">Skin</a></li>
<li><a href="#org9162f9d">Phylogeny of the skin</a></li>
<li><a href="#org3c23346">Skin development</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2959bbe"><span class="todo TODO">TODO</span> 65. Phylogeny and development of the nervous system (brain and spinal cord)</a>
<ul>
<li>
<ul>
<li><a href="#orge13e902">Phylogeny of nervous system</a></li>
<li><a href="#orgb1a601c">Development of brain and spinal cord</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3962614"><span class="todo TODO">TODO</span> 66. Phylogeny and development of the skin sense organs, taste, and olfactory organs.</a></li>
<li><a href="#org4e9e3e7"><span class="todo TODO">TODO</span> 67. Phylogeny and development of the organ of balance and hearing.</a></li>
<li><a href="#orgff23c4e"><span class="todo TODO">TODO</span> 68. Phylogeny and development of organ of vision.</a></li>
<li><a href="#org343c4a9"><span class="todo TODO">TODO</span> 69. Phylogeny and development of digestive system.</a></li>
<li><a href="#org259da3d"><span class="todo TODO">TODO</span> 70. Phylogeny and development of circulatory system.</a></li>
<li><a href="#orge9d1aca"><span class="todo TODO">TODO</span> 71. Phylogeny and development of respiratory system.</a></li>
<li><a href="#org1c02d59"><span class="todo TODO">TODO</span> 72. Phylogeny and development of excretory system.</a></li>
<li><a href="#org4b56ab6"><span class="todo TODO">TODO</span> 73. Phylogeny and development of reproductive system.</a></li>
<li><a href="#org8d0e06d"><span class="todo TODO">TODO</span> 74. Mechanisms of evolution. Anagenesis.</a></li>
<li><a href="#org82eafce"><span class="todo TODO">TODO</span> 75. Speciation (cladogenesis). Macroevolution.</a></li>
<li><a href="#org5f3db95"><span class="todo TODO">TODO</span> 76. Human evolution.</a></li>
<li><a href="#org6ec5789"><span class="todo TODO">TODO</span> 77. Molecular evolution.</a></li>
<li><a href="#orga0331c6">78. Protozoa. Phylum Sarcomastigophora. Subphylum Mastigophora (Flagellata). Trypanosoma brucei gambiense, Trypanosoma brucei rhodesiense. Trypanosoma cruzi.</a>
<ul>
<li>
<ul>
<li><a href="#org7738b29">Trypanosoma brucei</a></li>
<li><a href="#org854d246">Trypanosoma cruzi</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb7e802a">79. Leishmania donovani. Leishmania tropica. Leishmania braziliensis.</a>
<ul>
<li>
<ul>
<li><a href="#org3a24b91">Leishmania braziliensis &amp; Leishmania Tropica</a></li>
<li><a href="#org4b9f659">Leishmania donovani</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7c17de2">80. Trichomonas vaginalis. Trichomonas tenax. Giardia lamblia (Lamblia intestinalis).</a>
<ul>
<li>
<ul>
<li><a href="#org6f1670c">Trcihonomas vaginalis</a></li>
<li><a href="#org4c4f49a">Trichonomonas tenax</a></li>
<li><a href="#org7da6af2">Giardia Lamblia</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org92d26d2">81. Subphylum Sarcodina. Entamoeba histolytica. Entamoeba dispar. Entamoeba gingivalis.</a>
<ul>
<li>
<ul>
<li><a href="#orga2b63de">Entamoeba Histolytica</a></li>
<li><a href="#org81ef570">Entamoeba dispar</a></li>
<li><a href="#org63bbee6">Entamoeba gingivalis</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3d948f0">82. Phylum Apicomplexa. Toxoplasma gondii.</a>
<ul>
<li>
<ul>
<li><a href="#orgbd23ae8">Phylum Apicomplexa</a></li>
<li><a href="#org26c9f03">Toxoplasma gondii</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf5ab49a">83. Plasmodium vivax. Plasmodium malariae. Plasmodium falciparum. Morphological differences in the erythrocyte schizogony of the genus Plasmodium.</a>
<ul>
<li>
<ul>
<li><a href="#org12f76e2">Plasmodium Falciparum</a></li>
<li><a href="#orgec8935f">Plasmodium Vivax</a></li>
<li><a href="#orge951352">Plasmodium Malariae</a></li>
<li><a href="#org560a301">Life cycle</a></li>
<li><a href="#org1ff1ed0">Morphological differences</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgff59d15">84. Phylum Ciliophora. Balantidium coli.</a>
<ul>
<li>
<ul>
<li><a href="#org9291770">Phylum Ciliophora</a></li>
<li><a href="#orgcf6d156">Balantidium coli</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org673c960"><span class="todo TODO">TODO</span> 85. Metazoa: important evolutionary changes associated with the transition to multicellularity. Phylum Cnidaria (Coelenterata). Genus Hydra. Genus Obelia.</a></li>
<li><a href="#orgb29fab5">86. Phylum Platyhelminthes: important evolutionary changes. Class Trematoda. Fasciola hepatica.</a>
<ul>
<li>
<ul>
<li><a href="#org87b5086">Phylum Platyhelmnithes</a></li>
<li><a href="#org2c541a7">Class Trematoda(Flukes)</a></li>
<li><a href="#org2f71258">Fasciola Hepatica</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1d27aad">87. Dicrocoelium dendriticum (D. lanceatum).</a></li>
<li><a href="#org29ec3b0">88. Opisthorchis felineus. Genus Schistosoma and its species.</a>
<ul>
<li>
<ul>
<li><a href="#org73086a6">Opisthorchis felinewus</a></li>
<li><a href="#org44acf08">Genus Schistosoma</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9439c19">89. Class Cestoda. Diphyllobothrium latum.</a>
<ul>
<li>
<ul>
<li><a href="#org03dbbca">Class Cestoda</a></li>
<li><a href="#orgf634db2">Diphyllobothrium latum</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf60a977">90. Taenia saginata. Taenia solium.</a>
<ul>
<li>
<ul>
<li><a href="#org366fae1">Taenia Saginata</a></li>
<li><a href="#org24d26a9">Taenia Solium</a></li>
<li><a href="#org4a66852">Life cycle</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge33ca68">91. Echinococcus granulosus. Hymenolepis nana.</a>
<ul>
<li>
<ul>
<li><a href="#orgc0604ca">Echinococcus</a></li>
<li><a href="#orgca3e1c2">Hymenolepis nana</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8f021bf">92. Phylum Nematoda. Ascaris lumbricoides.</a>
<ul>
<li>
<ul>
<li><a href="#orgd487f7a">Phylum Nematoda</a></li>
<li><a href="#org23a5ad5">Ascaris Lumbricoides</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2c3b25d">93. Enterobius vermicularis. Trichuris trichiura (Trichocephalus trichiurus).</a>
<ul>
<li>
<ul>
<li><a href="#orge8ef40c">Enterobius vermicularis</a></li>
<li><a href="#org13729af">Truchuris trichiura</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd82438c">94. Trichinella spiralis.</a>
<ul>
<li>
<ul>
<li><a href="#org6df218f">Trichinella spiralis</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org665a8c1">95. Ancylostoma duodenale. Strongyloides stercoralis.</a>
<ul>
<li>
<ul>
<li><a href="#org8ed61b8">Ancylostoma duodenale</a></li>
<li><a href="#org4c00e0b">Strongyloides sterocalis</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org483e87e">96. Dracunculus medinensis. Filarial worms: Wuchereria bancrofti, Loa loa, Onchocerca volvulus.</a>
<ul>
<li>
<ul>
<li><a href="#org6d57b3f">Dracunculus medinensis</a></li>
<li><a href="#orgcf28e3e">Wucheeria Bancrofti</a></li>
<li><a href="#org8c62a71">Loa loa</a></li>
<li><a href="#orgbeefdb2">Onchocerca volvulus</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgeac13e8">97. Phylum Annelida: important evolutionary changes. Lumbricus terrestris. Hirudo medicinalis.</a>
<ul>
<li>
<ul>
<li><a href="#org1cb33ae">Phylum Annelida</a></li>
<li><a href="#org6bd79e0">Lumbrius terrestrisl</a></li>
<li><a href="#orgb1405c3">Hirudo Medicinalis</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb96606c">98. Phylum Arthropoda: important evolutionary changes. Class Crustacea: general characterization.Class Arachnida. Orders Scorpiones and Araneae.</a>
<ul>
<li>
<ul>
<li><a href="#org3d658ae">Phylum Arthropoda</a></li>
<li><a href="#orgce90ece">Class Crustacea</a></li>
<li><a href="#org5701401">Class Arachnida</a></li>
<li><a href="#orge990ccd">Order Arenae</a></li>
<li><a href="#orgd4ec81d">Order Scorpiones</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0049d91">99. Order Acari. Medical importance of ticks and mites.</a></li>
<li><a href="#orgdedb6d4">100. Class Insecta. The role of insects as vectors and mechanical carriers.</a>
<ul>
<li>
<ul>
<li><a href="#orgc3a3f82">Class Insecta</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org051ce39">101. Pediculus humanus. Phthirius pubis. Cimex lectularius. Pulex irritans.</a>
<ul>
<li>
<ul>
<li><a href="#orgd2e3837">Pediculus humanus</a></li>
<li><a href="#org94fb0d2">Phthirius pubis</a></li>
<li><a href="#org5ffb4f2">Cimex Lectularius</a></li>
<li><a href="#orgf24ee6a">Pulex irritans</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4285853">102. Genus Culex and genus Anopheles: morphological differences. Phlebotomus papatasii.</a>
<ul>
<li>
<ul>
<li><a href="#org6dffc20">Genus Culex and Genus Anopheles</a></li>
<li><a href="#org502faa5">Phlebotomus papatsii</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org12a1179">103. Overview of parasitism.parasitism</a></div>
</div>

<div id="outline-container-org0f08b03" class="outline-3">
<h3 id="org0f08b03">Resources I've used</h3>
<div class="outline-text-3" id="text-org0f08b03">
<ul class="org-ul">
<li><a href="https://drive.google.com/drive/folders/1dprI1xs3aOIDYshw3NtjGgUI32Jnz-3m">University Lectures</a></li>
<li><a href="https://www.ncbi.nlm.nih.gov/">National Center for Biotechnology Information</a></li>
<li><a href="https://www.amboss.com/us">AMBOSS</a></li>
<li><a href="https://www.kenhub.com/">Kenhub</a></li>
<li><a href="http://www.biology.arizona.edu">University of Arizona | Biology Department</a></li>
</ul>
</div>
</div>
