content/Biology.org
* 1. Origin and evolution of cells.
** Nature constructs cells
  + The primitive atmosphere was devoid of molecular oxygen
  + This allowed interaction of carbon,hydrogen and with other atoms, resulting in formation of organic molecules
  + As chemical reactions became more diverse a primordial "organic soup" was formed in the ocean
  + Molecules able to influence reactions in the environment and construct their own copies appeared, leading to the "RNA world"
    + RNA molecules catalyzed heir own replication
** RNA World
+ /only/ RNA can both replicate and catalyze reactions
  + In the RNA world, it was the only biopolymer, later on, living systems acquired first proteins and then DNA
  + Around RNA and proteins, lipid self-organized into bilayers, acquiring "membrane", making a "protocell".
  + At some point, one the early living systems started using DNA to store genetic information. /DNA is more stable/
** Last Universal Common Ancestor(LUCA)
+ All early organisms died out without leaving any descendants, except one, which gave rise to all extant organisms.
  + This organism is referred to as LUCA
+ The only way to study it is by comparing genomes of modern organisms which are as unrelated as possible
+ LUCA lived almost 4 billion years ago, was an anaerobic chemoautotroph. With regard to its structure, it was a prokaryote
** Prokaryotes vs Eukaryotes
+ Prokaryotes are simpler than eukaryotes(e.g absence of nucleus), and have evolved earlier. For a long time, life on Earth has been prokaryotic-only
+ In order to know basic life functions and the minimum equipment of life structures, you must study the prokaryotic cell. In many respects, it is *the cell*
+ Prokaryotes have all types of metabolism seen in eukaryotes, and more
| Prokaryotes                                        | Eukaryotes                                  |
|----------------------------------------------------+---------------------------------------------|
| Small                                              | Larger                                      |
| Spherical or rod shape                             | Endomembranes, compartmentation and cytosis |
| Surrounded by a lipid cell membrane                | Nucleus with linear chromosomes             |
| circular DNA inside nucleoid                       | Mitochondria                                |
| Cytoplasm full of ribosomes                        | Cytoskeleton                                |
| Plasmids that contain DNA molecules                | Flagella                                    |
| Polysaccharide cell wall                           | Mostly aerobic hetetrophs                   |
| Some have a polysaccharide capsule                 | Cells divide by mitosis                     |
| Capusle might have attachments e.g pili/appendages | Sexual processes                            |
| Flagella                                           | Mutlicellularity                            |
+ The ancestor of eukaryotes was an anaerobic, heterotrophic *archaeon*
  + Found in hydrothermal vents as hot as 300C, in the zone between Greenland and Norway
  + This vent field resembles the habitat of LUCA
  + Because of its "fantastic shape", the habitat has been called *Loki's Castle*
  + The group of archaeans discovered there are genetically close to eukaryotes, has been named *Asgard*
+ It developed a cytoskeleton as inner support and disposed of the outer support(cell wall)
+ The genome was surrounded by membranes, to be protected from the mechanical forces in the cytoplasm.
  + This allowed for *nucleus* formation and mitosis
+ Proto-eukaryotes fed on bacteria, engulfing and digesting them. One however, was not digested. It's progeny remained in the host cytoplasm as endosymbionts, became *mitochondria* and made the host *aerobic*
  + *Mitochondria have their own DNA and ribosomes*, which are of *prokaryotic* rather than eukaryotic type

* 2. Proteins. Protein domains. Protein families.
*** Protein functions
+ Structural
+ Movement
+ Catalysis
+ Recognition
+ Homeostasis
+  Traits of an organism are determined by the proteins it can produce
*** Protein structure
+ *Primary structure*
  + The sequence of the polypeptide chain
    + Number of amino acids
    + Order of amino acids(arrangement)
+ Primary structure is determined by the respective gene. Based on peptide bonds between amino acids.

+ Ultimately determines all other levels of protein structure plus the function of the protein

+ *Secondary Structure*
  + Localized conformation of the polypeptide chain based
    + Polypeptide backbone forms shapes entirely dependent on how to best store energy, by adapting the lowest energy conformation
    + These shapes inclue :
      + Alpha helix
        + e.g found in myoglobin
      + Beta-sheet
        + e.g found in immunoglobins
+ *Tertiary Structure*
  + Complete Folding pattern, specific to its protein as it gives its function
  + Factors that influence tertiary structure :
    + hydrophobic residues in the interior
    + hydrophilic residues on the exterior
    + Disulfide bonds help maintain structural integrity
      + if a protein is highly compact we would call it a globular protein
      + if its long and "spinldy" we would call it a fibrous protein
+ Quaternary Structure
  + The way mutliple polypeptide subunits come together to form a larger protein
    + e.g the way the 4 haemoglobin subunits come together

+ Primary : Sequence of residues
+ Secondary : Localized folding
+ Tertiary : Complete folding pattern
+ Quaternary : Interactions of subunits

*** Protein domains
  + Tertiary structure packs the alpha helices and/or beta sheets in globular units called **domains**
  + Some proteins have a single domain while others have two or more
  + Different domains have different structure and perform different functions
  + Popular folding patterns are called **protein motifs**
*** Protein Families
  + A group of evolutionarily-related proteins
  + Share a corresponding gene family, leading to significant sequence similarity
  + Similar three-dimensional structures
  + Can be groped into larger clades called protein super families
    + e.g Immunoglobulin superfamily - contain a sandwich-like structure of two B-sheets
* 3. Nucleic acids. DNA. RNA
