public/Biology.html



<div id="outline-container-orgf705217" class="outline-2">
<h2 id="orgf705217">1. Origin and evolution of cells.</h2>
<div class="outline-text-2" id="text-orgf705217">
</div>
<div id="outline-container-org0c40b5d" class="outline-3">
<h3 id="org0c40b5d">Nature constructs cells</h3>
<div class="outline-text-3" id="text-org0c40b5d">
<ul class="org-ul">
<li>The primitive atmosphere was devoid of molecular oxygen</li>
<li>This allowed interaction of carbon,hydrogen and with other atoms, resulting in formation of organic molecules</li>
<li>As chemical reactions became more diverse a primordial "organic soup" was formed in the ocean</li>
<li>Molecules able to influence reactions in the environment and construct their own copies appeared, leading to the "RNA world"
<ul class="org-ul">
<li>RNA molecules catalyzed heir own replication</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9430267" class="outline-3">
<h3 id="org9430267">RNA World</h3>
<div class="outline-text-3" id="text-org9430267">
<ul class="org-ul">
<li><i>only</i> RNA can both replicate and catalyze reactions
<ul class="org-ul">
<li>In the RNA world, it was the only biopolymer, later on, living systems acquired first proteins and then DNA</li>
<li>Around RNA and proteins, lipid self-organized into bilayers, acquiring "membrane", making a "protocell".</li>
<li>At some point, one the early living systems started using DNA to store genetic information. <i>DNA is more stable</i></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6239700" class="outline-3">
<h3 id="org6239700">Last Universal Common Ancestor(LUCA)</h3>
<div class="outline-text-3" id="text-org6239700">
<ul class="org-ul">
<li>All early organisms died out without leaving any descendants, except one, which gave rise to all extant organisms.
<ul class="org-ul">
<li>This organism is referred to as LUCA</li>
</ul></li>
<li>The only way to study it is by comparing genomes of modern organisms which are as unrelated as possible</li>
<li>LUCA lived almost 4 billion years ago, was an anaerobic chemoautotroph. With regard to its structure, it was a prokaryote</li>
</ul>
</div>
</div>
<div id="outline-container-org6f3ed24" class="outline-3">
<h3 id="org6f3ed24">Prokaryotes vs Eukaryotes</h3>
<div class="outline-text-3" id="text-org6f3ed24">
<ul class="org-ul">
<li>Prokaryotes are simpler than eukaryotes(e.g absence of nucleus), and have evolved earlier. For a long time, life on Earth has been prokaryotic-only</li>
<li>In order to know basic life functions and the minimum equipment of life structures, you must study the prokaryotic cell. In many respects, it is <b>the cell</b></li>
<li>Prokaryotes have all types of metabolism seen in eukaryotes, and more</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Prokaryotes</th>
<th scope="col" class="org-left">Eukaryotes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Small</td>
<td class="org-left">Larger</td>
</tr>

<tr>
<td class="org-left">Spherical or rod shape</td>
<td class="org-left">Endomembranes, compartmentation and cytosis</td>
</tr>

<tr>
<td class="org-left">Surrounded by a lipid cell membrane</td>
<td class="org-left">Nucleus with linear chromosomes</td>
</tr>

<tr>
<td class="org-left">circular DNA inside nucleoid</td>
<td class="org-left">Mitochondria</td>
</tr>

<tr>
<td class="org-left">Cytoplasm full of ribosomes</td>
<td class="org-left">Cytoskeleton</td>
</tr>

<tr>
<td class="org-left">Plasmids that contain DNA molecules</td>
<td class="org-left">Flagella</td>
</tr>

<tr>
<td class="org-left">Polysaccharide cell wall</td>
<td class="org-left">Mostly aerobic hetetrophs</td>
</tr>

<tr>
<td class="org-left">Some have a polysaccharide capsule</td>
<td class="org-left">Cells divide by mitosis</td>
</tr>

<tr>
<td class="org-left">Capusle might have attachments e.g pili/appendages</td>
<td class="org-left">Sexual processes</td>
</tr>

<tr>
<td class="org-left">Flagella</td>
<td class="org-left">Mutlicellularity</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>The ancestor of eukaryotes was an anaerobic, heterotrophic <b>archaeon</b>
<ul class="org-ul">
<li>Found in hydrothermal vents as hot as 300C, in the zone between Greenland and Norway</li>
<li>This vent field resembles the habitat of LUCA</li>
<li>Because of its "fantastic shape", the habitat has been called <b>Loki's Castle</b></li>
<li>The group of archaeans discovered there are genetically close to eukaryotes, has been named <b>Asgard</b></li>
</ul></li>
<li>It developed a cytoskeleton as inner support and disposed of the outer support(cell wall)</li>
<li>The genome was surrounded by membranes, to be protected from the mechanical forces in the cytoplasm.
<ul class="org-ul">
<li>This allowed for <b>nucleus</b> formation and mitosis</li>
</ul></li>
<li>Proto-eukaryotes fed on bacteria, engulfing and digesting them. One however, was not digested. It's progeny remained in the host cytoplasm as endosymbionts, became <b>mitochondria</b> and made the host <b>aerobic</b>
<ul class="org-ul">
<li><b>Mitochondria have their own DNA and ribosomes</b>, which are of <b>prokaryotic</b> rather than eukaryotic type</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org19bae54" class="outline-2">
<h2 id="org19bae54">2. Proteins. Protein domains. Protein families.</h2>
<div class="outline-text-2" id="text-org19bae54">
</div>
<div id="outline-container-org13dfd69" class="outline-4">
<h4 id="org13dfd69">Protein functions</h4>
<div class="outline-text-4" id="text-org13dfd69">
<ul class="org-ul">
<li>Structural</li>
<li>Movement</li>
<li>Catalysis</li>
<li>Recognition</li>
<li>Homeostasis</li>
<li>Traits of an organism are determined by the proteins it can produce</li>
</ul>
</div>
</div>
<div id="outline-container-orgc709e96" class="outline-4">
<h4 id="orgc709e96">Protein structure</h4>
<div class="outline-text-4" id="text-orgc709e96">
<ul class="org-ul">
<li><b>Primary structure</b>
<ul class="org-ul">
<li>The sequence of the polypeptide chain
<ul class="org-ul">
<li>Number of amino acids</li>
<li>Order of amino acids(arrangement)</li>
</ul></li>
</ul></li>
<li>Primary structure is determined by the respective gene. Based on peptide bonds between amino acids.</li>

<li>Ultimately determines all other levels of protein structure plus the function of the protein</li>

<li><b>Secondary Structure</b>
<ul class="org-ul">
<li>Localized conformation of the polypeptide chain based
<ul class="org-ul">
<li>Polypeptide backbone forms shapes entirely dependent on how to best store energy, by adapting the lowest energy conformation</li>
<li>These shapes inclue :
<ul class="org-ul">
<li>Alpha helix
<ul class="org-ul">
<li>e.g found in myoglobin</li>
</ul></li>
<li>Beta-sheet
<ul class="org-ul">
<li>e.g found in immunoglobins</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
<li><b>Tertiary Structure</b>
<ul class="org-ul">
<li>Complete Folding pattern, specific to its protein as it gives its function</li>
<li>Factors that influence tertiary structure :
<ul class="org-ul">
<li>hydrophobic residues in the interior</li>
<li>hydrophilic residues on the exterior</li>
<li>Disulfide bonds help maintain structural integrity
<ul class="org-ul">
<li>if a protein is highly compact we would call it a globular protein</li>
<li>if its long and "spinldy" we would call it a fibrous protein</li>
</ul></li>
</ul></li>
</ul></li>
<li>Quaternary Structure
<ul class="org-ul">
<li>The way mutliple polypeptide subunits come together to form a larger protein
<ul class="org-ul">
<li>e.g the way the 4 haemoglobin subunits come together</li>
</ul></li>
</ul></li>

<li>Primary : Sequence of residues</li>
<li>Secondary : Localized folding</li>
<li>Tertiary : Complete folding pattern</li>
<li>Quaternary : Interactions of subunits</li>
</ul>
</div>
</div>

<div id="outline-container-orga6021e9" class="outline-4">
<h4 id="orga6021e9">Protein domains</h4>
<div class="outline-text-4" id="text-orga6021e9">
<ul class="org-ul">
<li>Tertiary structure packs the alpha helices and/or beta sheets in globular units called <b><b>domains</b></b></li>
<li>Some proteins have a single domain while others have two or more</li>
<li>Different domains have different structure and perform different functions</li>
<li>Popular folding patterns are called <b><b>protein motifs</b></b></li>
</ul>
</div>
</div>
<div id="outline-container-org03b5751" class="outline-4">
<h4 id="org03b5751">Protein Families</h4>
<div class="outline-text-4" id="text-org03b5751">
<ul class="org-ul">
<li>A group of evolutionarily-related proteins</li>
<li>Share a corresponding gene family, leading to significant sequence similarity</li>
<li>Similar three-dimensional structures</li>
<li>Can be groped into larger clades called protein super families
<ul class="org-ul">
<li>e.g Immunoglobulin superfamily - contain a sandwich-like structure of two B-sheets</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5fa00fa" class="outline-2">
<h2 id="org5fa00fa">3. Nucleic acids. DNA. RNA</h2>
<div class="outline-text-2" id="text-org5fa00fa">
</div>
