content/Biology.org
*** Nucleic Acids
+  Long Linear chains of nucleotides linked by phosphodiester bonds, forming a backbone
+ Nucleic acids are macromolecules responsible for storage, transmission and retrieval of genetic information
+ Two types of nucleic acids ***DNA-Deoxyribonucleic*** acid and ***RNA-Ribonucleic*** acid
**** Structure
+ Polymers of nucleotides
+ Each nucleotide consists of
    + Nitrogenous base
    + Pentose
    + At least one phosphate group
    +  DNA has A,T,C,G and deoxyribose
    +  RNA has A,U,C,G and ribose
**** Formation
+ Nitrogenous base binds to the 1' atom of the pentose -+  forms nucleoside
+ Phosphate reacts with the 5' hydroxyl group of the pentose -+  forms nucleotide * such nucleotides are called monophosphates * one or more phosphates may join the first one, forming nucleoside diphosphate, triphosphate etc. *** Nucleic chain * Nucleic acids are composed of nucleic chains, same as proteins are composed of polypeptide chains
+ To form a polynucleotide the phosphate at the 5' atom of a pentose reacts with the 3' hydroxyl group of another pentose
  + creating a covalent bond
+ The alternating phosphates and pentoses form a backbone
  + Their arrangement determines the **primary structure** of the nucleic acid
**** Complementarity
+ Nitrogenous bases bind specifically by hydrogen bonds according to the complementary rule
  + A with T or U(2 bonds), C with G(3 bonds)
+ Complementary binding defines the secondary structure of nucleic acids

**** The double helix and base stacking
+ Nitrogenous bases are **hydrophobic**(minimize their contact with water)
+ When two complementary strands bind, their bases stack together like cards to **exclude water molecules**
  + This forces the backbones to bend spirally, **forming a double-stranded helix**

+  To visualize nucleic acids we use cytochemical stains, e.g propidium iodide
**** DNA - helix types and functions
+  There are three types of double helices: A,B and Z
+ **B DNA**
  + The main helix type of DNA
  + Right handed
  + 10 nucleotide per turn
  + 2 grooves, one minor and one major
+ **A DNA**
  + Dehydrated form of DNA
  + Similar to B DNA, but with **larger diameter**
+ **Z DNA**
  + Z DNA is named so because its **backbone forms a zig-zag**
  + Formed in small parts of DNA, mainly CGCGCG sequence
**** DNA sense
+ To identify DNA strands, they are scored as the 'sense' and 'antisense'
  + **Sense strand** - Positive : coding strand
  + **Antisense** - Negative : Template strand, complementary to both positive sense and the RNA transcript
  +  The term sense and anti-sense are relative only to particular RNA transcript, and not to the DNA strand as a whole
  +  There are viruses, such as Arenaviruses, that are ambisense
*** RNA structure
+  RNA molecules are linear molecules, much smaller than DNA
+ Single stranded
  + Often has double-stranded parts called stem-loops/hairpin loops
+ Secondary Structure is determined by **loops**
+ RNA undergoes 3D folding as in proteins, called tertiary structure
  + Both secondary and tertiary are based on primary structure
+ Some RNAs have catalytic activity, they are called **ribozymes**

*** RNA - types and functions
**** RNAs involved in transcription or replication
+ mRNA - Messenger RNA : Encodes amino acid sequence of a polypeptide
+ tRNA - Transfer RNA : Brings amino acids to ribosomes during translation
+ rRNA - Ribosomal RNA : Makes up the ribosomes, with ribosomal proteins

+ **mRNA**
  + no remarkable spacial structure
  + each mRNA is a copy of a gene encoding protein, and brings the "message" to ribosomes
  + The coding region of mRNA consists of nucleotide triplets called codons which are recognized by the tRNA anticodons
  + The first codon(AUG) is called the start codon, while the last codon is called the last stop codon
+ **rRNA**
  + Engaged in hairpin loops
  + Structural role - formation of ribosomal subunits
    + The largest rRNA is a ribozyme
+ **tRNA**
  + Small
  + 4 loops, 3 large and one small
  + **Secondary structure** resembles a leaf
  + **Tertiary structure** resembles L-like shape
  + tRNA function is to match amino acids according to mRNA instructions

* 4. Recognition and self-assembly of macromolecules. Cytoskeleton.
*** Self-assembly of macromolecules
+ Ability of macromolecules to recognize each other and specifically bind spontaneously, forming supermolecular structures
  + The recognition is based on spatial affinity, we can compare to a lock-key mechanism
    + Self-assembled complexes are held together by non-covalent bonds
+ Complementary recognition and bidning of nucleotides **allows replication and transcription**, the basis of life
+ Heating above 70C causes denaturation of DNA - seperation of the two strands
  + but this process is reversible, when the solution is cooled cown, DNA strands find their complementary partners and pair by hydrogen bonds
    + this process is called annealing
  + if the paired strands are derived from one and the **same molecule**, the annealing is called **renaturation or reassociation**.
  + if the pairned strands are derived from **different DNA molecules**, the annealing is called **hybridization**
  + RNAs also hybridize

*** Cytoskeleton
**** Types - Ranked by size
  + Microfilaments
    + Helix appearing as made up of 2 protofilaments
    + Consist of Actin(globular protein)
  + Intermediate filaments
    + Bundle of tetramers made of dimers
    + Fibrous proteins(keratins in epithelial, desmin in muscle)
  + Microtubules
    + Hollow tube of 13 protofilaments made of AB-tubulin dimers
+ The cytoskeleton includes all of those types. Intermediate filaments are characteristic of animals(not in plants)

**** Microtubules
+ Self-assemble from dimers composed of alpha and beta tubulin. Energy from GTP is used
+ Microtubules are hollow tubes *with a diameter of 25nm*
+ Microtubule is **composed of 13 protofilaments**
+ Eventhough some microtubules e.g in flagella are very stable, microtubules in cytoplasm have a property called dynamic instability
  + It means that their + end grows by addition of tubulin dimer but occasionally collapses
  + Dynamic instability is regulated, it is increased when the cell starts division

