public/Biology.html
<div id="outline-container-org6a5ea6f" class="outline-4">
<h4 id="org6a5ea6f">Nucleic Acids</h4>
<div class="outline-text-4" id="text-org6a5ea6f">
<ul class="org-ul">
<li>Long Linear chains of nucleotides linked by phosphodiester bonds, forming a backbone</li>
<li>Nucleic acids are macromolecules responsible for storage, transmission and retrieval of genetic information</li>
<li>Two types of nucleic acids <b><b><b>DNA-Deoxyribonucleic</b></b></b> acid and <b><b><b>RNA-Ribonucleic</b></b></b> acid</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgba404dd"></a>Structure<br />
<div class="outline-text-5" id="text-orgba404dd">
<ul class="org-ul">
<li>Polymers of nucleotides</li>
<li>Each nucleotide consists of
<ul class="org-ul">
<li>Nitrogenous base</li>
<li>Pentose</li>
<li>At least one phosphate group</li>
<li>DNA has A,T,C,G and deoxyribose</li>
<li>RNA has A,U,C,G and ribose</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org9725da1"></a>Formation<br />
<div class="outline-text-5" id="text-org9725da1">
<ul class="org-ul">
<li>Nitrogenous base binds to the 1' atom of the pentose -+  forms nucleoside</li>
<li>Phosphate reacts with the 5' hydroxyl group of the pentose -+  forms nucleotide * such nucleotides are called monophosphates * one or more phosphates may join the first one, forming nucleoside diphosphate, triphosphate etc. <b>*</b> Nucleic chain * Nucleic acids are composed of nucleic chains, same as proteins are composed of polypeptide chains</li>
<li>To form a polynucleotide the phosphate at the 5' atom of a pentose reacts with the 3' hydroxyl group of another pentose
<ul class="org-ul">
<li>creating a covalent bond</li>
</ul></li>
<li>The alternating phosphates and pentoses form a backbone
<ul class="org-ul">
<li>Their arrangement determines the <b><b>primary structure</b></b> of the nucleic acid</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org2cfb5e8"></a>Complementarity<br />
<div class="outline-text-5" id="text-org2cfb5e8">
<ul class="org-ul">
<li>Nitrogenous bases bind specifically by hydrogen bonds according to the complementary rule
<ul class="org-ul">
<li>A with T or U(2 bonds), C with G(3 bonds)</li>
</ul></li>
<li>Complementary binding defines the secondary structure of nucleic acids</li>
</ul>
</div>
</li>

<li><a id="org5efe35f"></a>The double helix and base stacking<br />
<div class="outline-text-5" id="text-org5efe35f">
<ul class="org-ul">
<li>Nitrogenous bases are **hydrophobic**(minimize their contact with water)</li>
<li>When two complementary strands bind, their bases stack together like cards to <b><b>exclude water molecules</b></b>
<ul class="org-ul">
<li>This forces the backbones to bend spirally, <b><b>forming a double-stranded helix</b></b></li>
</ul></li>

<li>To visualize nucleic acids we use cytochemical stains, e.g propidium iodide</li>
</ul>
</div>
</li>
<li><a id="org083ea6c"></a>DNA - helix types and functions<br />
<div class="outline-text-5" id="text-org083ea6c">
<ul class="org-ul">
<li>There are three types of double helices: A,B and Z</li>
<li><b><b>B DNA</b></b>
<ul class="org-ul">
<li>The main helix type of DNA</li>
<li>Right handed</li>
<li>10 nucleotide per turn</li>
<li>2 grooves, one minor and one major</li>
</ul></li>
<li><b><b>A DNA</b></b>
<ul class="org-ul">
<li>Dehydrated form of DNA</li>
<li>Similar to B DNA, but with <b><b>larger diameter</b></b></li>
</ul></li>
<li><b><b>Z DNA</b></b>
<ul class="org-ul">
<li>Z DNA is named so because its <b><b>backbone forms a zig-zag</b></b></li>
<li>Formed in small parts of DNA, mainly CGCGCG sequence</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org8964b7a"></a>DNA sense<br />
<div class="outline-text-5" id="text-org8964b7a">
<ul class="org-ul">
<li>To identify DNA strands, they are scored as the 'sense' and 'antisense'
<ul class="org-ul">
<li><b><b>Sense strand</b></b> - Positive : coding strand</li>
<li><b><b>Antisense</b></b> - Negative : Template strand, complementary to both positive sense and the RNA transcript</li>
<li>The term sense and anti-sense are relative only to particular RNA transcript, and not to the DNA strand as a whole</li>
<li>There are viruses, such as Arenaviruses, that are ambisense</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge4367ef" class="outline-4">
<h4 id="orge4367ef">RNA structure</h4>
<div class="outline-text-4" id="text-orge4367ef">
<ul class="org-ul">
<li>RNA molecules are linear molecules, much smaller than DNA</li>
<li>Single stranded
<ul class="org-ul">
<li>Often has double-stranded parts called stem-loops/hairpin loops</li>
</ul></li>
<li>Secondary Structure is determined by <b><b>loops</b></b></li>
<li>RNA undergoes 3D folding as in proteins, called tertiary structure
<ul class="org-ul">
<li>Both secondary and tertiary are based on primary structure</li>
</ul></li>
<li>Some RNAs have catalytic activity, they are called <b><b>ribozymes</b></b></li>
</ul>
</div>
</div>

<div id="outline-container-org178797a" class="outline-4">
<h4 id="org178797a">RNA - types and functions</h4>
<div class="outline-text-4" id="text-org178797a">
</div>
<ul class="org-ul">
<li><a id="org5436c83"></a>RNAs involved in transcription or replication<br />
<div class="outline-text-5" id="text-org5436c83">
<ul class="org-ul">
<li>mRNA - Messenger RNA : Encodes amino acid sequence of a polypeptide</li>
<li>tRNA - Transfer RNA : Brings amino acids to ribosomes during translation</li>
<li>rRNA - Ribosomal RNA : Makes up the ribosomes, with ribosomal proteins</li>

<li><b><b>mRNA</b></b>
<ul class="org-ul">
<li>no remarkable spacial structure</li>
<li>each mRNA is a copy of a gene encoding protein, and brings the "message" to ribosomes</li>
<li>The coding region of mRNA consists of nucleotide triplets called codons which are recognized by the tRNA anticodons</li>
<li>The first codon(AUG) is called the start codon, while the last codon is called the last stop codon</li>
</ul></li>
<li><b><b>rRNA</b></b>
<ul class="org-ul">
<li>Engaged in hairpin loops</li>
<li>Structural role - formation of ribosomal subunits
<ul class="org-ul">
<li>The largest rRNA is a ribozyme</li>
</ul></li>
</ul></li>
<li><b><b>tRNA</b></b>
<ul class="org-ul">
<li>Small</li>
<li>4 loops, 3 large and one small</li>
<li><b><b>Secondary structure</b></b> resembles a leaf</li>
<li><b><b>Tertiary structure</b></b> resembles L-like shape</li>
<li>tRNA function is to match amino acids according to mRNA instructions</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org959e758" class="outline-2">
<h2 id="org959e758">4. Recognition and self-assembly of macromolecules. Cytoskeleton.</h2>
<div class="outline-text-2" id="text-org959e758">
</div>
<div id="outline-container-orgdf07bd1" class="outline-4">
<h4 id="orgdf07bd1">Self-assembly of macromolecules</h4>
<div class="outline-text-4" id="text-orgdf07bd1">
<ul class="org-ul">
<li>Ability of macromolecules to recognize each other and specifically bind spontaneously, forming supermolecular structures
<ul class="org-ul">
<li>The recognition is based on spatial affinity, we can compare to a lock-key mechanism
<ul class="org-ul">
<li>Self-assembled complexes are held together by non-covalent bonds</li>
</ul></li>
</ul></li>
<li>Complementary recognition and bidning of nucleotides <b><b>allows replication and transcription</b></b>, the basis of life</li>
<li>Heating above 70C causes denaturation of DNA - seperation of the two strands
<ul class="org-ul">
<li>but this process is reversible, when the solution is cooled cown, DNA strands find their complementary partners and pair by hydrogen bonds
<ul class="org-ul">
<li>this process is called annealing</li>
</ul></li>
<li>if the paired strands are derived from one and the <b><b>same molecule</b></b>, the annealing is called <b><b>renaturation or reassociation</b></b>.</li>
<li>if the pairned strands are derived from <b><b>different DNA molecules</b></b>, the annealing is called <b><b>hybridization</b></b></li>
<li>RNAs also hybridize</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1615182" class="outline-4">
<h4 id="org1615182">Cytoskeleton</h4>
<div class="outline-text-4" id="text-org1615182">
</div>
<ul class="org-ul">
<li><a id="org02db4d0"></a>Types - Ranked by size<br />
<div class="outline-text-5" id="text-org02db4d0">
<ul class="org-ul">
<li>Microfilaments
<ul class="org-ul">
<li>Helix appearing as made up of 2 protofilaments</li>
<li>Consist of Actin(globular protein)</li>
</ul></li>
<li>Intermediate filaments
<ul class="org-ul">
<li>Bundle of tetramers made of dimers</li>
<li>Fibrous proteins(keratins in epithelial, desmin in muscle)</li>
</ul></li>
<li>Microtubules
<ul class="org-ul">
<li>Hollow tube of 13 protofilaments made of AB-tubulin dimers</li>
</ul></li>
</ul>
<ul class="org-ul">
<li>The cytoskeleton includes all of those types. Intermediate filaments are characteristic of animals(not in plants)</li>
</ul>
</div>
</li>

<li><a id="orgb4b51ae"></a>Microtubules<br />
<div class="outline-text-5" id="text-orgb4b51ae">
<ul class="org-ul">
<li>Self-assemble from dimers composed of alpha and beta tubulin. Energy from GTP is used</li>
<li>Microtubules are hollow tubes <b>with a diameter of 25nm</b></li>
<li>Microtubule is <b><b>composed of 13 protofilaments</b></b></li>
<li>Eventhough some microtubules e.g in flagella are very stable, microtubules in cytoplasm have a property called dynamic instability
<ul class="org-ul">
<li>It means that their + end grows by addition of tubulin dimer but occasionally collapses</li>
<li>Dynamic instability is regulated, it is increased when the cell starts division</li>
</ul></li>
</ul>
</div>
</li>
