content/Biology.org
**** Microfilament composition, assembly and polarity
+ Microfilaments are assembled from actin using ATP energy. The single soluble actin molecules are called **globular (G-) actin** while those included in microfilaments are called **fibrillar (F-) actin**
+ Acting molecules are arranged in a double helix
  + The microfilament can be described as a single helix
+ Microfilaments **grow just one of their ends**, its called '+' while the other one is '-'

****# Myosins
+ Microfilaments responsible for transport of membrane organelles, as well as movement and shape changes
+ Motor proteins, called myosins use **ATP to move to the '+' end**
+ Has a **head** with ATPase activity and along fibrous **tail**
+  Myosin is unusual in that it is both a fibrous protein and an enzyme(ATPase)

**** Intermediate filaments
+ Size less than microtubules and bigger than microfilaments
+ **Fibrous proteins with the 'coiled coil' motif**
+ Provide mechanical support, **not fit for transport because they have NO POLARITY**
+ Common types :
  + Lamins
    + located in the nucleus, also called **Nuclear lamina**
  + keratins in epithelial
  + desmin in muscles
  + neurofilament proteins in neurons

* TODO 5. Transcription.
**** General characteristics
+ DNA function is to just store genetic information
  + genes are expressed only after their translation into RNA
+ *Transcription is a process of RNA synthesis using a particular DNA segment as a template*
  + The copied DNA segment has specific beginning and end sequences to define the first and last point ofthe transcription
  + Each DNA strand is a template for some genes and complementary(coding) for other genes
  + The template DNA and synthesized RNA are antiparallel and complementary(A-U, G-C)
  + The direction of RNA synthesis is 5'->3'
****

DNA
L
* TODO 6. RNA processing.

* TODO 7. Genetic code. Translation.

* TODO 8. Proteins after translation: sorting, folding, modifications, degradation.

* 9. DNA replication.
*** DNA Replication
+ Semiconservative
  + Takes 2 old strands, makes 2 new strands complementary to them
+ Occurs in a 5' -> 3' direction
  + 5' -> phosphate
  + 3' -> OH group
+ DNA replication is *bi-directional*
+ Has 3 phases, *Initiation, Elongation, Termination*
**** Initiation
+ Starts at *origin of replication(ori)*
  + Consists of AT-rich sequences(TATA box regions)
  + /A-T has 2 hydrogen bonds, easy to brake compared to C-G(3 bonds)/
  + Eukaryotes have multiple multiple oris, Prokaryotes have a single origin
+ *Replication fork*
  + Y spahed region where both leading and lagging strands are replicated from the DNA template
  + Replication occurs in both strands simultaneously(bidirectional but always on a 5'->3' direction)
+ Pre-replication protein complex binds at origin replication, seperating A-T
  + Creates "replication bubble"
  + *Helicase* is found in each replication fork(one in each end), extending seperation
    + Helicase consumes high amounts of energy
    + Helicase causes supercoils, making harder to unwind DNA strands as the process goes on
+ *Topoisomerase* cause supercoil relaxtion
  + *Topoisomerases I and II* are found in *Eukaryotic cells*
    + Cancer drugs target Topoisomerase I (e.g Irinotecan/Topotecan) and type II (e.g Etoposide/Tenoposide)
  + *Topoisomerases II and IV* are found in *Prokaryotic cells*
    + We target Topoisomerase II for bacterial infections using *Fluoroquinolones*
**** Elongation
+ *Primer Synthesis*
  + /Synthesized by RNA primase/
  + Provide a 3'-OH group to which DNA polymerases can attach a DNA nucleotide
+ *DNA synthesis*
  + Occurs continuously in the leading strand, discontinuously in the lagging strand(formed as Okazaki fragment)
  + Primer removal and DNA polymerase I replaces the RNA primer and proofreads it
  + DNA ligase joins the free ends of Okazaki fragments
**** Termination
+ Initiated by binding termination proteins to termination sequences, /usually when helicases meet/



**** Enzymes
| Helicase    | Primase                               | DNA Polymerase III            | DNA Polymerase I                                | Ligase                          | Telomerase                                                                             |
|-------------+---------------------------------------+-------------------------------+-------------------------------------------------+---------------------------------+----------------------------------------------------------------------------------------|
| Unwinds DNA | Enzyme that makes RNA primers         | *Needs 3' OH of RNA primer*   | *Removes Primers in a 5-3 exonuclease activity* | Fuse Okazaki fragments together | Express TTAGG*                                                                         |
|             | Enable DNA polymerase III to make DNA | Read 3' -> 5'                 | Reads in a 3' -> 5'                             |                                 | Uses RNA to make DNA, this is called *Reverse Transcription*                           |
|             | Reads 3' -> 5'                        | Synthesize 5' -> 3'           | Synthesize in a 5' -> 3'                        |                                 | High activity of telomerase is found in stem cells, and neoplastic cells(cancer cells) |
|             |                                       | Proof-reading:                | Proof-reading:                                  |                                 |                                                                                        |
|             | Synthesize 5' -> 3'                   | /3'->5' exonuclease activity/ | /3'->5' exonuclease activity/                   |                                 |                                                                                        |

**** Telomeres
+ Telomeres do NOT code for RNA
+ Each time DNA replicates, telomeres get shorter
+ Prevent gene loss
+ *Hayflick limit:* The maximum amount of time DNA can replicate

* TODO 10. RNA replication. Reverse transcription

* TODO 11. DNA repair.

* TODO 12. Prokaryotic genome and regulation of gene expression.
