public/Biology.html

<li><a id="org9635ff4"></a>Microfilament composition, assembly and polarity<br />
<div class="outline-text-5" id="text-org9635ff4">
<ul class="org-ul">
<li>Microfilaments are assembled from actin using ATP energy. The single soluble actin molecules are called <b><b>globular (G-) actin</b></b> while those included in microfilaments are called <b><b>fibrillar (F-) actin</b></b></li>
<li>Acting molecules are arranged in a double helix
<ul class="org-ul">
<li>The microfilament can be described as a single helix</li>
</ul></li>
<li>Microfilaments <b><b>grow just one of their ends</b></b>, its called '+' while the other one is '-'</li>
</ul>

<p>
****# Myosins
</p>
<ul class="org-ul">
<li>Microfilaments responsible for transport of membrane organelles, as well as movement and shape changes</li>
<li>Motor proteins, called myosins use <b><b>ATP to move to the '+' end</b></b></li>
<li>Has a <b><b>head</b></b> with ATPase activity and along fibrous <b><b>tail</b></b></li>
<li>Myosin is unusual in that it is both a fibrous protein and an enzyme(ATPase)</li>
</ul>
</div>
</li>

<li><a id="orgd9afdcf"></a>Intermediate filaments<br />
<div class="outline-text-5" id="text-orgd9afdcf">
<ul class="org-ul">
<li>Size less than microtubules and bigger than microfilaments</li>
<li><b><b>Fibrous proteins with the 'coiled coil' motif</b></b></li>
<li>Provide mechanical support, <b><b>not fit for transport because they have NO POLARITY</b></b></li>
<li>Common types :
<ul class="org-ul">
<li>Lamins
<ul class="org-ul">
<li>located in the nucleus, also called <b><b>Nuclear lamina</b></b></li>
</ul></li>
<li>keratins in epithelial</li>
<li>desmin in muscles</li>
<li>neurofilament proteins in neurons</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org142af55" class="outline-2">
<h2 id="org142af55"><span class="todo TODO">TODO</span> 5. Transcription.</h2>
<div class="outline-text-2" id="text-org142af55">
</div>
<ul class="org-ul">
<li><a id="org9f6b57b"></a>General characteristics<br />
<div class="outline-text-5" id="text-org9f6b57b">
<ul class="org-ul">
<li>DNA function is to just store genetic information
<ul class="org-ul">
<li>genes are expressed only after their translation into RNA</li>
</ul></li>
<li><b>Transcription is a process of RNA synthesis using a particular DNA segment as a template</b>
<ul class="org-ul">
<li>The copied DNA segment has specific beginning and end sequences to define the first and last point ofthe transcription</li>
<li>Each DNA strand is a template for some genes and complementary(coding) for other genes</li>
<li>The template DNA and synthesized RNA are antiparallel and complementary(A-U, G-C)</li>
<li>The direction of RNA synthesis is 5'-&gt;3'</li>
</ul></li>
</ul>
<p>
<b>**</b>
</p>

<p>
DNA
L
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd318799" class="outline-2">
<h2 id="orgd318799"><span class="todo TODO">TODO</span> 6. RNA processing.</h2>
</div>

<div id="outline-container-org09fb35c" class="outline-2">
<h2 id="org09fb35c"><span class="todo TODO">TODO</span> 7. Genetic code. Translation.</h2>
</div>

<div id="outline-container-org90061fe" class="outline-2">
<h2 id="org90061fe"><span class="todo TODO">TODO</span> 8. Proteins after translation: sorting, folding, modifications, degradation.</h2>
</div>

<div id="outline-container-org05f6591" class="outline-2">
<h2 id="org05f6591">9. DNA replication.</h2>
<div class="outline-text-2" id="text-org05f6591">
</div>
<div id="outline-container-orge11a667" class="outline-4">
<h4 id="orge11a667">DNA Replication</h4>
<div class="outline-text-4" id="text-orge11a667">
<ul class="org-ul">
<li>Semiconservative
<ul class="org-ul">
<li>Takes 2 old strands, makes 2 new strands complementary to them</li>
</ul></li>
<li>Occurs in a 5' -&gt; 3' direction
<ul class="org-ul">
<li>5' -&gt; phosphate</li>
<li>3' -&gt; OH group</li>
</ul></li>
<li>DNA replication is <b>bi-directional</b></li>
<li>Has 3 phases, <b>Initiation, Elongation, Termination</b></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org2c36252"></a>Initiation<br />
<div class="outline-text-5" id="text-org2c36252">
<ul class="org-ul">
<li>Starts at <b>origin of replication(ori)</b>
<ul class="org-ul">
<li>Consists of AT-rich sequences(TATA box regions)</li>
<li><i>A-T has 2 hydrogen bonds, easy to brake compared to C-G(3 bonds)</i></li>
<li>Eukaryotes have multiple multiple oris, Prokaryotes have a single origin</li>
</ul></li>
<li><b>Replication fork</b>
<ul class="org-ul">
<li>Y spahed region where both leading and lagging strands are replicated from the DNA template</li>
<li>Replication occurs in both strands simultaneously(bidirectional but always on a 5'-&gt;3' direction)</li>
</ul></li>
<li>Pre-replication protein complex binds at origin replication, seperating A-T
<ul class="org-ul">
<li>Creates "replication bubble"</li>
<li><b>Helicase</b> is found in each replication fork(one in each end), extending seperation
<ul class="org-ul">
<li>Helicase consumes high amounts of energy</li>
<li>Helicase causes supercoils, making harder to unwind DNA strands as the process goes on</li>
</ul></li>
</ul></li>
<li><b>Topoisomerase</b> cause supercoil relaxtion
<ul class="org-ul">
<li><b>Topoisomerases I and II</b> are found in <b>Eukaryotic cells</b>
<ul class="org-ul">
<li>Cancer drugs target Topoisomerase I (e.g Irinotecan/Topotecan) and type II (e.g Etoposide/Tenoposide)</li>
</ul></li>
<li><b>Topoisomerases II and IV</b> are found in <b>Prokaryotic cells</b>
<ul class="org-ul">
<li>We target Topoisomerase II for bacterial infections using <b>Fluoroquinolones</b></li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orgbbb06ec"></a>Elongation<br />
<div class="outline-text-5" id="text-orgbbb06ec">
<ul class="org-ul">
<li><b>Primer Synthesis</b>
<ul class="org-ul">
<li><i>Synthesized by RNA primase</i></li>
<li>Provide a 3'-OH group to which DNA polymerases can attach a DNA nucleotide</li>
</ul></li>
<li><b>DNA synthesis</b>
<ul class="org-ul">
<li>Occurs continuously in the leading strand, discontinuously in the lagging strand(formed as Okazaki fragment)</li>
<li>Primer removal and DNA polymerase I replaces the RNA primer and proofreads it</li>
<li>DNA ligase joins the free ends of Okazaki fragments</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org0475ce1"></a>Termination<br />
<div class="outline-text-5" id="text-org0475ce1">
<ul class="org-ul">
<li>Initiated by binding termination proteins to termination sequences, <i>usually when helicases meet</i></li>
</ul>
</div>
</li>



<li><a id="org86eb0d1"></a>Enzymes<br />
<div class="outline-text-5" id="text-org86eb0d1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Helicase</th>
<th scope="col" class="org-left">Primase</th>
<th scope="col" class="org-left">DNA Polymerase III</th>
<th scope="col" class="org-left">DNA Polymerase I</th>
<th scope="col" class="org-left">Ligase</th>
<th scope="col" class="org-left">Telomerase</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Unwinds DNA</td>
<td class="org-left">Enzyme that makes RNA primers</td>
<td class="org-left"><b>Needs 3' OH of RNA primer</b></td>
<td class="org-left"><b>Removes Primers in a 5-3 exonuclease activity</b></td>
<td class="org-left">Fuse Okazaki fragments together</td>
<td class="org-left">Express TTAGG*</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Enable DNA polymerase III to make DNA</td>
<td class="org-left">Read 3' -&gt; 5'</td>
<td class="org-left">Reads in a 3' -&gt; 5'</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Uses RNA to make DNA, this is called <b>Reverse Transcription</b></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Reads 3' -&gt; 5'</td>
<td class="org-left">Synthesize 5' -&gt; 3'</td>
<td class="org-left">Synthesize in a 5' -&gt; 3'</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">High activity of telomerase is found in stem cells, and neoplastic cells(cancer cells)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Proof-reading:</td>
<td class="org-left">Proof-reading:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Synthesize 5' -&gt; 3'</td>
<td class="org-left"><i>3'-&gt;5' exonuclease activity</i></td>
<td class="org-left"><i>3'-&gt;5' exonuclease activity</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org3969d6e"></a>Telomeres<br />
<div class="outline-text-5" id="text-org3969d6e">
<ul class="org-ul">
<li>Telomeres do NOT code for RNA</li>
<li>Each time DNA replicates, telomeres get shorter</li>
<li>Prevent gene loss</li>
<li><b>Hayflick limit:</b> The maximum amount of time DNA can replicate</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf63b7b7" class="outline-2">
<h2 id="orgf63b7b7"><span class="todo TODO">TODO</span> 10. RNA replication. Reverse transcription</h2>
</div>

<div id="outline-container-org9bbae2f" class="outline-2">
<h2 id="org9bbae2f"><span class="todo TODO">TODO</span> 11. DNA repair.</h2>
</div>

<div id="outline-container-orgccef6d4" class="outline-2">
<h2 id="orgccef6d4"><span class="todo TODO">TODO</span> 12. Prokaryotic genome and regulation of gene expression.</h2>
</div>
