content/Biology.org
* TODO 13. Eukaryotic genome and regulation of gene expression.
* TODO 14. Cytoplasmic (extrachromosomal) inheritance in prokaryotes and eukaryotes.
* TODO 15. General (homologous) recombination. Molecular mechanisms of crossing over.
* TODO 16. Site-specific recombination.
* TODO 17. Reproduction of viruses.
* TODO 18. Chromatin. Nucleosomes.
* TODO 19. Human karyotype. Types of chromosomes.
* TODO 20. Gene mutations. Mechanisms and mutagenic factors.
* TODO 21. Chromosomal mutations. Evolution of karyotype.
* TODO 22. Genes and alleles. Dominance and recessivity - mechanisms, medical examples. Penetrance and expressivity.
* TODO 23. Phenotype, genotype and allele frequencies. Hardy – Weinberg law.
* TODO 24. Factors influencing allele frequencies: mutations, migrations, natural selection.
* TODO 25. Effects of isolation: genetic drift, inbreeding.
* TODO 26. Quantitative traits.
* 27. Cell cycle. Mitosis. Cell cycle control.
+ *Cell cycle*
  + the sequence of stages through which a cell passes from one cell division to the next
+ *Mitosis (M)*
  + a type of cell division in which a daughter cell receives the same number of chromosomes as the parent cell
+ *Cytokinesis*
  + the division of cytoplasm
+ *Interphase*
  + the time interval between nuclear divisions when a cell increases in mass
  + roughly doubles the cytoplasmic components, and duplicates its chromosomes
*** Interphase
+ Cells spend most their lives in interphase. /Cells are not actively dividing in this phase/
+ Includes G1,S,S phases of cell cycle
  + *G1* -> Cell undergoes rapid growth, chromosomes unduplicated
  + *S*  -> Cell prepares for division by duplicating its chromosomes
  + *G2* -> Cell grows and completes preparation for division(Mitosis)
*** Mitosis
**** Prophase
+ Chromosomes become visible under microscope
+ Centrioles seperate and move to opposite poles, provide attachment for the spindle fibers
  + Spindle fibers serve as guide wires for the attachment and movement of the chromosomes during cell division
+ Nuclear membrane appears to fade, it is dissolving to allow seperation of chromosomes and cell organelles
**** Metaphase
+ Chromosomes composed of sister chromatids move toward the center of the cell. /This are is called equatorial plate/
+ Chromosomes appear as dark, thick filamentous structures that are attched to spindle fibers.
+ Chromatids can become interwined during metaphase
**** Anaphase
+ Centromere divide and sister chromatids, /now referred to as chromosomes/ move to opposite poles of the cell
+ If mitosis proceeds correctly, the same number and type of chromosomes will be found at each pole
**** Telophase
+ Chromosomes reach the opposite poles and begin to lengthen.
+ Spindle fibers dissolve and a nuclear membrane forms around each mass of chromatin
**** Cytokinesis
+ Division of cytoplasm
**** Mitosis in intracellular parasites
***** Endodyogeny
+ Formation of two daughter cells, surrounded by their own membrane, while still in mother cell
+ e.g Toxoplasma gondii
***** Endopolyogeny
+ Formation of many daughter cells, each surrounded by its own membrane while still in mother cell
*** Cell cycle control
+ For each checkpoint permission needs to be granted, mediated by hormones and growth factors
+ *G1 Checkpoint*
  + Is the cell sufficiently big?
  + Sufficient growth factors and nutrients?
+ *G2 Checkpoint*
  + Is DNA copied properly?
+ *M checkpoint*
  + Are chromosomes aligned prperly and attached to spindle?



* TODO 28. Growth factors, protooncogens, oncogenes, tumor suppressors. Oncogenic viruses
* TODO 29. Cell senescence. Cell death: apoptosis, necrosis.
*** Cell senescence
+ Cell sensescence -> Age related damage
  + "Debris" is not divided evenly between the new cells, instead it passes to one of the cells leavin the other cell clean
  + Cell population becomes a mosaic of cells with half ageless and the rest with ageing cells
**** Telomeres
+ Telomeres consist of non-coding double stranded repeats DNA sequences(TTAGGG)
+ In the leading strand synthesis continues until the end of the chromosome is reached; however, on the lagging strand there is no place for a primer to be made for the DNA gragment to be copied at the end of the chromosome

* TODO 30. Cell signaling. Cell receptors.
* TODO 31. Meiosis. Origin of germ cells.
* TODO 32. Spermatogenesis. Mammalian spermatozoa.
* TODO 33. Oogenesis. Mature mammalian ova.
* TODO 34. Fertilization. Interaction of maternal and paternal genomes.
* TODO 35. Assisted reproduction: IVF, ICSI.
* TODO 36. Embryonic development – early stages (zygote to neurula).
* TODO 37. Embryonic development – regulative and mosaic. Morphogens and embryonic induction.
* TODO 38. Preimplantation mammalian embryo.
* 39. Sex determination and differentiation.
**** Hermaphrodites
+ Most plants and some worms that contain both male and female sexual organs | /simultaneous hermaphrodites/
+ Some fish such as clown-fish are born males and change into females(dominant one becomes female) |  /sequential hermaphrodites/
