public/Biology.html
<div id="outline-container-orgedec917" class="outline-2">
<h2 id="orgedec917"><span class="todo TODO">TODO</span> 13. Eukaryotic genome and regulation of gene expression.</h2>
</div>
<div id="outline-container-orgb6fd41c" class="outline-2">
<h2 id="orgb6fd41c"><span class="todo TODO">TODO</span> 14. Cytoplasmic (extrachromosomal) inheritance in prokaryotes and eukaryotes.</h2>
</div>
<div id="outline-container-org8cbb67d" class="outline-2">
<h2 id="org8cbb67d"><span class="todo TODO">TODO</span> 15. General (homologous) recombination. Molecular mechanisms of crossing over.</h2>
</div>
<div id="outline-container-org27664aa" class="outline-2">
<h2 id="org27664aa"><span class="todo TODO">TODO</span> 16. Site-specific recombination.</h2>
</div>
<div id="outline-container-orgb338e0c" class="outline-2">
<h2 id="orgb338e0c"><span class="todo TODO">TODO</span> 17. Reproduction of viruses.</h2>
</div>
<div id="outline-container-org5efb754" class="outline-2">
<h2 id="org5efb754"><span class="todo TODO">TODO</span> 18. Chromatin. Nucleosomes.</h2>
</div>
<div id="outline-container-org1909bd3" class="outline-2">
<h2 id="org1909bd3"><span class="todo TODO">TODO</span> 19. Human karyotype. Types of chromosomes.</h2>
</div>
<div id="outline-container-org25ffa47" class="outline-2">
<h2 id="org25ffa47"><span class="todo TODO">TODO</span> 20. Gene mutations. Mechanisms and mutagenic factors.</h2>
</div>
<div id="outline-container-org591ed08" class="outline-2">
<h2 id="org591ed08"><span class="todo TODO">TODO</span> 21. Chromosomal mutations. Evolution of karyotype.</h2>
</div>
<div id="outline-container-orgb776e49" class="outline-2">
<h2 id="orgb776e49"><span class="todo TODO">TODO</span> 22. Genes and alleles. Dominance and recessivity - mechanisms, medical examples. Penetrance and expressivity.</h2>
</div>
<div id="outline-container-orge3f4f50" class="outline-2">
<h2 id="orge3f4f50"><span class="todo TODO">TODO</span> 23. Phenotype, genotype and allele frequencies. Hardy – Weinberg law.</h2>
</div>
<div id="outline-container-org9b3e655" class="outline-2">
<h2 id="org9b3e655"><span class="todo TODO">TODO</span> 24. Factors influencing allele frequencies: mutations, migrations, natural selection.</h2>
</div>
<div id="outline-container-orgd99a6a9" class="outline-2">
<h2 id="orgd99a6a9"><span class="todo TODO">TODO</span> 25. Effects of isolation: genetic drift, inbreeding.</h2>
</div>
<div id="outline-container-org910313a" class="outline-2">
<h2 id="org910313a"><span class="todo TODO">TODO</span> 26. Quantitative traits.</h2>
</div>
<div id="outline-container-org152e6bc" class="outline-2">
<h2 id="org152e6bc">27. Cell cycle. Mitosis. Cell cycle control.</h2>
<div class="outline-text-2" id="text-org152e6bc">
<ul class="org-ul">
<li><b>Cell cycle</b>
<ul class="org-ul">
<li>the sequence of stages through which a cell passes from one cell division to the next</li>
</ul></li>
<li><b>Mitosis (M)</b>
<ul class="org-ul">
<li>a type of cell division in which a daughter cell receives the same number of chromosomes as the parent cell</li>
</ul></li>
<li><b>Cytokinesis</b>
<ul class="org-ul">
<li>the division of cytoplasm</li>
</ul></li>
<li><b>Interphase</b>
<ul class="org-ul">
<li>the time interval between nuclear divisions when a cell increases in mass</li>
<li>roughly doubles the cytoplasmic components, and duplicates its chromosomes</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org03703ae" class="outline-4">
<h4 id="org03703ae">Interphase</h4>
<div class="outline-text-4" id="text-org03703ae">
<ul class="org-ul">
<li>Cells spend most their lives in interphase. <i>Cells are not actively dividing in this phase</i></li>
<li>Includes G1,S,S phases of cell cycle
<ul class="org-ul">
<li><b>G1</b> -&gt; Cell undergoes rapid growth, chromosomes unduplicated</li>
<li><b>S</b>  -&gt; Cell prepares for division by duplicating its chromosomes</li>
<li><b>G2</b> -&gt; Cell grows and completes preparation for division(Mitosis)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd55efc7" class="outline-4">
<h4 id="orgd55efc7">Mitosis</h4>
<div class="outline-text-4" id="text-orgd55efc7">
</div>
<ul class="org-ul">
<li><a id="orgf0069d8"></a>Prophase<br />
<div class="outline-text-5" id="text-orgf0069d8">
<ul class="org-ul">
<li>Chromosomes become visible under microscope</li>
<li>Centrioles seperate and move to opposite poles, provide attachment for the spindle fibers
<ul class="org-ul">
<li>Spindle fibers serve as guide wires for the attachment and movement of the chromosomes during cell division</li>
</ul></li>
<li>Nuclear membrane appears to fade, it is dissolving to allow seperation of chromosomes and cell organelles</li>
</ul>
</div>
</li>
<li><a id="org6f3973b"></a>Metaphase<br />
<div class="outline-text-5" id="text-org6f3973b">
<ul class="org-ul">
<li>Chromosomes composed of sister chromatids move toward the center of the cell. <i>This are is called equatorial plate</i></li>
<li>Chromosomes appear as dark, thick filamentous structures that are attched to spindle fibers.</li>
<li>Chromatids can become interwined during metaphase</li>
</ul>
</div>
</li>
<li><a id="orgbde7477"></a>Anaphase<br />
<div class="outline-text-5" id="text-orgbde7477">
<ul class="org-ul">
<li>Centromere divide and sister chromatids, <i>now referred to as chromosomes</i> move to opposite poles of the cell</li>
<li>If mitosis proceeds correctly, the same number and type of chromosomes will be found at each pole</li>
</ul>
</div>
</li>
<li><a id="org86789a6"></a>Telophase<br />
<div class="outline-text-5" id="text-org86789a6">
<ul class="org-ul">
<li>Chromosomes reach the opposite poles and begin to lengthen.</li>
<li>Spindle fibers dissolve and a nuclear membrane forms around each mass of chromatin</li>
</ul>
</div>
</li>
<li><a id="org25a64cf"></a>Cytokinesis<br />
<div class="outline-text-5" id="text-org25a64cf">
<ul class="org-ul">
<li>Division of cytoplasm</li>
</ul>
</div>
</li>
<li><a id="org861c705"></a>Mitosis in intracellular parasites<br />
<ul class="org-ul">
<li><a id="org31e83e9"></a>Endodyogeny<br />
<div class="outline-text-6" id="text-org31e83e9">
<ul class="org-ul">
<li>Formation of two daughter cells, surrounded by their own membrane, while still in mother cell</li>
<li>e.g Toxoplasma gondii</li>
</ul>
</div>
</li>
<li><a id="org170c69d"></a>Endopolyogeny<br />
<div class="outline-text-6" id="text-org170c69d">
<ul class="org-ul">
<li>Formation of many daughter cells, each surrounded by its own membrane while still in mother cell</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org7cd38db" class="outline-4">
<h4 id="org7cd38db">Cell cycle control</h4>
<div class="outline-text-4" id="text-org7cd38db">
<ul class="org-ul">
<li>For each checkpoint permission needs to be granted, mediated by hormones and growth factors</li>
<li><b>G1 Checkpoint</b>
<ul class="org-ul">
<li>Is the cell sufficiently big?</li>
<li>Sufficient growth factors and nutrients?</li>
</ul></li>
<li><b>G2 Checkpoint</b>
<ul class="org-ul">
<li>Is DNA copied properly?</li>
</ul></li>
<li><b>M checkpoint</b>
<ul class="org-ul">
<li>Are chromosomes aligned prperly and attached to spindle?</li>
</ul></li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org8ad32b1" class="outline-2">
<h2 id="org8ad32b1"><span class="todo TODO">TODO</span> 28. Growth factors, protooncogens, oncogenes, tumor suppressors. Oncogenic viruses</h2>
</div>
<div id="outline-container-org6d4b883" class="outline-2">
<h2 id="org6d4b883"><span class="todo TODO">TODO</span> 29. Cell senescence. Cell death: apoptosis, necrosis.</h2>
<div class="outline-text-2" id="text-org6d4b883">
</div>
<div id="outline-container-org9b40395" class="outline-4">
<h4 id="org9b40395">Cell senescence</h4>
<div class="outline-text-4" id="text-org9b40395">
<ul class="org-ul">
<li>Cell sensescence -&gt; Age related damage
<ul class="org-ul">
<li>"Debris" is not divided evenly between the new cells, instead it passes to one of the cells leavin the other cell clean</li>
<li>Cell population becomes a mosaic of cells with half ageless and the rest with ageing cells</li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org3c9a9ff"></a>Telomeres<br />
<div class="outline-text-5" id="text-org3c9a9ff">
<ul class="org-ul">
<li>Telomeres consist of non-coding double stranded repeats DNA sequences(TTAGGG)</li>
<li>In the leading strand synthesis continues until the end of the chromosome is reached; however, on the lagging strand there is no place for a primer to be made for the DNA gragment to be copied at the end of the chromosome</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5ac99f" class="outline-2">
<h2 id="orgd5ac99f"><span class="todo TODO">TODO</span> 30. Cell signaling. Cell receptors.</h2>
</div>
<div id="outline-container-orge0b8e12" class="outline-2">
<h2 id="orge0b8e12"><span class="todo TODO">TODO</span> 31. Meiosis. Origin of germ cells.</h2>
</div>
<div id="outline-container-org5cd5169" class="outline-2">
<h2 id="org5cd5169"><span class="todo TODO">TODO</span> 32. Spermatogenesis. Mammalian spermatozoa.</h2>
</div>
<div id="outline-container-org191a62d" class="outline-2">
<h2 id="org191a62d"><span class="todo TODO">TODO</span> 33. Oogenesis. Mature mammalian ova.</h2>
</div>
<div id="outline-container-org193bb8e" class="outline-2">
<h2 id="org193bb8e"><span class="todo TODO">TODO</span> 34. Fertilization. Interaction of maternal and paternal genomes.</h2>
</div>
<div id="outline-container-org31f8b4b" class="outline-2">
<h2 id="org31f8b4b"><span class="todo TODO">TODO</span> 35. Assisted reproduction: IVF, ICSI.</h2>
</div>
<div id="outline-container-orgc162214" class="outline-2">
<h2 id="orgc162214"><span class="todo TODO">TODO</span> 36. Embryonic development – early stages (zygote to neurula).</h2>
</div>
<div id="outline-container-orgef48a7a" class="outline-2">
<h2 id="orgef48a7a"><span class="todo TODO">TODO</span> 37. Embryonic development – regulative and mosaic. Morphogens and embryonic induction.</h2>
</div>
<div id="outline-container-orgac21747" class="outline-2">
<h2 id="orgac21747"><span class="todo TODO">TODO</span> 38. Preimplantation mammalian embryo.</h2>
</div>
<div id="outline-container-org165d0be" class="outline-2">
<h2 id="org165d0be">39. Sex determination and differentiation.</h2>
<div class="outline-text-2" id="text-org165d0be">
</div>
<ul class="org-ul">
<li><a id="orga59f2ce"></a>Hermaphrodites<br />
<div class="outline-text-5" id="text-orga59f2ce">
<ul class="org-ul">
<li>Most plants and some worms that contain both male and female sexual organs | <i>simultaneous hermaphrodites</i></li>
<li>Some fish such as clown-fish are born males and change into females(dominant one becomes female) |  <i>sequential hermaphrodites</i></li>
</ul>
</div>
</li>
