content/Biology.org
**** Temperature dependant sex determination
+ sex determination in some species of reptiles the sex is determined by the temperature at which the egg is incubated
*** Genotypic sex determination
+ Male heterogamety, /XY sex chromosomes/. The males produce spermatozoa that carry either X or Y
  + Occurs in mammals and some insects
+ Female heterogamety /ZW sex chromosomes/. Females produce oocytes that carry either Z or W
  + Occurs in birds, snakes and some fish
+ In some cases, sex is under control of cytoplasmic elements, /usually in arthropods and nematodes/
  + /This is used to manipulate reproduction of mosquitoes and other disease vectors/
    + /e.g Introducing Wolbachia into a mosquito(such as Aedes) population will reduce male mosquitoes/
**** Primary Sex Determination
+ *Determination of gonads*
  + In mammals it is strictly chromosomal
  + Determined by presence or absence of Y chromosome
  + Formation of ovaries and testes are both active, gene-directed processes
**** Secondary Sex Determination
+ *Bodily phenotypes outside of gonads*
  + male has penis, seminal vesicles and prostate gland
  + female has vagina, cervix, uterus and mammary glands
  + Secondary sex characteristics such as size, determined by hormones secreted by gonads
  + *In the absence of gonads, the female phenotype is generated*
**** Sex chromosomes
+ Sex chromosomes may be:
| *Homorphic*     | equal length with relatively small SDR(sex determination region) |
|-----------------+------------------------------------------------------------------|
| *Heteromorphic* | Large SDR                                                        |
|-----------------+------------------------------------------------------------------|
| *X and Y*       | males are heterogametic                                          |
|-----------------+------------------------------------------------------------------|
| *W and Z*       | females are heterogametic                                        |
|-----------------+------------------------------------------------------------------|
+ The X and Y genes of humans:
  + Y chromosome is much shorter and only contains few genes (78 genes)
  + X chromosome is much longer and contains many genes not present in Y chromosome (~2000 genes)
  + /As a result, most sex-linked conditions are usually X-linked/
+ *Structure of Y Chromosome*
  + *Pseudo-autosomal regions(PARS)* /share homology with X chromosome and synapse with it during meiosis/
  + *Male-specific Y* /area composed of euchromatic regions contain functional genes and heterochromatic regions lacking genes/
    + Contains the *sex determining region(SRY)* /which encodes for testis-determining factor/
+ *X chromosome dosage compensation*
  + Each mammalian somatic cell, whether male or female has *only one function X chromosome*
  + The chromatin of the inactive X chromosome is converted into heterochromatin
  + The heterochromatic(inactive) X chromosome can often be seen on the nuclear of female cells
  + Inactivated X chromosome is referred to as *Barr body*

* TODO 40. Methods of karyotyping and chromosome analysis.
* TODO 41. Basic methods in molecular biology – electrophoresis, PCR, blotting, sequencing.
* TODO 42. Immunological methods. Diagnosis of viral infections.
* TODO 43. Recombinant DNA technology – restriction endonucleases, DNA vectors, recombinant proteins.
* TODO 44. Cell micro-manipulations.
* TODO 45. Transgenic animals. Gene therapy.
* 46. Innate immunity.
+ Innate/natural immunity is :
  + non-specific
  + Does NOT become more efficient after the first encounter
*** Barriers
+ Physical barrier; Skin
  + Mucous traps pathogens and does not allow them to adhere to epithelial cells
  + Mucosal surfaces also contain lysozyme which digests bacterial cell walls
+ Chemical barrier; Low pH in stomach, fatty acid secretions etc.
+ Biological barrier; Competition by other natural flora(e.g skin flora, lactobacilli in vaginal flora)
*** Internal defenses | Tissues
+ Two types *humoral* (macromolecule solutions) and *cellular* (based on direct action of cells)
**** Cellular defenses
+ Consist of leukocytes
  + *Phagocytes*
    + 2 cell types:
      | Neutrophils           | Macrophages               |
      |-----------------------+---------------------------|
      | small                 | larger                    |
      | segment nucleus       | non-segmented nucleus     |
      | *polymorphonuclear*   | *mononuclear*             |
      | Only in bloodstream   | *bloodstream and tissues* |
      | Short-lived(1-2 days) | long-lived                |
      |-----------------------+---------------------------|
      + *Mechanism of phagocytosis*
        + Phagocytes do not recognize specifically any molecule on the surface of an antigen, they *recognize its carbohydrate profile*
          + This is done by *pattern recognition receptors*
        + Phagocyte engulfs and fuses its lysosomes with the phagosome
        + Pathogen is killed by two mechanisms
          + oxygen-dependent; reactive oxygen intermediates
          + oxygen-independent; lysozyme,proteases etc.
        + Digestion by hydrolytic enzyme follows
+ *Extracellular killing*
  + Two cell types :
| *Eosinophils*                                          | *NK cells*                                                                  |
|--------------------------------------------------------+-----------------------------------------------------------------------------|
| Kill parasites by degranulation                        | Detect virus-infected cells and some cancer cells                           |
| Contain granules(lysosomes)                            | Granules contain *perforin*:                                                |
| Deliver lysosomal content by *exocytosis*              | ->Released on the target cell by exocytosis                                 |
| ->This process is called *extracellular degranulation* | Also secrete protease, which deliver signal for *apoptosis*                 |
|                                                        | If target does not die via apoptosis, necrosis follows(using more perforin) |
