public/Biology.html
<li><a id="orga435599"></a>Temperature dependant sex determination<br />
<div class="outline-text-5" id="text-orga435599">
<ul class="org-ul">
<li>sex determination in some species of reptiles the sex is determined by the temperature at which the egg is incubated</li>
</ul>
</div>
</li>
</ul>
<div id="outline-container-org381062e" class="outline-4">
<h4 id="org381062e">Genotypic sex determination</h4>
<div class="outline-text-4" id="text-org381062e">
<ul class="org-ul">
<li>Male heterogamety, <i>XY sex chromosomes</i>. The males produce spermatozoa that carry either X or Y
<ul class="org-ul">
<li>Occurs in mammals and some insects</li>
</ul></li>
<li>Female heterogamety <i>ZW sex chromosomes</i>. Females produce oocytes that carry either Z or W
<ul class="org-ul">
<li>Occurs in birds, snakes and some fish</li>
</ul></li>
<li>In some cases, sex is under control of cytoplasmic elements, <i>usually in arthropods and nematodes</i>
<ul class="org-ul">
<li><i>This is used to manipulate reproduction of mosquitoes and other disease vectors</i>
<ul class="org-ul">
<li><i>e.g Introducing Wolbachia into a mosquito(such as Aedes) population will reduce male mosquitoes</i></li>
</ul></li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org7a6837b"></a>Primary Sex Determination<br />
<div class="outline-text-5" id="text-org7a6837b">
<ul class="org-ul">
<li><b>Determination of gonads</b>
<ul class="org-ul">
<li>In mammals it is strictly chromosomal</li>
<li>Determined by presence or absence of Y chromosome</li>
<li>Formation of ovaries and testes are both active, gene-directed processes</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org115d713"></a>Secondary Sex Determination<br />
<div class="outline-text-5" id="text-org115d713">
<ul class="org-ul">
<li><b>Bodily phenotypes outside of gonads</b>
<ul class="org-ul">
<li>male has penis, seminal vesicles and prostate gland</li>
<li>female has vagina, cervix, uterus and mammary glands</li>
<li>Secondary sex characteristics such as size, determined by hormones secreted by gonads</li>
<li><b>In the absence of gonads, the female phenotype is generated</b></li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org4491834"></a>Sex chromosomes<br />
<div class="outline-text-5" id="text-org4491834">
<ul class="org-ul">
<li>Sex chromosomes may be:</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Homorphic</b></th>
<th scope="col" class="org-left">equal length with relatively small SDR(sex determination region)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Heteromorphic</b></td>
<td class="org-left">Large SDR</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>X and Y</b></td>
<td class="org-left">males are heterogametic</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>W and Z</b></td>
<td class="org-left">females are heterogametic</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>The X and Y genes of humans:
<ul class="org-ul">
<li>Y chromosome is much shorter and only contains few genes (78 genes)</li>
<li>X chromosome is much longer and contains many genes not present in Y chromosome (~2000 genes)</li>
<li><i>As a result, most sex-linked conditions are usually X-linked</i></li>
</ul></li>
<li><b>Structure of Y Chromosome</b>
<ul class="org-ul">
<li><b>Pseudo-autosomal regions(PARS)</b> <i>share homology with X chromosome and synapse with it during meiosis</i></li>
<li><b>Male-specific Y</b> <i>area composed of euchromatic regions contain functional genes and heterochromatic regions lacking genes</i>
<ul class="org-ul">
<li>Contains the <b>sex determining region(SRY)</b> <i>which encodes for testis-determining factor</i></li>
</ul></li>
</ul></li>
<li><b>X chromosome dosage compensation</b>
<ul class="org-ul">
<li>Each mammalian somatic cell, whether male or female has <b>only one function X chromosome</b></li>
<li>The chromatin of the inactive X chromosome is converted into heterochromatin</li>
<li>The heterochromatic(inactive) X chromosome can often be seen on the nuclear of female cells</li>
<li>Inactivated X chromosome is referred to as <b>Barr body</b></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgca56aeb" class="outline-2">
<h2 id="orgca56aeb"><span class="todo TODO">TODO</span> 40. Methods of karyotyping and chromosome analysis.</h2>
</div>
<div id="outline-container-orga64f15f" class="outline-2">
<h2 id="orga64f15f"><span class="todo TODO">TODO</span> 41. Basic methods in molecular biology – electrophoresis, PCR, blotting, sequencing.</h2>
</div>
<div id="outline-container-org66168aa" class="outline-2">
<h2 id="org66168aa"><span class="todo TODO">TODO</span> 42. Immunological methods. Diagnosis of viral infections.</h2>
</div>
<div id="outline-container-org51f3c14" class="outline-2">
<h2 id="org51f3c14"><span class="todo TODO">TODO</span> 43. Recombinant DNA technology – restriction endonucleases, DNA vectors, recombinant proteins.</h2>
</div>
<div id="outline-container-orgcab6ff3" class="outline-2">
<h2 id="orgcab6ff3"><span class="todo TODO">TODO</span> 44. Cell micro-manipulations.</h2>
</div>
<div id="outline-container-orgf7a657a" class="outline-2">
<h2 id="orgf7a657a"><span class="todo TODO">TODO</span> 45. Transgenic animals. Gene therapy.</h2>
</div>
<div id="outline-container-orgcfd8414" class="outline-2">
<h2 id="orgcfd8414">46. Innate immunity.</h2>
<div class="outline-text-2" id="text-orgcfd8414">
<ul class="org-ul">
<li>Innate/natural immunity is :
<ul class="org-ul">
<li>non-specific</li>
<li>Does NOT become more efficient after the first encounter</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org4fb3a8f" class="outline-4">
<h4 id="org4fb3a8f">Barriers</h4>
<div class="outline-text-4" id="text-org4fb3a8f">
<ul class="org-ul">
<li>Physical barrier; Skin
<ul class="org-ul">
<li>Mucous traps pathogens and does not allow them to adhere to epithelial cells</li>
<li>Mucosal surfaces also contain lysozyme which digests bacterial cell walls</li>
</ul></li>
<li>Chemical barrier; Low pH in stomach, fatty acid secretions etc.</li>
<li>Biological barrier; Competition by other natural flora(e.g skin flora, lactobacilli in vaginal flora)</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf357b3" class="outline-4">
<h4 id="orgaf357b3">Internal defenses | Tissues</h4>
<div class="outline-text-4" id="text-orgaf357b3">
<ul class="org-ul">
<li>Two types <b>humoral</b> (macromolecule solutions) and <b>cellular</b> (based on direct action of cells)</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orga2cf86a"></a>Cellular defenses<br />
<div class="outline-text-5" id="text-orga2cf86a">
<ul class="org-ul">
<li>Consist of leukocytes
<ul class="org-ul">
<li><b>Phagocytes</b>
<ul class="org-ul">
<li><p>
2 cell types:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Neutrophils</th>
<th scope="col" class="org-left">Macrophages</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">small</td>
<td class="org-left">larger</td>
</tr>

<tr>
<td class="org-left">segment nucleus</td>
<td class="org-left">non-segmented nucleus</td>
</tr>

<tr>
<td class="org-left"><b>polymorphonuclear</b></td>
<td class="org-left"><b>mononuclear</b></td>
</tr>

<tr>
<td class="org-left">Only in bloodstream</td>
<td class="org-left"><b>bloodstream and tissues</b></td>
</tr>

<tr>
<td class="org-left">Short-lived(1-2 days)</td>
<td class="org-left">long-lived</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li><b>Mechanism of phagocytosis</b>
<ul class="org-ul">
<li>Phagocytes do not recognize specifically any molecule on the surface of an antigen, they <b>recognize its carbohydrate profile</b>
<ul class="org-ul">
<li>This is done by <b>pattern recognition receptors</b></li>
</ul></li>
<li>Phagocyte engulfs and fuses its lysosomes with the phagosome</li>
<li>Pathogen is killed by two mechanisms
<ul class="org-ul">
<li>oxygen-dependent; reactive oxygen intermediates</li>
<li>oxygen-independent; lysozyme,proteases etc.</li>
</ul></li>
<li>Digestion by hydrolytic enzyme follows</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
<li><b>Extracellular killing</b>
<ul class="org-ul">
<li>Two cell types :</li>
</ul></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Eosinophils</b></th>
<th scope="col" class="org-left"><b>NK cells</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Kill parasites by degranulation</td>
<td class="org-left">Detect virus-infected cells and some cancer cells</td>
</tr>

<tr>
<td class="org-left">Contain granules(lysosomes)</td>
<td class="org-left">Granules contain <b>perforin</b>:</td>
</tr>

<tr>
<td class="org-left">Deliver lysosomal content by <b>exocytosis</b></td>
<td class="org-left">-&gt;Released on the target cell by exocytosis</td>
</tr>

<tr>
<td class="org-left">-&gt;This process is called <b>extracellular degranulation</b></td>
<td class="org-left">Also secrete protease, which deliver signal for <b>apoptosis</b></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">If target does not die via apoptosis, necrosis follows(using more perforin)</td>
</tr>
</tbody>
</table>
</div>
</li>
