content/Biology.org
**** Humoral defenses | Complement
+ Most important humoral defense is a set of plasma proteins called *complement system*,
  + Most important complement protein is C3
    + C3 is cleaved into C3a(smaller) and C3b(larger) by *C3 convertase*
    + C3b is stabilized by binding to microbial cell wall, facilitating phagocytosis via *opsonization*
      + Phagocytes have receptors for C3b
  + *Classical Pathway*
    + activated by antigen/antibody complexes.
    + Proteases C1r and C1s cleave C4 and C2 to generate the Classical pathway C3 convertase C4b2a.
  + *Alternative Complement Pathway*
    + Trigerred by polysaccharides in bacterial and fungal cells
    + an amplification loop, is triggered when the C3b protein directly binds a microbe, foreign material, or damaged tissue.
    + C3b also binds factor B (fB) to form C3bB. FB is cleaved by factor D (fD) to form Alternative pathway C3-convertase, C3bBb.
  + *Lectin pathway*
    + triggered by binding of mannose-binding lectin (MBL) to carbohydrates on the target membrane.
    + The MBL-associated serine proteases (MASPs) then cleave C4 and C2 generating the C3-convertase C4b2a.
  + C3b opsonize targets for phagocytosis and B-Cell activation
**** TODO Inflammation
+ Inflammation is activation of local innate immunity, both cellular and humoral, usually due to injury
  + /Signs of inflammation : pain, heat, redness and swelling/
+ Mast cells and basophils are responsible for inflammatory reactions
  + both contain granules full of histamine
+

* 47. Structure of antibodies.
+ Antibodies/immunoglobulins are protective proteins produced by the immune system in response to the presence of a foreign substance, /called an antigen/
*** Antibodies | Structure
+ Antibodies are divided into five classes based on their structure and immune function
  + IgM, IgG, IgA, IgD and IgE
+ Each antibody consists of *two heavey chains and two light chains* (4 polypeptides), joined to form a "Y" shaped molecule
+ The amino acid sequence in the tips of "Y" varies greatly among different antibodies
  + This variable region, composed of 110-130 amino acids, give the antibody its *specificity for binding antigen*
  + The variable region includes the *ends of the light and heavy chains*
    + /Treating the antibody with a protease can cleave this region, producing a fragment that includes the variable ends of an antibody/
    + /This fragment is commonly used for research studies/
+ Immunoglobin chains are composed of *domains*
  + Light chain has 2 domains; 1 variable and 1 constant , found in the N-terminal position
  + Heavy chain has 4-5 domains; 1 variable, the rest are constant
  + Depending on the constant part, there are different isotypes
    + The lighht chain has 2 isotypes: *kappa and lambda*, similar and perform same functions
    + Heavy chain has 5 isotypes: γ,α,μ,δ and ε.
      + IgG -> γ -> Most abudant, found mainly in blood, protect against bacteria and viruses
      + IgA -> α -> Found in saliva, mucous and breast milk, protect against ingested and inhaled pathogens
      + IgM -> μ -> Found in blood and lymph system, First line of defence against infections
      + IgE -> ε -> Found in lungs and skin, cause must cells to release histamine, fight off alergic reactions
      + IgD -> δ -> Found in the surface of B cells, help B cells maturation and activation
    + IgM and IgE have 5 domain heavy chain, the rest have 4
+ The 3D immunoglobulin structure is based on *beta sheets*
* 48. Functions of antibodies.
+ Antibodies/immunoglobulins are protective proteins produced by the immune system in response to the presence of a foreign substance, /called an antigen/
*** How antibodies work
+ Antibodies are produced by B lymphocytes(B cells)
  + When an alien substance enters the body, the immune system is able to recognize it as foreign because molecules on the surface of the antigen differ from those in the body
+ When an antigen binds to the B-cell surface, it stimulates the B-cell to divide and mature into a group of identical cells
+ Mature B cells, called plasma cells, secrete millions of antibodies into the bloodstream and lymphatic system
*** Functions and Usage
**** Neutralization of toxins
+ Antibodies against toxins are called *antitoxins*
  + They bind their targets and prevent their toxic action by distorting their active sites
+ To obtain an animal antitoxin, an animal is immunized with toxoid; Toxin inactivated by formalin or heat, but still immunogenic
+ We use animal's serum to relieve patients suffering from toxin - *Passive immunization*
+ We use toxoid injections in certain vaccines(e.g Diphtheria, tetanus), as well as for anti-venom snake vaccines
**** Consequences of antigen binding
+ *antibodies have no toxic activity*
  + Antibodies can bind toxins/antigens but cannot destroy them because they are not enzymes
+ Antibodies act indirectly:
  + The constant part of the heavy chain, especially the Fc fragment, is recognized by complement components and phagocytes and mast cells
  + Antibodies are *adaptable molecules*, acting synergistically with complement pathway and phagocytes
+ *The main function of antibodies is to enhance the efficiency of innate immune defenses by conferring specificity*
  + *Opsonization* : Facilitate phagocytosis; phagocytes have Fc receptors for IgG;
  + IgM and IgG can also activate complement pathway, leading to opsonization
**** Functions of different immunoglobulin classes
+ *IgG*
  + Predominant in fully developed immune response
  + Most abundant, found mainly in blood, protect against bacteria and viruses
  + /The only immunoglobulin that crosses placenta to protect the fetus/
+ *IgA*
  + Found in saliva, mucous and breast milk, protect against ingested and inhaled pathogens
  + IgA binds to the surface of microorganisms  and prevents their adherence to mucosal epithelial cells
+ *IgM*
  + /Best activator of the classical complement pathway/
  + Predominant immunoglobulin class in *early immune response*
  + Confined to the bloodstream; Crucial against bacteria and viruses
+ *IgE*
  + Found in lungs and skin, cause must cells to release histamine, fight off alergic reactions
+ *IgD*
  + Found in the surface of B cells, help B cells maturation and activation

* TODO 49. Molecules of cell-mediated immunity.
* TODO 50. Cytotoxic and helper T lymphocytes.
* TODO 51. Genetic basis of antibodies and T-cell receptors.
