public/Biology.html
<li><a id="org98adbd6"></a>Humoral defenses | Complement<br />
<div class="outline-text-5" id="text-org98adbd6">
<ul class="org-ul">
<li>Most important humoral defense is a set of plasma proteins called <b>complement system</b>,
<ul class="org-ul">
<li>Most important complement protein is C3
<ul class="org-ul">
<li>C3 is cleaved into C3a(smaller) and C3b(larger) by <b>C3 convertase</b></li>
<li>C3b is stabilized by binding to microbial cell wall, facilitating phagocytosis via <b>opsonization</b>
<ul class="org-ul">
<li>Phagocytes have receptors for C3b</li>
</ul></li>
</ul></li>
<li><b>Classical Pathway</b>
<ul class="org-ul">
<li>activated by antigen/antibody complexes.</li>
<li>Proteases C1r and C1s cleave C4 and C2 to generate the Classical pathway C3 convertase C4b2a.</li>
</ul></li>
<li><b>Alternative Complement Pathway</b>
<ul class="org-ul">
<li>Trigerred by polysaccharides in bacterial and fungal cells</li>
<li>an amplification loop, is triggered when the C3b protein directly binds a microbe, foreign material, or damaged tissue.</li>
<li>C3b also binds factor B (fB) to form C3bB. FB is cleaved by factor D (fD) to form Alternative pathway C3-convertase, C3bBb.</li>
</ul></li>
<li><b>Lectin pathway</b>
<ul class="org-ul">
<li>triggered by binding of mannose-binding lectin (MBL) to carbohydrates on the target membrane.</li>
<li>The MBL-associated serine proteases (MASPs) then cleave C4 and C2 generating the C3-convertase C4b2a.</li>
</ul></li>
<li>C3b opsonize targets for phagocytosis and B-Cell activation</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orge8d69cc"></a><span class="todo TODO">TODO</span> Inflammation<br />
<div class="outline-text-5" id="text-orge8d69cc">
<ul class="org-ul">
<li>Inflammation is activation of local innate immunity, both cellular and humoral, usually due to injury
<ul class="org-ul">
<li><i>Signs of inflammation : pain, heat, redness and swelling</i></li>
</ul></li>
<li>Mast cells and basophils are responsible for inflammatory reactions
<ul class="org-ul">
<li>both contain granules full of histamine</li>
</ul></li>
<li></li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4a9bc89" class="outline-2">
<h2 id="org4a9bc89">47. Structure of antibodies.</h2>
<div class="outline-text-2" id="text-org4a9bc89">
<ul class="org-ul">
<li>Antibodies/immunoglobulins are protective proteins produced by the immune system in response to the presence of a foreign substance, <i>called an antigen</i></li>
</ul>
</div>
<div id="outline-container-org19648de" class="outline-4">
<h4 id="org19648de">Antibodies | Structure</h4>
<div class="outline-text-4" id="text-org19648de">
<ul class="org-ul">
<li>Antibodies are divided into five classes based on their structure and immune function
<ul class="org-ul">
<li>IgM, IgG, IgA, IgD and IgE</li>
</ul></li>
<li>Each antibody consists of <b>two heavey chains and two light chains</b> (4 polypeptides), joined to form a "Y" shaped molecule</li>
<li>The amino acid sequence in the tips of "Y" varies greatly among different antibodies
<ul class="org-ul">
<li>This variable region, composed of 110-130 amino acids, give the antibody its <b>specificity for binding antigen</b></li>
<li>The variable region includes the <b>ends of the light and heavy chains</b>
<ul class="org-ul">
<li><i>Treating the antibody with a protease can cleave this region, producing a fragment that includes the variable ends of an antibody</i></li>
<li><i>This fragment is commonly used for research studies</i></li>
</ul></li>
</ul></li>
<li>Immunoglobin chains are composed of <b>domains</b>
<ul class="org-ul">
<li>Light chain has 2 domains; 1 variable and 1 constant , found in the N-terminal position</li>
<li>Heavy chain has 4-5 domains; 1 variable, the rest are constant</li>
<li>Depending on the constant part, there are different isotypes
<ul class="org-ul">
<li>The lighht chain has 2 isotypes: <b>kappa and lambda</b>, similar and perform same functions</li>
<li>Heavy chain has 5 isotypes: γ,α,μ,δ and ε.
<ul class="org-ul">
<li>IgG -&gt; γ -&gt; Most abudant, found mainly in blood, protect against bacteria and viruses</li>
<li>IgA -&gt; α -&gt; Found in saliva, mucous and breast milk, protect against ingested and inhaled pathogens</li>
<li>IgM -&gt; μ -&gt; Found in blood and lymph system, First line of defence against infections</li>
<li>IgE -&gt; ε -&gt; Found in lungs and skin, cause must cells to release histamine, fight off alergic reactions</li>
<li>IgD -&gt; δ -&gt; Found in the surface of B cells, help B cells maturation and activation</li>
</ul></li>
<li>IgM and IgE have 5 domain heavy chain, the rest have 4</li>
</ul></li>
</ul></li>
<li>The 3D immunoglobulin structure is based on <b>beta sheets</b></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7da9a28" class="outline-2">
<h2 id="org7da9a28">48. Functions of antibodies.</h2>
<div class="outline-text-2" id="text-org7da9a28">
<ul class="org-ul">
<li>Antibodies/immunoglobulins are protective proteins produced by the immune system in response to the presence of a foreign substance, <i>called an antigen</i></li>
</ul>
</div>
<div id="outline-container-org80cbde8" class="outline-4">
<h4 id="org80cbde8">How antibodies work</h4>
<div class="outline-text-4" id="text-org80cbde8">
<ul class="org-ul">
<li>Antibodies are produced by B lymphocytes(B cells)
<ul class="org-ul">
<li>When an alien substance enters the body, the immune system is able to recognize it as foreign because molecules on the surface of the antigen differ from those in the body</li>
</ul></li>
<li>When an antigen binds to the B-cell surface, it stimulates the B-cell to divide and mature into a group of identical cells</li>
<li>Mature B cells, called plasma cells, secrete millions of antibodies into the bloodstream and lymphatic system</li>
</ul>
</div>
</div>
<div id="outline-container-org9f28ba4" class="outline-4">
<h4 id="org9f28ba4">Functions and Usage</h4>
<div class="outline-text-4" id="text-org9f28ba4">
</div>
<ul class="org-ul">
<li><a id="org4c591e0"></a>Neutralization of toxins<br />
<div class="outline-text-5" id="text-org4c591e0">
<ul class="org-ul">
<li>Antibodies against toxins are called <b>antitoxins</b>
<ul class="org-ul">
<li>They bind their targets and prevent their toxic action by distorting their active sites</li>
</ul></li>
<li>To obtain an animal antitoxin, an animal is immunized with toxoid; Toxin inactivated by formalin or heat, but still immunogenic</li>
<li>We use animal's serum to relieve patients suffering from toxin - <b>Passive immunization</b></li>
<li>We use toxoid injections in certain vaccines(e.g Diphtheria, tetanus), as well as for anti-venom snake vaccines</li>
</ul>
</div>
</li>
<li><a id="org85d186d"></a>Consequences of antigen binding<br />
<div class="outline-text-5" id="text-org85d186d">
<ul class="org-ul">
<li><b>antibodies have no toxic activity</b>
<ul class="org-ul">
<li>Antibodies can bind toxins/antigens but cannot destroy them because they are not enzymes</li>
</ul></li>
<li>Antibodies act indirectly:
<ul class="org-ul">
<li>The constant part of the heavy chain, especially the Fc fragment, is recognized by complement components and phagocytes and mast cells</li>
<li>Antibodies are <b>adaptable molecules</b>, acting synergistically with complement pathway and phagocytes</li>
</ul></li>
<li><b>The main function of antibodies is to enhance the efficiency of innate immune defenses by conferring specificity</b>
<ul class="org-ul">
<li><b>Opsonization</b> : Facilitate phagocytosis; phagocytes have Fc receptors for IgG;</li>
<li>IgM and IgG can also activate complement pathway, leading to opsonization</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org54784fa"></a>Functions of different immunoglobulin classes<br />
<div class="outline-text-5" id="text-org54784fa">
<ul class="org-ul">
<li><b>IgG</b>
<ul class="org-ul">
<li>Predominant in fully developed immune response</li>
<li>Most abundant, found mainly in blood, protect against bacteria and viruses</li>
<li><i>The only immunoglobulin that crosses placenta to protect the fetus</i></li>
</ul></li>
<li><b>IgA</b>
<ul class="org-ul">
<li>Found in saliva, mucous and breast milk, protect against ingested and inhaled pathogens</li>
<li>IgA binds to the surface of microorganisms  and prevents their adherence to mucosal epithelial cells</li>
</ul></li>
<li><b>IgM</b>
<ul class="org-ul">
<li><i>Best activator of the classical complement pathway</i></li>
<li>Predominant immunoglobulin class in <b>early immune response</b></li>
<li>Confined to the bloodstream; Crucial against bacteria and viruses</li>
</ul></li>
<li><b>IgE</b>
<ul class="org-ul">
<li>Found in lungs and skin, cause must cells to release histamine, fight off alergic reactions</li>
</ul></li>
<li><b>IgD</b>
<ul class="org-ul">
<li>Found in the surface of B cells, help B cells maturation and activation</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb018f4b" class="outline-2">
<h2 id="orgb018f4b"><span class="todo TODO">TODO</span> 49. Molecules of cell-mediated immunity.</h2>
</div>
<div id="outline-container-orgfe46421" class="outline-2">
<h2 id="orgfe46421"><span class="todo TODO">TODO</span> 50. Cytotoxic and helper T lymphocytes.</h2>
</div>
<div id="outline-container-orgfdecb2b" class="outline-2">
<h2 id="orgfdecb2b"><span class="todo TODO">TODO</span> 51. Genetic basis of antibodies and T-cell receptors.</h2>
</div>
