content/Biology.org
* TODO 52. Lymphocyte differentiation in central lymphoid organs.
* TODO 53. Lymphocyte differentiation in peripheral lymphoid organs. Immune response
* TODO 54. Immune memory.
* TODO 55. Immune tolerance. Regulatory T lymphocytes.
* TODO 56. Transplantation immunity.
* TODO 57. Antitumor immunity. Evolution of immunity.
* TODO 58. Blood group alloantigens. ABO and H blood groups.
* TODO 59. Rhesus blood groups.
* TODO 60. Animal evolution before vertebrates.
* TODO 61. Sequence of evolutionary innovations in vertebrate classes
* 62. Phylogeny and development of the skull
*** TODO Composition
+ *Neurocranium*
  + Portion of the skull that protects the brain and major sense organs.
  + /If we think the skull as a rectangular box, the neurocranium presents at the bottom, back and sides/
  + Subdivided into 4 groups k
  + Initially developed as cartilages, produced by the neural crest and mesoderm mesenchyme
*** Phylogeny
+ The first big step; *Hardening of the feeding apparatus*, jaws were invented; massive and able to carry teeth
  + The development of jaws is based on various mechanisms of shaping cartilage
+ Species with an active feeding mode also underwent an extensive enlargement of the nervous tissue
+ *Brain case* was developed to protect the brain and sensory organs, which lead to increased complexity of chondrocranium
+ *To create cartilages for the skull, nature needs mesoderm and neural crest*
  + Neural crest cells induce formations of various elements of the cranial skeleton
  + Mesoderm contributes to the development of the chondrocranium
  + Neural crest cells also contribute to the anterior part of the neurocranium, and partly to the otic vesicles and jaw

* TODO 63. Phylogeny and development of the postcranial skeleton
* 64. Phylogeny and development of the skin
*** Skin
+ /The outer covering of the body in all vertebrates/
+ Provides protections
  + Mechanical against solar radiation and against pathogens
  + Prevents *dehydration*
+ Site of synthesis and accumulations of substances such as lipids and vitamin D
+ Contains nerve endings that react to touch and can also absorb and excrete substances
+ *Has two main layers*
  + *Epidermis*
    + Outermost covering of the body
    + *Ectodermal origin*
  + *Dermis*
    + Lies beneath the dermis
    + Composed mostly of fibrous connective tissue, also contains adipose cells, macrophages and pigment cells
*** Phylogeny of the skin
**** Evolutionary innovations in Fishes
+ Epidermis in fishes is made of *living cells* /with relatively low keratin content/, covering dermal scales
+ Within the epidermis, unicellular mucous glands reside, their secretions make fish slippery and difficult to catch
  + In some fish species, those glands are modified into venom glands
**** Evolutionary innovations in Amphibians
+ When vertebrates invaded land, the epidermis evolved a cornified layer(*stratun corneum*), found first in amphibians
  + Protects from dehydration
+ Presence of *multicellular* mucous glands
  + Ectodermal origin, but are located in the dermis
  + Release of secretions keep it moist so to *enable gas exchange through the skin*
**** Evolutionary innovations in Amniotes
+ Stratum corneum is best developed in reptiles, forming a dense waterproof covering of their body
+ Reptilian *epidermis* is dry, *almost devoid of skin glands*, except for scent glands around the mouth
+ Squamate reptiles(lizards and snakes) are *characterized by overlapping horny scales.
  + In *mammals*, the hairs are homologous to horny scales, providing heat insulation
**** Evolutionary innovations in mammals
+ *General*
  + Mammalian skin has *stratified epidermis*, composed mostly of keratinocyes, /containing some melanocytes and Langerhans cells(antigen-presenting)/
  + Characteristic *hair* that provides heat insulation and camouflage
+ *Dermis*
  + two layers, an outer papillary layer underlying the *basal layer* of the epidermis, and a *reticular layer* beneath it
  + The dermis houses sensory receptors, blood vessels, smooth muscle fibers, hair follicules and skin glands
+ *Glands*
  + mammals have two main types of skin glands, *sebaceous* and *sweat*
  + *Sweat* :
    + Coiled, tubular shape
    + Merocrine(release liquid secretion) or apocrine(release cytoplasmic fragments)
*** Skin development
+ Multi-step process consisting of
  + Epidermal specification
  + Epidermal Commitment
  + Stratification & Terminal differentiation
  + Growth of epidermal appendages
**** Epidermal specification
+ Embryonic skin development begins after gastrulation
  + Gastrulation occurs in the third week after fertilization
  + Formation of three germ layers; ectoderm, mesoderm and endoderm
  + Ectoderm gives gives rise to both the nervous system and skin epithelium
+ Neural and epidermal fates of ectodermal cells are based on the effects of *Wnt, fibroblast(FGF) and bone morphogenetic protein(BMP)* signalling following gastrulation
  + Wnt signalling restricts the ectodermic response to FGFs, /which are required for neural induction/
  + This lead to expresion of *BMP*, /which also inhibits neural fate and/ commits the cells to *differentiate into the epidermis*
  + resulting in a *single layer of multipotent epithelial cells*
**** Epidermal commitment
+ The single layer of multipotent epithelial cells /initially/ express keratins K8/K18
+ This is *replaced by K5/K14 expression* prior to stratification, /marking the beginning of epidermal commitment/
