public/Biology.html
<div id="outline-container-orgfbabce3" class="outline-2">
<h2 id="orgfbabce3"><span class="todo TODO">TODO</span> 52. Lymphocyte differentiation in central lymphoid organs.</h2>
</div>
<div id="outline-container-orgb9b9b2b" class="outline-2">
<h2 id="orgb9b9b2b"><span class="todo TODO">TODO</span> 53. Lymphocyte differentiation in peripheral lymphoid organs. Immune response</h2>
</div>
<div id="outline-container-org4a1a313" class="outline-2">
<h2 id="org4a1a313"><span class="todo TODO">TODO</span> 54. Immune memory.</h2>
</div>
<div id="outline-container-org201b614" class="outline-2">
<h2 id="org201b614"><span class="todo TODO">TODO</span> 55. Immune tolerance. Regulatory T lymphocytes.</h2>
</div>
<div id="outline-container-org036d7f6" class="outline-2">
<h2 id="org036d7f6"><span class="todo TODO">TODO</span> 56. Transplantation immunity.</h2>
</div>
<div id="outline-container-org9eeff72" class="outline-2">
<h2 id="org9eeff72"><span class="todo TODO">TODO</span> 57. Antitumor immunity. Evolution of immunity.</h2>
</div>
<div id="outline-container-org905175e" class="outline-2">
<h2 id="org905175e"><span class="todo TODO">TODO</span> 58. Blood group alloantigens. ABO and H blood groups.</h2>
</div>
<div id="outline-container-org20bf4e6" class="outline-2">
<h2 id="org20bf4e6"><span class="todo TODO">TODO</span> 59. Rhesus blood groups.</h2>
</div>
<div id="outline-container-orgef9273f" class="outline-2">
<h2 id="orgef9273f"><span class="todo TODO">TODO</span> 60. Animal evolution before vertebrates.</h2>
</div>
<div id="outline-container-org3c7d2ec" class="outline-2">
<h2 id="org3c7d2ec"><span class="todo TODO">TODO</span> 61. Sequence of evolutionary innovations in vertebrate classes</h2>
</div>
<div id="outline-container-org2d25af8" class="outline-2">
<h2 id="org2d25af8">62. Phylogeny and development of the skull</h2>
<div class="outline-text-2" id="text-org2d25af8">
</div>
<div id="outline-container-orgd25265c" class="outline-4">
<h4 id="orgd25265c"><span class="todo TODO">TODO</span> Composition</h4>
<div class="outline-text-4" id="text-orgd25265c">
<ul class="org-ul">
<li><b>Neurocranium</b>
<ul class="org-ul">
<li>Portion of the skull that protects the brain and major sense organs.</li>
<li><i>If we think the skull as a rectangular box, the neurocranium presents at the bottom, back and sides</i></li>
<li>Subdivided into 4 groups k</li>
<li>Initially developed as cartilages, produced by the neural crest and mesoderm mesenchyme</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb563d76" class="outline-4">
<h4 id="orgb563d76">Phylogeny</h4>
<div class="outline-text-4" id="text-orgb563d76">
<ul class="org-ul">
<li>The first big step; <b>Hardening of the feeding apparatus</b>, jaws were invented; massive and able to carry teeth
<ul class="org-ul">
<li>The development of jaws is based on various mechanisms of shaping cartilage</li>
</ul></li>
<li>Species with an active feeding mode also underwent an extensive enlargement of the nervous tissue</li>
<li><b>Brain case</b> was developed to protect the brain and sensory organs, which lead to increased complexity of chondrocranium</li>
<li><b>To create cartilages for the skull, nature needs mesoderm and neural crest</b>
<ul class="org-ul">
<li>Neural crest cells induce formations of various elements of the cranial skeleton</li>
<li>Mesoderm contributes to the development of the chondrocranium</li>
<li>Neural crest cells also contribute to the anterior part of the neurocranium, and partly to the otic vesicles and jaw</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5d64a62" class="outline-2">
<h2 id="org5d64a62"><span class="todo TODO">TODO</span> 63. Phylogeny and development of the postcranial skeleton</h2>
</div>
<div id="outline-container-org7b38720" class="outline-2">
<h2 id="org7b38720">64. Phylogeny and development of the skin</h2>
<div class="outline-text-2" id="text-org7b38720">
</div>
<div id="outline-container-orgba8fa75" class="outline-4">
<h4 id="orgba8fa75">Skin</h4>
<div class="outline-text-4" id="text-orgba8fa75">
<ul class="org-ul">
<li><i>The outer covering of the body in all vertebrates</i></li>
<li>Provides protections
<ul class="org-ul">
<li>Mechanical against solar radiation and against pathogens</li>
<li>Prevents <b>dehydration</b></li>
</ul></li>
<li>Site of synthesis and accumulations of substances such as lipids and vitamin D</li>
<li>Contains nerve endings that react to touch and can also absorb and excrete substances</li>
<li><b>Has two main layers</b>
<ul class="org-ul">
<li><b>Epidermis</b>
<ul class="org-ul">
<li>Outermost covering of the body</li>
<li><b>Ectodermal origin</b></li>
</ul></li>
<li><b>Dermis</b>
<ul class="org-ul">
<li>Lies beneath the dermis</li>
<li>Composed mostly of fibrous connective tissue, also contains adipose cells, macrophages and pigment cells</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9162f9d" class="outline-4">
<h4 id="org9162f9d">Phylogeny of the skin</h4>
<div class="outline-text-4" id="text-org9162f9d">
</div>
<ul class="org-ul">
<li><a id="org3d647e9"></a>Evolutionary innovations in Fishes<br />
<div class="outline-text-5" id="text-org3d647e9">
<ul class="org-ul">
<li>Epidermis in fishes is made of <b>living cells</b> <i>with relatively low keratin content</i>, covering dermal scales</li>
<li>Within the epidermis, unicellular mucous glands reside, their secretions make fish slippery and difficult to catch
<ul class="org-ul">
<li>In some fish species, those glands are modified into venom glands</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orged2890d"></a>Evolutionary innovations in Amphibians<br />
<div class="outline-text-5" id="text-orged2890d">
<ul class="org-ul">
<li>When vertebrates invaded land, the epidermis evolved a cornified layer(<b>stratun corneum</b>), found first in amphibians
<ul class="org-ul">
<li>Protects from dehydration</li>
</ul></li>
<li>Presence of <b>multicellular</b> mucous glands
<ul class="org-ul">
<li>Ectodermal origin, but are located in the dermis</li>
<li>Release of secretions keep it moist so to <b>enable gas exchange through the skin</b></li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org6ea7a54"></a>Evolutionary innovations in Amniotes<br />
<div class="outline-text-5" id="text-org6ea7a54">
<ul class="org-ul">
<li>Stratum corneum is best developed in reptiles, forming a dense waterproof covering of their body</li>
<li>Reptilian <b>epidermis</b> is dry, <b>almost devoid of skin glands</b>, except for scent glands around the mouth</li>
<li>Squamate reptiles(lizards and snakes) are *characterized by overlapping horny scales.
<ul class="org-ul">
<li>In <b>mammals</b>, the hairs are homologous to horny scales, providing heat insulation</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org5136369"></a>Evolutionary innovations in mammals<br />
<div class="outline-text-5" id="text-org5136369">
<ul class="org-ul">
<li><b>General</b>
<ul class="org-ul">
<li>Mammalian skin has <b>stratified epidermis</b>, composed mostly of keratinocyes, <i>containing some melanocytes and Langerhans cells(antigen-presenting)</i></li>
<li>Characteristic <b>hair</b> that provides heat insulation and camouflage</li>
</ul></li>
<li><b>Dermis</b>
<ul class="org-ul">
<li>two layers, an outer papillary layer underlying the <b>basal layer</b> of the epidermis, and a <b>reticular layer</b> beneath it</li>
<li>The dermis houses sensory receptors, blood vessels, smooth muscle fibers, hair follicules and skin glands</li>
</ul></li>
<li><b>Glands</b>
<ul class="org-ul">
<li>mammals have two main types of skin glands, <b>sebaceous</b> and <b>sweat</b></li>
<li><b>Sweat</b> :
<ul class="org-ul">
<li>Coiled, tubular shape</li>
<li>Merocrine(release liquid secretion) or apocrine(release cytoplasmic fragments)</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org3c23346" class="outline-4">
<h4 id="org3c23346">Skin development</h4>
<div class="outline-text-4" id="text-org3c23346">
<ul class="org-ul">
<li>Multi-step process consisting of
<ul class="org-ul">
<li>Epidermal specification</li>
<li>Epidermal Commitment</li>
<li>Stratification &amp; Terminal differentiation</li>
<li>Growth of epidermal appendages</li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org3c3c180"></a>Epidermal specification<br />
<div class="outline-text-5" id="text-org3c3c180">
<ul class="org-ul">
<li>Embryonic skin development begins after gastrulation
<ul class="org-ul">
<li>Gastrulation occurs in the third week after fertilization</li>
<li>Formation of three germ layers; ectoderm, mesoderm and endoderm</li>
<li>Ectoderm gives gives rise to both the nervous system and skin epithelium</li>
</ul></li>
<li>Neural and epidermal fates of ectodermal cells are based on the effects of <b>Wnt, fibroblast(FGF) and bone morphogenetic protein(BMP)</b> signalling following gastrulation
<ul class="org-ul">
<li>Wnt signalling restricts the ectodermic response to FGFs, <i>which are required for neural induction</i></li>
<li>This lead to expresion of <b>BMP</b>, <i>which also inhibits neural fate and</i> commits the cells to <b>differentiate into the epidermis</b></li>
<li>resulting in a <b>single layer of multipotent epithelial cells</b></li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org2a946cf"></a>Epidermal commitment<br />
<div class="outline-text-5" id="text-org2a946cf">
<ul class="org-ul">
<li>The single layer of multipotent epithelial cells <i>initially</i> express keratins K8/K18</li>
<li>This is <b>replaced by K5/K14 expression</b> prior to stratification, <i>marking the beginning of epidermal commitment</i></li>
</ul>
</div>
</li>
