content/Biology.org
**** Stratification & Terminal differentiation
+ Multipotent epithelial cells in the surface of the ectoderm *become the embryonic epidermal basal layer of the stratifying epidermis*
  + which gives rise to all structures of the future epidermis
  + The formation of the embryonic basal layer is accompanied by the development of the basement membrane, produced by the basal layer cells
+ Basement membrane separates the epidermis from the dermis and provides epidermal basal cells with growth factors
+ A layer of tightly adhered cells called *periderm* transiently overlays the ectoderm during embryonic development
  + /The periderm protect the developing epidermis from amniotic fluid, and is shed once the epidermis has stratified/
+ As cells in the basal layer proliferate, they form an /intermediate layer/ of cells under the periderm, which mature into *spinous cells*
+ Both intermediate layer and spinous cells express K1, whose expression is induced by Notch signalling
+ *Notch signaling* directs spinous cells to continue to differentiate, and migrate towards the surface to form *granular layer* and *cornified layer*
**** Growth of epidermal appendages
+ Development of the epidermis includes the formation of the epidermal appendages such as hair follicles and sweat glands.
+ During development, cells of the basal epidermal layer form buds, which are primitive cells of organ development
+ naginate into the dermis ultimately forming the hair follicle appendages, apocrine, and eccrine glands.

* TODO 65. Phylogeny and development of the nervous system (brain and spinal cord)
*** Phylogeny of nervous system

*** Development of brain and spinal cord
**** Neural tube
+ Neuroectodermal tissues differentiate and thicken into *neural plate*
+ Neural plate *bends dorsally* /with the two ends joining at the neural plate boarders/, developing into *neural crest*
+ The closure of the neural tube disconnects the neural crest from the epidermis. Neural crest cells differentiate to form most of the peripheral nervous system.
+ Neural tube forms beneath the dorsal surface ectoderm(future epidermis)
+ Anterior end will develop into the brain, rest will develop into the spinal cord
**** Gray & White matter
+ /Gray matter consists primarily of neuronal cell bodies that contain nuclei, white matter mainly of myelinated axons/
+ Differentiation of grey and white matter goes together with neuronal maturation, /the axons emerging from the neuroblasts form layers of white matter/
+ *Spinal cord:*
  + An inner layer of ependymal cells surrounds the central spinal canal. They produce cerebrospinal liquid
  + Neuroblasts in the *mantle layer* will become the grey matter of the spinal cord
    + *Mantle zone* differentiates into *alar plate*, which consists of sensory neurons and *basal plat* which consists of motor neurons
+ *Spinal nerves:*
  + The two afferent columns of alar zone receive axons from dorsal root ganglia:
    + somatic afferent column: receives impulses from skin and deep receptors
* TODO 66. Phylogeny and development of the skin sense organs, taste, and olfactory organs.
* TODO 67. Phylogeny and development of the organ of balance and hearing.
* TODO 68. Phylogeny and development of organ of vision.
* TODO 69. Phylogeny and development of digestive system.
* TODO 70. Phylogeny and development of circulatory system.
* TODO 71. Phylogeny and development of respiratory system.
* TODO 72. Phylogeny and development of excretory system.
* TODO 73. Phylogeny and development of reproductive system.
* TODO 74. Mechanisms of evolution. Anagenesis.
* TODO 75. Speciation (cladogenesis). Macroevolution.
* TODO 76. Human evolution.
* TODO 77. Molecular evolution.
* 78. Protozoa. Phylum Sarcomastigophora. Subphylum Mastigophora (Flagellata). Trypanosoma brucei gambiense, Trypanosoma brucei rhodesiense. Trypanosoma cruzi.
*** Trypanosoma brucei
+ Causes African trypanosomiasis(Sleeping sickness)
+ Trypanosoma brucei is a hemoflagellate protozoan(flagellated/trypomastigote in the blood, amastigote in tissue)
+ Vector transmission by bite of *tsetse fly*
+ Gambiense subtype is endemic to Central and West Africa, causes chronic trypanosomiasis, progresses slowly
+ Rhodesiense subtype is endemic to East Aftica, causes acute trypanosomiasis, more common in cattle than humans(humans are secondary host)
+ Stages of disease:
  + Stage I :
    + *Intermittent fever* : caused by antigenic variation
    + Painless lymph node enlargement
    + *Winterbottom* sign : painles cervical lymphadenopathy in the posterior triangle of the neck
  + Stage II :
    + Headache
    + Insomnia
    + *Coma*
    + Death
  + Diagnostics :
    + Direct visualization of trypomastigotes in blood smear using Giemsa stain
    + for Stage II diagnostics, lumbar puncture and CSF examination is used
  + Treatment :
    + Stage I  -> Suramin
    + Stage II -> Melarsoprol
*** Trypanosoma cruzi
+ Causes Chagas Disease
  + /Disease first desrcibed by Carlos Chagas in 1909, now it is known as Chagas Disease/
+ Trypomastigote form in blood, amastigote in tissues
+ Vector transmission by **reduviid** bug(kissing bug, bites around the mouth or eyes usually)
  + T.cruzi is shed in the feces of the reduviid bug; feces is then rubbed into the bite site while scratching
+ *Endemic to Central and South America*
+ Clinical features :
  + Incubation period 1-2 weeks
  + Actue phase
    + Cutaneous manifestations :
      + Chagoma: infammatory edema at the bite site(usually face)
      + Romana sign : unilateral painless edema of the eyelids
  + Indeterminate phase
    + Patient enters asymptomatic latent phase
    + Serologically positive, do not develop signs or symptoms associated with chronic phase
  + Chronic phase
    + *Chagas cardiomyopathy*
      + dilative cardiomyopathy
    + Megaesophagus and achalasia
    + Megacolon
+ Diagnostics :
  + Trypomastigotes in blood smear using Giemsa stain
  + PCR
+ Treatment :
  + Benzimidazole(first line)
  + Nifurtimox(second line)

