public/Biology.html
<li><a id="orgcf0d01f"></a>Stratification &amp; Terminal differentiation<br />
<div class="outline-text-5" id="text-orgcf0d01f">
<ul class="org-ul">
<li>Multipotent epithelial cells in the surface of the ectoderm <b>become the embryonic epidermal basal layer of the stratifying epidermis</b>
<ul class="org-ul">
<li>which gives rise to all structures of the future epidermis</li>
<li>The formation of the embryonic basal layer is accompanied by the development of the basement membrane, produced by the basal layer cells</li>
</ul></li>
<li>Basement membrane separates the epidermis from the dermis and provides epidermal basal cells with growth factors</li>
<li>A layer of tightly adhered cells called <b>periderm</b> transiently overlays the ectoderm during embryonic development
<ul class="org-ul">
<li><i>The periderm protect the developing epidermis from amniotic fluid, and is shed once the epidermis has stratified</i></li>
</ul></li>
<li>As cells in the basal layer proliferate, they form an <i>intermediate layer</i> of cells under the periderm, which mature into <b>spinous cells</b></li>
<li>Both intermediate layer and spinous cells express K1, whose expression is induced by Notch signalling</li>
<li><b>Notch signaling</b> directs spinous cells to continue to differentiate, and migrate towards the surface to form <b>granular layer</b> and <b>cornified layer</b></li>
</ul>
</div>
</li>
<li><a id="orge320d7d"></a>Growth of epidermal appendages<br />
<div class="outline-text-5" id="text-orge320d7d">
<ul class="org-ul">
<li>Development of the epidermis includes the formation of the epidermal appendages such as hair follicles and sweat glands.</li>
<li>During development, cells of the basal epidermal layer form buds, which are primitive cells of organ development</li>
<li>naginate into the dermis ultimately forming the hair follicle appendages, apocrine, and eccrine glands.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2959bbe" class="outline-2">
<h2 id="org2959bbe"><span class="todo TODO">TODO</span> 65. Phylogeny and development of the nervous system (brain and spinal cord)</h2>
<div class="outline-text-2" id="text-org2959bbe">
</div>
<div id="outline-container-orge13e902" class="outline-4">
<h4 id="orge13e902">Phylogeny of nervous system</h4>
</div>

<div id="outline-container-orgb1a601c" class="outline-4">
<h4 id="orgb1a601c">Development of brain and spinal cord</h4>
<div class="outline-text-4" id="text-orgb1a601c">
</div>
<ul class="org-ul">
<li><a id="org943d148"></a>Neural tube<br />
<div class="outline-text-5" id="text-org943d148">
<ul class="org-ul">
<li>Neuroectodermal tissues differentiate and thicken into <b>neural plate</b></li>
<li>Neural plate <b>bends dorsally</b> <i>with the two ends joining at the neural plate boarders</i>, developing into <b>neural crest</b></li>
<li>The closure of the neural tube disconnects the neural crest from the epidermis. Neural crest cells differentiate to form most of the peripheral nervous system.</li>
<li>Neural tube forms beneath the dorsal surface ectoderm(future epidermis)</li>
<li>Anterior end will develop into the brain, rest will develop into the spinal cord</li>
</ul>
</div>
</li>
<li><a id="org40a4bb0"></a>Gray &amp; White matter<br />
<div class="outline-text-5" id="text-org40a4bb0">
<ul class="org-ul">
<li><i>Gray matter consists primarily of neuronal cell bodies that contain nuclei, white matter mainly of myelinated axons</i></li>
<li>Differentiation of grey and white matter goes together with neuronal maturation, <i>the axons emerging from the neuroblasts form layers of white matter</i></li>
<li><b>Spinal cord:</b>
<ul class="org-ul">
<li>An inner layer of ependymal cells surrounds the central spinal canal. They produce cerebrospinal liquid</li>
<li>Neuroblasts in the <b>mantle layer</b> will become the grey matter of the spinal cord
<ul class="org-ul">
<li><b>Mantle zone</b> differentiates into <b>alar plate</b>, which consists of sensory neurons and <b>basal plat</b> which consists of motor neurons</li>
</ul></li>
</ul></li>
<li><b>Spinal nerves:</b>
<ul class="org-ul">
<li>The two afferent columns of alar zone receive axons from dorsal root ganglia:
<ul class="org-ul">
<li>somatic afferent column: receives impulses from skin and deep receptors</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3962614" class="outline-2">
<h2 id="org3962614"><span class="todo TODO">TODO</span> 66. Phylogeny and development of the skin sense organs, taste, and olfactory organs.</h2>
</div>
<div id="outline-container-org4e9e3e7" class="outline-2">
<h2 id="org4e9e3e7"><span class="todo TODO">TODO</span> 67. Phylogeny and development of the organ of balance and hearing.</h2>
</div>
<div id="outline-container-orgff23c4e" class="outline-2">
<h2 id="orgff23c4e"><span class="todo TODO">TODO</span> 68. Phylogeny and development of organ of vision.</h2>
</div>
<div id="outline-container-org343c4a9" class="outline-2">
<h2 id="org343c4a9"><span class="todo TODO">TODO</span> 69. Phylogeny and development of digestive system.</h2>
</div>
<div id="outline-container-org259da3d" class="outline-2">
<h2 id="org259da3d"><span class="todo TODO">TODO</span> 70. Phylogeny and development of circulatory system.</h2>
</div>
<div id="outline-container-orge9d1aca" class="outline-2">
<h2 id="orge9d1aca"><span class="todo TODO">TODO</span> 71. Phylogeny and development of respiratory system.</h2>
</div>
<div id="outline-container-org1c02d59" class="outline-2">
<h2 id="org1c02d59"><span class="todo TODO">TODO</span> 72. Phylogeny and development of excretory system.</h2>
</div>
<div id="outline-container-org4b56ab6" class="outline-2">
<h2 id="org4b56ab6"><span class="todo TODO">TODO</span> 73. Phylogeny and development of reproductive system.</h2>
</div>
<div id="outline-container-org8d0e06d" class="outline-2">
<h2 id="org8d0e06d"><span class="todo TODO">TODO</span> 74. Mechanisms of evolution. Anagenesis.</h2>
</div>
<div id="outline-container-org82eafce" class="outline-2">
<h2 id="org82eafce"><span class="todo TODO">TODO</span> 75. Speciation (cladogenesis). Macroevolution.</h2>
</div>
<div id="outline-container-org5f3db95" class="outline-2">
<h2 id="org5f3db95"><span class="todo TODO">TODO</span> 76. Human evolution.</h2>
</div>
<div id="outline-container-org6ec5789" class="outline-2">
<h2 id="org6ec5789"><span class="todo TODO">TODO</span> 77. Molecular evolution.</h2>
</div>
<div id="outline-container-orga0331c6" class="outline-2">
<h2 id="orga0331c6">78. Protozoa. Phylum Sarcomastigophora. Subphylum Mastigophora (Flagellata). Trypanosoma brucei gambiense, Trypanosoma brucei rhodesiense. Trypanosoma cruzi.</h2>
<div class="outline-text-2" id="text-orga0331c6">
</div>
<div id="outline-container-org7738b29" class="outline-4">
<h4 id="org7738b29">Trypanosoma brucei</h4>
<div class="outline-text-4" id="text-org7738b29">
<ul class="org-ul">
<li>Causes African trypanosomiasis(Sleeping sickness)</li>
<li>Trypanosoma brucei is a hemoflagellate protozoan(flagellated/trypomastigote in the blood, amastigote in tissue)</li>
<li>Vector transmission by bite of <b>tsetse fly</b></li>
<li>Gambiense subtype is endemic to Central and West Africa, causes chronic trypanosomiasis, progresses slowly</li>
<li>Rhodesiense subtype is endemic to East Aftica, causes acute trypanosomiasis, more common in cattle than humans(humans are secondary host)</li>
<li>Stages of disease:
<ul class="org-ul">
<li>Stage I :
<ul class="org-ul">
<li><b>Intermittent fever</b> : caused by antigenic variation</li>
<li>Painless lymph node enlargement</li>
<li><b>Winterbottom</b> sign : painles cervical lymphadenopathy in the posterior triangle of the neck</li>
</ul></li>
<li>Stage II :
<ul class="org-ul">
<li>Headache</li>
<li>Insomnia</li>
<li><b>Coma</b></li>
<li>Death</li>
</ul></li>
<li>Diagnostics :
<ul class="org-ul">
<li>Direct visualization of trypomastigotes in blood smear using Giemsa stain</li>
<li>for Stage II diagnostics, lumbar puncture and CSF examination is used</li>
</ul></li>
<li>Treatment :
<ul class="org-ul">
<li>Stage I  -&gt; Suramin</li>
<li>Stage II -&gt; Melarsoprol</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org854d246" class="outline-4">
<h4 id="org854d246">Trypanosoma cruzi</h4>
<div class="outline-text-4" id="text-org854d246">
<ul class="org-ul">
<li>Causes Chagas Disease
<ul class="org-ul">
<li><i>Disease first desrcibed by Carlos Chagas in 1909, now it is known as Chagas Disease</i></li>
</ul></li>
<li>Trypomastigote form in blood, amastigote in tissues</li>
<li>Vector transmission by <b><b>reduviid</b></b> bug(kissing bug, bites around the mouth or eyes usually)
<ul class="org-ul">
<li>T.cruzi is shed in the feces of the reduviid bug; feces is then rubbed into the bite site while scratching</li>
</ul></li>
<li><b>Endemic to Central and South America</b></li>
<li>Clinical features :
<ul class="org-ul">
<li>Incubation period 1-2 weeks</li>
<li>Actue phase
<ul class="org-ul">
<li>Cutaneous manifestations :
<ul class="org-ul">
<li>Chagoma: infammatory edema at the bite site(usually face)</li>
<li>Romana sign : unilateral painless edema of the eyelids</li>
</ul></li>
</ul></li>
<li>Indeterminate phase
<ul class="org-ul">
<li>Patient enters asymptomatic latent phase</li>
<li>Serologically positive, do not develop signs or symptoms associated with chronic phase</li>
</ul></li>
<li>Chronic phase
<ul class="org-ul">
<li><b>Chagas cardiomyopathy</b>
<ul class="org-ul">
<li>dilative cardiomyopathy</li>
</ul></li>
<li>Megaesophagus and achalasia</li>
<li>Megacolon</li>
</ul></li>
</ul></li>
<li>Diagnostics :
<ul class="org-ul">
<li>Trypomastigotes in blood smear using Giemsa stain</li>
<li>PCR</li>
</ul></li>
<li>Treatment :
<ul class="org-ul">
<li>Benzimidazole(first line)</li>
<li>Nifurtimox(second line)</li>
</ul></li>
</ul>
</div>
</div>
</div>
