public/Biology.html

<div id="outline-container-orgb7e802a" class="outline-2">
<h2 id="orgb7e802a">79. Leishmania donovani. Leishmania tropica. Leishmania braziliensis.</h2>
<div class="outline-text-2" id="text-orgb7e802a">
<ul class="org-ul">
<li>Blood protozoan</li>
<li>Vector <b><b>transmission by sandfly</b></b></li>
<li>Promastigote(flagellated) form in vector(sandly)|Amastigote(non-flagellated) form inside host macrophages
<ul class="org-ul">
<li>Numerous amastigote nuclei can be seen in the cytoplasm of macrophages on microscopy</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org3a24b91" class="outline-4">
<h4 id="org3a24b91">Leishmania braziliensis &amp; Leishmania Tropica</h4>
<div class="outline-text-4" id="text-org3a24b91">
<ul class="org-ul">
<li>Leishmania braziliensis : Found in south America(Brazil)</li>
<li>Leishmania tropica: Europe, Africa</li>
<li>Both cause cutaneous leishmaniasis :
<ul class="org-ul">
<li>Presents with papules and plaques that progress to ulcerative lesions</li>
</ul></li>
<li>Local treatment with cryotherapy OR paromomycin</li>
</ul>
</div>
</div>
<div id="outline-container-org4b9f659" class="outline-4">
<h4 id="org4b9f659">Leishmania donovani</h4>
<div class="outline-text-4" id="text-org4b9f659">
<ul class="org-ul">
<li>Causes Visceral leishmaniasis(kalazar, black fever)</li>
<li>Spiking fever</li>
<li>Affects the bone marrow, leading to pancytopenia</li>
<li>hepatosplenomegaly</li>
<li>Treatment :
<ul class="org-ul">
<li>Amphotericin B</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7c17de2" class="outline-2">
<h2 id="org7c17de2">80. Trichomonas vaginalis. Trichomonas tenax. Giardia lamblia (Lamblia intestinalis).</h2>
<div class="outline-text-2" id="text-org7c17de2">
</div>
<div id="outline-container-org6f1670c" class="outline-4">
<h4 id="org6f1670c">Trcihonomas vaginalis</h4>
<div class="outline-text-4" id="text-org6f1670c">
<ul class="org-ul">
<li>Anaerobic, motile protozoan with flagella</li>
<li>Does not encyst and does not survive outside of the body</li>
<li>Sexual transmission</li>
<li>Clinical features :
<ul class="org-ul">
<li>Foul-smelling, yellow-green purulent discharge</li>
<li>Vulvovaginal pruritus, burning sensation, stawberry cervix</li>
<li>Usually asymptomatic in men</li>
</ul></li>
<li>Diagnostics :
<ul class="org-ul">
<li>Saline wet mount of vaginal smear : motile trophozoites with multiple flagella</li>
<li>pH of vaginal discharge &lt; 4.5</li>
</ul></li>
<li>Treatment :
<ul class="org-ul">
<li>Oral metronidazole</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4c4f49a" class="outline-4">
<h4 id="org4c4f49a">Trichonomonas tenax</h4>
<div class="outline-text-4" id="text-org4c4f49a">
<ul class="org-ul">
<li>Anaerobic, motile protozoan with flagella</li>
<li>Found in oral cavity, causes gingivostomatitis, but commony asymptomatic</li>
</ul>
</div>
</div>
<div id="outline-container-org7da6af2" class="outline-4">
<h4 id="org7da6af2">Giardia Lamblia</h4>
<div class="outline-text-4" id="text-org7da6af2">
<ul class="org-ul">
<li>Anaerobic flagellated protozoan in the small intestine</li>
<li>Fecal-oral transmission
<ul class="org-ul">
<li>Infectious cysts that are passed through stool</li>
</ul></li>
<li>Causes <b>Giardiasis</b></li>
<li><i>Giardiasis is associated commonly with campers</i></li>
<li>Giardia is transmitted through poorly purified water</li>
<li>Giardiasis presents with <b>watery diarrhea</b></li>
<li>Life cycle :
<ul class="org-ul">
<li>Trophozoite : active form of the pathogen that multiplies within host
<ul class="org-ul">
<li>Morphology : pear-shaped with 4 pairs of flagella and 2 nuclei</li>
</ul></li>
<li>Cyst : infectious form, able to survive in moist environments
<ul class="org-ul">
<li>Morphology : pear-shaped with 4 nuclei</li>
</ul></li>
</ul></li>
<li>Diagnostics :
<ul class="org-ul">
<li>Presence of Giardia Lamblia trophozoites in stool</li>
<li>Stool O&amp;P</li>
<li>ELISA</li>
</ul></li>
<li>Treatment :
<ul class="org-ul">
<li>Metronidazole</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org92d26d2" class="outline-2">
<h2 id="org92d26d2">81. Subphylum Sarcodina. Entamoeba histolytica. Entamoeba dispar. Entamoeba gingivalis.</h2>
<div class="outline-text-2" id="text-org92d26d2">
</div>
<div id="outline-container-orga2b63de" class="outline-4">
<h4 id="orga2b63de">Entamoeba Histolytica</h4>
<div class="outline-text-4" id="text-orga2b63de">
<ul class="org-ul">
<li>Intestinal protozoan
<ul class="org-ul">
<li>Primarly in the large intestine and colon</li>
</ul></li>
<li>Causes amebiasis</li>
<li>Infectious cysts that are passed through stool
<ul class="org-ul">
<li>Humans can contract amebiasis by contaminated water or food</li>
<li>Amebiasis is associated with man who have sex with men(via anal-oral sexual intercourse)</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Ingestion of cysts -&gt; excystation in the small intestine -&gt; noninvasive colonization of the colon by trophozoites -&gt; trophozoites encyst -&gt; cysts are excreted along with trophozoites -&gt; cysts are ingested by another host or re-ingested by same host</li>
</ul></li>
<li>Right lobe of the liver is the most common site of amebic liver abscess
<ul class="org-ul">
<li>Hepatic amebiasis can present with right upper quadrant pain</li>
</ul></li>
<li>Intestinal amebiasis presents with <b><b>ulceration</b></b> of the intestinal mucosa
<ul class="org-ul">
<li>Ulcers are typically flask-shaped</li>
</ul></li>
<li>Ulceration of the intestinal mucosa will result in <b><b>bloody diarrhea</b></b></li>
<li>Diagnostics :
<ul class="org-ul">
<li>Stool O&amp;P</li>
<li>Entamoeba histolytica <b><b>trophozoites present with endocytosed RBCs</b></b></li>
</ul></li>
<li>Treatment :
<ul class="org-ul">
<li>Metronidazole</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org81ef570" class="outline-4">
<h4 id="org81ef570">Entamoeba dispar</h4>
<div class="outline-text-4" id="text-org81ef570">
<ul class="org-ul">
<li>nonpathogenic species in the large intestine</li>
<li>similar to E.Histolytica but never ingests RBCs</li>
<li>has trophozoite and cyst form</li>
</ul>
</div>
</div>

<div id="outline-container-org63bbee6" class="outline-4">
<h4 id="org63bbee6">Entamoeba gingivalis</h4>
<div class="outline-text-4" id="text-org63bbee6">
<ul class="org-ul">
<li>the first amoeba described in humans</li>
<li>associated with gum disease</li>
<li>transmitted via kissing</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3d948f0" class="outline-2">
<h2 id="org3d948f0">82. Phylum Apicomplexa. Toxoplasma gondii.</h2>
<div class="outline-text-2" id="text-org3d948f0">
</div>
<div id="outline-container-orgbd23ae8" class="outline-4">
<h4 id="orgbd23ae8">Phylum Apicomplexa</h4>
<div class="outline-text-4" id="text-orgbd23ae8">
<ul class="org-ul">
<li>Posses a unique organelle, called apicoplast(nonphosynthetic plasmid)
<ul class="org-ul">
<li>Hosts four main metabolic pathways(Fatty Acid synthesis, Isoprenoid Syntehsis, Heme Synthesis, Iron-sulphur cluster synthesis)</li>
</ul></li>
<li>Both sexual and sexual reproduction</li>
</ul>
</div>
</div>
<div id="outline-container-org26c9f03" class="outline-4">
<h4 id="org26c9f03">Toxoplasma gondii</h4>
<div class="outline-text-4" id="text-org26c9f03">
<ul class="org-ul">
<li>Toxoplasma gondii is a CNS protozoan</li>
<li>Obligate intracellular</li>
<li>Can transfer transplacentally to unborn fetus
<ul class="org-ul">
<li>Congenital toxoplasmosis presents with intracranial calcifications and hydrocephalus with seizures</li>
<li>Hearing loss and chorioretinitis also possible</li>
</ul></li>
<li>Cats are definitive host, humans can contract toxoplasmosis via contact with cat feces
<ul class="org-ul">
<li>Toxoplasma gondii <b><b>oocysts</b></b> are found in warm-blooded animal feces, particularly <b><b>in cats</b></b></li>
</ul></li>
<li>Transmission by <b><b>cysts</b></b> in <b><b>undercooked meat</b></b></li>
<li>Immunocompromised patients are at a higher risk
<ul class="org-ul">
<li>Multiple ring-enhancing lessions on CT/MRI is feature of cerebral toxoplasmos in immunocompromised patients(HIV/AIDS)</li>
</ul></li>
<li>Immunocompotent individuals are usually asymptomatic</li>
<li>Tachyzoite form -+</li>
<li>Toxoplasma gondii <b><b>cysts</b></b> can be found <b><b>in undercooked meat</b></b></li>
<li>Forms :</li>
<li>Tachyzoites:
<ul class="org-ul">
<li>Rapid growth and divison</li>
<li>Endodyogeny</li>
</ul></li>
<li>Bradyzoites
<ul class="org-ul">
<li>Pseudocysts</li>
<li>Usually in infected muscles and brain</li>
</ul></li>
<li>Diagnostics:
<ul class="org-ul">
<li>Serology(IgM antibody in acute, IgG antibody remains positive for life)</li>
<li>PCR</li>
<li>CT/MRI</li>
</ul></li>
<li>Treatment :
<ul class="org-ul">
<li>Sulfadiazine/Pyrimethamine</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf5ab49a" class="outline-2">
<h2 id="orgf5ab49a">83. Plasmodium vivax. Plasmodium malariae. Plasmodium falciparum. Morphological differences in the erythrocyte schizogony of the genus Plasmodium.</h2>
<div class="outline-text-2" id="text-orgf5ab49a">
<ul class="org-ul">
<li>Genus Plasmodium belongs to the Phylum Apicomplexa</li>
<li>Plasmodium spp. are blood protozoa that cause malaria
<ul class="org-ul">
<li>Malaria present with high-grade fever and flue-like symptoms</li>
<li>Most Malaria infections are associated with anemia, jaundice and hepatosplenomegaly</li>
</ul></li>
<li>Vector : Anopheles mosquito</li>
</ul>
</div>
