content/Biology.org
*** Plasmodium Falciparum
+ Endemic to sub-Saharan Africa and Southeast Asia
+ Irregular fever pattern
+ Associated with **severe** malaria
+ Cytoadherencae:
 + Erythrocytes parasitized by P.Falciparum can occlude renal, hepatic and pulmonary vessels -> renal failure, hepatic failure and ARDS
+ Erythrocytes parasitized by P.Falciparum can occlude cerebral capillaries -+ cerebral malaria
+ **Sickle cell** and **alpha and beta thalassemia** confer relative protection against P.Falciparum

*** Plasmodium Vivax
+ Endemic to Southeast Asia, Americas, Africa
+ P.Vivax produce hypnozoites(dormant stage) that can persist in the liver and cause relapse of malaria weeks or months later
+ Produce fever spikes every 48hours(tertian fever)

*** Plasmodium Malariae
+ Endemic to sub-Saharan Africa, Southeast Asia and South America
+ Produce fever spikes every 72hours(quartan fever)

*** Life cycle
+ female mosquito takes a blood meal and injects *sporozoites* into the bloodstream, **beginning the exoerythrogenic cycle**
+ Plasmodium sporozoites migrate to the liver where they infect hepatocytes
+ Sporozoites divide asexually to form *mutlinucleated schizonts*, each schizonts **contains 8-24 merozoites**
+ Schizonts rupture to release merozoites into the bloodstream
+ *Sporozoites of P.vivax* can develop into **hypnozoites** which lie dormant into hepatocytes for weeks to months
+ Plasmodium merozoites infect RBCs, *beginning erythrogenic cycle*
+ Plasmodium merozoites develop into **ring forms**
+ Plasmodium ring forms progress to **mature trophozoites within RBCs**
+ Mature trophozoites develop into **schizonts**
+ Rupture of schizonts -+ **lysis of RBCs** -> release of merozoites into the blood stream -> infection of new RBCs
+ A small number of merozoites differentiate into male and female +*gametocytes**

*** Morphological differences
+ P.Falciparum gametocytes appear banana-shaped
+ P.vivax induce morphological changes in infected RBCs that are visible on microscopy -+ **Schuffner dots**
+ P.Malariae has band-like trophozoite stage


+ Diagnosis :
    + Blood smear prepared with Giemsa stain for visualization

* 84. Phylum Ciliophora. Balantidium coli.
*** Phylum Ciliophora
+ Complex protozoans, found in lakes, rivers, oceans and soil
+ Ectosymbiotic, endosymbiotic and sometimes parasites
+ Characteristics :
    + Cilira :
        + Hair-like organelles, similar to flagella but shorter
        + used in swimming and attachment
    + Two different nuclei :
        + a small, diploid micronucleus(reproduction)
        + a large, polyploid macronucleus(general cell regulation)
    + Cytosome and cytopharynx
+ Reproduction by fission(asecual), autogamy(self-fertilization) and conjugation(use of plasmids)

*** Balantidium coli
+ The only ciliate known to be parasite in human
+ Found in the colon, in humans as well as pigs and other mammals
+ Asymptomatic in healthy individuals
+ In malnurished patients -+ colon dysfunction

* TODO 85. Metazoa: important evolutionary changes associated with the transition to multicellularity. Phylum Cnidaria (Coelenterata). Genus Hydra. Genus Obelia.
* 86. Phylum Platyhelminthes: important evolutionary changes. Class Trematoda. Fasciola hepatica.
*** Phylum Platyhelmnithes
+ Triploblastic(Ectoderm,Mesoderm,Endoderm)
+ First organism with bilateral symmetry and tissues organized into organs
+ no specialized circulatory and respiratory organs
+ Characteristics:
    + Flattened shape that allows oxygen and nutrients to pass through their bodies by diffusion
    + One opening for ingestion and egestion
    + Nevrous system :
        + A pair of anterior ganglia, two longitudinal nerve cords, interconnected by transverse nerves
    + Excretory system :
        + protonephridia and their associated ducts
    + Reproductive system :
        + Hermaphrodites
*** Class Trematoda(Flukes)
+ Worm-like
+ Hermaphrodites :
    + Usually with testes
    + Usually a single ovarium
    + a pair of vitelline glands on either body side for yolk production
    + ootype(fertilization place)
    + elongated uterus(egg maturation place)
+ Aseual reproduction of the larval stages
+ **Trematodes infect mollusks as the first host**
*** Fasciola Hepatica
+ Life Cycle :
    + **Metacercariae** on freshwater plants are ingested by herbivorous mammals e.g sheep, cattle or humans(incidental host)
    + Migration of the organism through the intestinal wall, then liver parenchyma into biliarry ducts
    + Adult fluke release eggs into the biliary ducts, which are passed in the stool
    + Snails serve as intermediate host
+ Transmission by consumption of contaminated freshwater plants
+ Clinical features :
    + Acute phase :
        + fever, right upper quadrant pain, hepatomegaly
    + Chronic billiary phase :
        + Diarrhea, vomiting, biliarry obstruction
+ Diagnosis :
    + Eosinophilia and detection of eggs in stool

* 87. Dicrocoelium dendriticum (D. lanceatum).
+ Liver fluke, Belongs to the Class Trematoda(flukes)
+ Two intermediate hosts(Snail, ant) -+ Mainly found in grazing animals
+ Life cycle :
    + Grazing animal(e.g cow) ingests ant with metacercaria
    + Matures into adult fluke in the bile duct of liver
    + Eggs are passed in feces
    + Snail digests eggs from animal feces, where they hatch and mature into cercaria
    + Cercaria are found in snail slime, which ants ingest
    + Metacercaria encyst in ant
+ Transmission to humans is rare
+ Clinical features :
    + Mild symptoms, digestive distrurbances and diarrhea
    + May cause in hepatomegaly or cirrhosis in heavier infections
+ Morphology :
    + Similar to Clonorchis sinensis, distinguished by testes in the anterior body, as opposed to the Clonorchis sinensis whose testes are located in the posterior
    + The posterior is where the uterus is, antiorly an oral sucker is found

* 88. Opisthorchis felineus. Genus Schistosoma and its species.
*** Opisthorchis felinewus
+ Cat liver fluke (trematode parasite)
+ Two intermediate hosts :
    + Snail, freshwater fish
+ definitive host are fish-eating mammals such as dogs,cats and humans

