public/Biology.html

<div id="outline-container-org12f76e2" class="outline-4">
<h4 id="org12f76e2">Plasmodium Falciparum</h4>
<div class="outline-text-4" id="text-org12f76e2">
<ul class="org-ul">
<li>Endemic to sub-Saharan Africa and Southeast Asia</li>
<li>Irregular fever pattern</li>
<li>Associated with <b><b>severe</b></b> malaria</li>
<li>Cytoadherencae:
<ul class="org-ul">
<li>Erythrocytes parasitized by P.Falciparum can occlude renal, hepatic and pulmonary vessels -&gt; renal failure, hepatic failure and ARDS</li>
</ul></li>
<li>Erythrocytes parasitized by P.Falciparum can occlude cerebral capillaries -+ cerebral malaria</li>
<li><b><b>Sickle cell</b></b> and <b><b>alpha and beta thalassemia</b></b> confer relative protection against P.Falciparum</li>
</ul>
</div>
</div>

<div id="outline-container-orgec8935f" class="outline-4">
<h4 id="orgec8935f">Plasmodium Vivax</h4>
<div class="outline-text-4" id="text-orgec8935f">
<ul class="org-ul">
<li>Endemic to Southeast Asia, Americas, Africa</li>
<li>P.Vivax produce hypnozoites(dormant stage) that can persist in the liver and cause relapse of malaria weeks or months later</li>
<li>Produce fever spikes every 48hours(tertian fever)</li>
</ul>
</div>
</div>

<div id="outline-container-orge951352" class="outline-4">
<h4 id="orge951352">Plasmodium Malariae</h4>
<div class="outline-text-4" id="text-orge951352">
<ul class="org-ul">
<li>Endemic to sub-Saharan Africa, Southeast Asia and South America</li>
<li>Produce fever spikes every 72hours(quartan fever)</li>
</ul>
</div>
</div>

<div id="outline-container-org560a301" class="outline-4">
<h4 id="org560a301">Life cycle</h4>
<div class="outline-text-4" id="text-org560a301">
<ul class="org-ul">
<li>female mosquito takes a blood meal and injects <b>sporozoites</b> into the bloodstream, <b><b>beginning the exoerythrogenic cycle</b></b></li>
<li>Plasmodium sporozoites migrate to the liver where they infect hepatocytes</li>
<li>Sporozoites divide asexually to form <b>mutlinucleated schizonts</b>, each schizonts <b><b>contains 8-24 merozoites</b></b></li>
<li>Schizonts rupture to release merozoites into the bloodstream</li>
<li><b>Sporozoites of P.vivax</b> can develop into <b><b>hypnozoites</b></b> which lie dormant into hepatocytes for weeks to months</li>
<li>Plasmodium merozoites infect RBCs, <b>beginning erythrogenic cycle</b></li>
<li>Plasmodium merozoites develop into <b><b>ring forms</b></b></li>
<li>Plasmodium ring forms progress to <b><b>mature trophozoites within RBCs</b></b></li>
<li>Mature trophozoites develop into <b><b>schizonts</b></b></li>
<li>Rupture of schizonts -+ <b><b>lysis of RBCs</b></b> -&gt; release of merozoites into the blood stream -&gt; infection of new RBCs</li>
<li>A small number of merozoites differentiate into male and female +*gametocytes**</li>
</ul>
</div>
</div>

<div id="outline-container-org1ff1ed0" class="outline-4">
<h4 id="org1ff1ed0">Morphological differences</h4>
<div class="outline-text-4" id="text-org1ff1ed0">
<ul class="org-ul">
<li>P.Falciparum gametocytes appear banana-shaped</li>
<li>P.vivax induce morphological changes in infected RBCs that are visible on microscopy -+ <b><b>Schuffner dots</b></b></li>
<li>P.Malariae has band-like trophozoite stage</li>
</ul>


<ul class="org-ul">
<li>Diagnosis :
<ul class="org-ul">
<li>Blood smear prepared with Giemsa stain for visualization</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgff59d15" class="outline-2">
<h2 id="orgff59d15">84. Phylum Ciliophora. Balantidium coli.</h2>
<div class="outline-text-2" id="text-orgff59d15">
</div>
<div id="outline-container-org9291770" class="outline-4">
<h4 id="org9291770">Phylum Ciliophora</h4>
<div class="outline-text-4" id="text-org9291770">
<ul class="org-ul">
<li>Complex protozoans, found in lakes, rivers, oceans and soil</li>
<li>Ectosymbiotic, endosymbiotic and sometimes parasites</li>
<li>Characteristics :
<ul class="org-ul">
<li>Cilira :
<ul class="org-ul">
<li>Hair-like organelles, similar to flagella but shorter</li>
<li>used in swimming and attachment</li>
</ul></li>
<li>Two different nuclei :
<ul class="org-ul">
<li>a small, diploid micronucleus(reproduction)</li>
<li>a large, polyploid macronucleus(general cell regulation)</li>
</ul></li>
<li>Cytosome and cytopharynx</li>
</ul></li>
<li>Reproduction by fission(asecual), autogamy(self-fertilization) and conjugation(use of plasmids)</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf6d156" class="outline-4">
<h4 id="orgcf6d156">Balantidium coli</h4>
<div class="outline-text-4" id="text-orgcf6d156">
<ul class="org-ul">
<li>The only ciliate known to be parasite in human</li>
<li>Found in the colon, in humans as well as pigs and other mammals</li>
<li>Asymptomatic in healthy individuals</li>
<li>In malnurished patients -+ colon dysfunction</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org673c960" class="outline-2">
<h2 id="org673c960"><span class="todo TODO">TODO</span> 85. Metazoa: important evolutionary changes associated with the transition to multicellularity. Phylum Cnidaria (Coelenterata). Genus Hydra. Genus Obelia.</h2>
</div>
<div id="outline-container-orgb29fab5" class="outline-2">
<h2 id="orgb29fab5">86. Phylum Platyhelminthes: important evolutionary changes. Class Trematoda. Fasciola hepatica.</h2>
<div class="outline-text-2" id="text-orgb29fab5">
</div>
<div id="outline-container-org87b5086" class="outline-4">
<h4 id="org87b5086">Phylum Platyhelmnithes</h4>
<div class="outline-text-4" id="text-org87b5086">
<ul class="org-ul">
<li>Triploblastic(Ectoderm,Mesoderm,Endoderm)</li>
<li>First organism with bilateral symmetry and tissues organized into organs</li>
<li>no specialized circulatory and respiratory organs</li>
<li>Characteristics:
<ul class="org-ul">
<li>Flattened shape that allows oxygen and nutrients to pass through their bodies by diffusion</li>
<li>One opening for ingestion and egestion</li>
<li>Nevrous system :
<ul class="org-ul">
<li>A pair of anterior ganglia, two longitudinal nerve cords, interconnected by transverse nerves</li>
</ul></li>
<li>Excretory system :
<ul class="org-ul">
<li>protonephridia and their associated ducts</li>
</ul></li>
<li>Reproductive system :
<ul class="org-ul">
<li>Hermaphrodites</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2c541a7" class="outline-4">
<h4 id="org2c541a7">Class Trematoda(Flukes)</h4>
<div class="outline-text-4" id="text-org2c541a7">
<ul class="org-ul">
<li>Worm-like</li>
<li>Hermaphrodites :
<ul class="org-ul">
<li>Usually with testes</li>
<li>Usually a single ovarium</li>
<li>a pair of vitelline glands on either body side for yolk production</li>
<li>ootype(fertilization place)</li>
<li>elongated uterus(egg maturation place)</li>
</ul></li>
<li>Aseual reproduction of the larval stages</li>
<li><b><b>Trematodes infect mollusks as the first host</b></b></li>
</ul>
</div>
</div>
<div id="outline-container-org2f71258" class="outline-4">
<h4 id="org2f71258">Fasciola Hepatica</h4>
<div class="outline-text-4" id="text-org2f71258">
<ul class="org-ul">
<li>Life Cycle :
<ul class="org-ul">
<li><b><b>Metacercariae</b></b> on freshwater plants are ingested by herbivorous mammals e.g sheep, cattle or humans(incidental host)</li>
<li>Migration of the organism through the intestinal wall, then liver parenchyma into biliarry ducts</li>
<li>Adult fluke release eggs into the biliary ducts, which are passed in the stool</li>
<li>Snails serve as intermediate host</li>
</ul></li>
<li>Transmission by consumption of contaminated freshwater plants</li>
<li>Clinical features :
<ul class="org-ul">
<li>Acute phase :
<ul class="org-ul">
<li>fever, right upper quadrant pain, hepatomegaly</li>
</ul></li>
<li>Chronic billiary phase :
<ul class="org-ul">
<li>Diarrhea, vomiting, biliarry obstruction</li>
</ul></li>
</ul></li>
<li>Diagnosis :
<ul class="org-ul">
<li>Eosinophilia and detection of eggs in stool</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1d27aad" class="outline-2">
<h2 id="org1d27aad">87. Dicrocoelium dendriticum (D. lanceatum).</h2>
<div class="outline-text-2" id="text-org1d27aad">
<ul class="org-ul">
<li>Liver fluke, Belongs to the Class Trematoda(flukes)</li>
<li>Two intermediate hosts(Snail, ant) -+ Mainly found in grazing animals</li>
<li>Life cycle :
<ul class="org-ul">
<li>Grazing animal(e.g cow) ingests ant with metacercaria</li>
<li>Matures into adult fluke in the bile duct of liver</li>
<li>Eggs are passed in feces</li>
<li>Snail digests eggs from animal feces, where they hatch and mature into cercaria</li>
<li>Cercaria are found in snail slime, which ants ingest</li>
<li>Metacercaria encyst in ant</li>
</ul></li>
<li>Transmission to humans is rare</li>
<li>Clinical features :
<ul class="org-ul">
<li>Mild symptoms, digestive distrurbances and diarrhea</li>
<li>May cause in hepatomegaly or cirrhosis in heavier infections</li>
</ul></li>
<li>Morphology :
<ul class="org-ul">
<li>Similar to Clonorchis sinensis, distinguished by testes in the anterior body, as opposed to the Clonorchis sinensis whose testes are located in the posterior</li>
<li>The posterior is where the uterus is, antiorly an oral sucker is found</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org29ec3b0" class="outline-2">
<h2 id="org29ec3b0">88. Opisthorchis felineus. Genus Schistosoma and its species.</h2>
<div class="outline-text-2" id="text-org29ec3b0">
</div>
<div id="outline-container-org73086a6" class="outline-4">
<h4 id="org73086a6">Opisthorchis felinewus</h4>
<div class="outline-text-4" id="text-org73086a6">
<ul class="org-ul">
<li>Cat liver fluke (trematode parasite)</li>
<li>Two intermediate hosts :
<ul class="org-ul">
<li>Snail, freshwater fish</li>
</ul></li>
<li>definitive host are fish-eating mammals such as dogs,cats and humans</li>
</ul>
</div>
</div>
