content/Biology.org
*** Genus Schistosoma
+ free-living Schistosoma spp. cercariae are found in aquatic environments
    + Swimmers high risk group
+ snails are intermediate host of Schistosoma spp.
+ Schistosoma spp. mature in the liver
+ Migrate against the portal flow
+ Eggs of **Schistosoma mansosi** have a **lateral spine**
+ Eggs of **Schistosoma japonicum** have a **small spine**(appear round)
+ Eggs of **Schistosoma haematobium** have a **Large terminal spine**
+ Schistosoma spp. cause swimmer's itch(allergic reaction that manifests as rash, usually on lower legs)
+ Schistosoma spp. cause **cirrhosis** and **periportal fibrosis** which may lead to portal hypertension
+ Hepatitis caused by schistosomiasis can present with jaundice
+ Schistosoma haematobium infects urinary tract, which presents with hematuria
    +Schistosomiasis is a +*risk factor** for squamous cell bladder cancer

* 89. Class Cestoda. Diphyllobothrium latum.
*** Class Cestoda
+ Parasites in all vertebrates
+ Adult form is intestinal
+ Pass through feces
+ Larval stages in tissues(cysticercus)
+ Absorp nutrients through the skin, **NO digestive system**
+ Parts :
    + Scolex
        + rostellum of hooks - T.Solium
        + 4 suckers - T. Saginata,
    + Neckpiece for budding new proglottids

*** Diphyllobothrium latum
+ Largest tapeworm - can reach 10meters
+ Infection by eating raw or under cooked fish
+ Scolex:
    + 2 bothria
+ Proglottids can be seen in stool exam
+ Adults can shed up to a million eggs a day
+ Clinical features :
    + B12 deficiency, which may lead to megaloblastic anemia
+ Treament :
    + Praziquantel

* 90. Taenia saginata. Taenia solium.
+ Taenia saginata and Taenia soluium are tapeworms(Cestodes)
+ Both cause Intestinal Taeniasis, only T.Solium can cause cysticercosis
*** Taenia Saginata
+ Beef tapeworm
+ Transmission :
    + Infestion of larvae(cysticerci) in raw or undercooked beef
+ Clinical features :
    + Often asymptomatic
    + May cause abdominal pain, weight loss and vomiting
    + Eosinophilia
+ Hosts :
    + Cattle - intermediate host
    + Human - Definitive host
+ Morphology :
    + Scolex with 4 suckers, no rostellum.
    + Gravid proglottid with more than 12 uterine branches on each side


*** Taenia Solium
+ Pork tapeworm
+ Transmission :
    + Ingestion of larvae in raw or undercooked pork -+ Intestinal taeniasis
    + Fecal-oral: eggs are ingested from contaminated water -+ Cysticercosis
+ Clinical features :
    + Often asymptomatic
    + May cause abdominal pain, weight loss and vomiting
    + Eosinophilia
    + May cause cysticerci accumulation in subcutaneous tissue, muscles and CNS
+ Hosts :
    + Pigs - intermediate host
    + Humans - Definitive host
+ Mophology :
    + Scolex - rostellum with 2 rows of 4 hooks and suckers
    + Gravid proglottid - less than 12 uterine brancehs on each side
+ **Neurocysticercosis** is an infection of the CNS that can develop following ingestion of Taenia Solium eggs
    + Taenia solium eggs can be transmitted via feces-contaminated water
    + Neurocysticercosis by T.Solium can lead to seizures
    + Neurocysticercosis shows characteristic cheese-like brain lesions on CT scan
+ Neurocysticercosis occurs if T.Solium disseminates from the small intestine to CNS
+ Treatment :
    + Praziquantel for common infection, add albendazole+corticosteroids for neurocysticercosis

*** Life cycle
+ This applies to both Taenia spp.
+ Eggs hatch in the human intestine
+ Develop into adult worms
+ Produce proglottids which can detach from the tapeworm and are passed in the feces


* 91. Echinococcus granulosus. Hymenolepis nana.

+ Both are tapeworms(Cestodes)
*** Echinococcus
+ Transmission :
    + Hand-to-mouth
        + From the fur of the definitive host(e.g dog)
        + Contaminated dirt(e.g dog feces)
    + Fecal-oral
        + Consumption of food/water contaminated with fecal matter
+ Hosts :
    + Definitive hosts: **Dogs**, cats, foxes
    + Intermediate hosts : Hoofed animals(e.g **sheep**)
    + Humans are accidental host(e.g sheep farmets)
+ Clinical features
    + Cystic echinococcosis
        + Usually asymptomatic
        + Single hepatic cyst
        + Cyst rupture causes anaphylactic reaction
        + Hepatomegaly -+ **RUQ pain**
    + Alveolar echinococcosis
        + Rarely affects humans
        + Hepatic cyst
            + Hepatomegaly -+ **RUQ pain**
            + Cyst that invades and destroys the liver
**** Life cycle
+ Definitive host consumes hydatid cysts from an intermediate host
+ Adult tapeworms develop and inhabit the small intestine
+ Tapeworms produce eggs that are shed through stool, contaminating the ground
+ eggs are ingested by the intermediate hosts
+ eggs hatch within the intestine and penetrate the intestinal wall
+ travel trhough the bloodstream and into the lymphatic system -+ Liver and other organs
+ Form hydatid cysts

*** Hymenolepis nana
+ Transmission
    + Ingestion of eggs from contaminated food or water
    + Infestion of cysticercoids from infected arthropods
+ Clinical features :
    + Mostly asymptomatic
    + May cause weight loss, abdominal pain and diarrhea
+ Morphology :
    + rostellum and **4 suckers**
    + 3 tester in each proglottid
+ Life cycle :
    + Ingestion of eggs
    + Develop into cysticercoid larvae in **small intestine**
    + Cysticercoids develop into an adult worm in the intestinal lumen
    + Eggs are passed through stool

* 92. Phylum Nematoda. Ascaris lumbricoides.
*** Phylum Nematoda
+ Roundworms, males smaller than females, transmitted by arthropod vectors
+ Belong to a newly named group, Ecdysozoa(superphylum)
+ Characteristics of Ecdysozoa :
    + 3 layered cuticle which is periodicly molted as the animal grows
        + This process is referred to as **ecdysis**
    + Protostomes
+ Body structure :
    + Acellular covering - Cuticle
    + Hydrostatic skeleton
    + Sexual dimorphism - Females are larger than males
