public/Biology.html

<div id="outline-container-org44acf08" class="outline-4">
<h4 id="org44acf08">Genus Schistosoma</h4>
<div class="outline-text-4" id="text-org44acf08">
<ul class="org-ul">
<li>free-living Schistosoma spp. cercariae are found in aquatic environments
<ul class="org-ul">
<li>Swimmers high risk group</li>
</ul></li>
<li>snails are intermediate host of Schistosoma spp.</li>
<li>Schistosoma spp. mature in the liver</li>
<li>Migrate against the portal flow</li>
<li>Eggs of <b><b>Schistosoma mansosi</b></b> have a <b><b>lateral spine</b></b></li>
<li>Eggs of <b><b>Schistosoma japonicum</b></b> have a **small spine**(appear round)</li>
<li>Eggs of <b><b>Schistosoma haematobium</b></b> have a <b><b>Large terminal spine</b></b></li>
<li>Schistosoma spp. cause swimmer's itch(allergic reaction that manifests as rash, usually on lower legs)</li>
<li>Schistosoma spp. cause <b><b>cirrhosis</b></b> and <b><b>periportal fibrosis</b></b> which may lead to portal hypertension</li>
<li>Hepatitis caused by schistosomiasis can present with jaundice</li>
<li>Schistosoma haematobium infects urinary tract, which presents with hematuria
+Schistosomiasis is a +*risk factor** for squamous cell bladder cancer</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9439c19" class="outline-2">
<h2 id="org9439c19">89. Class Cestoda. Diphyllobothrium latum.</h2>
<div class="outline-text-2" id="text-org9439c19">
</div>
<div id="outline-container-org03dbbca" class="outline-4">
<h4 id="org03dbbca">Class Cestoda</h4>
<div class="outline-text-4" id="text-org03dbbca">
<ul class="org-ul">
<li>Parasites in all vertebrates</li>
<li>Adult form is intestinal</li>
<li>Pass through feces</li>
<li>Larval stages in tissues(cysticercus)</li>
<li>Absorp nutrients through the skin, <b><b>NO digestive system</b></b></li>
<li>Parts :
<ul class="org-ul">
<li>Scolex
<ul class="org-ul">
<li>rostellum of hooks - T.Solium</li>
<li>4 suckers - T. Saginata,</li>
</ul></li>
<li>Neckpiece for budding new proglottids</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf634db2" class="outline-4">
<h4 id="orgf634db2">Diphyllobothrium latum</h4>
<div class="outline-text-4" id="text-orgf634db2">
<ul class="org-ul">
<li>Largest tapeworm - can reach 10meters</li>
<li>Infection by eating raw or under cooked fish</li>
<li>Scolex:
<ul class="org-ul">
<li>2 bothria</li>
</ul></li>
<li>Proglottids can be seen in stool exam</li>
<li>Adults can shed up to a million eggs a day</li>
<li>Clinical features :
<ul class="org-ul">
<li>B12 deficiency, which may lead to megaloblastic anemia</li>
</ul></li>
<li>Treament :
<ul class="org-ul">
<li>Praziquantel</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf60a977" class="outline-2">
<h2 id="orgf60a977">90. Taenia saginata. Taenia solium.</h2>
<div class="outline-text-2" id="text-orgf60a977">
<ul class="org-ul">
<li>Taenia saginata and Taenia soluium are tapeworms(Cestodes)</li>
<li>Both cause Intestinal Taeniasis, only T.Solium can cause cysticercosis</li>
</ul>
</div>
<div id="outline-container-org366fae1" class="outline-4">
<h4 id="org366fae1">Taenia Saginata</h4>
<div class="outline-text-4" id="text-org366fae1">
<ul class="org-ul">
<li>Beef tapeworm</li>
<li>Transmission :
<ul class="org-ul">
<li>Infestion of larvae(cysticerci) in raw or undercooked beef</li>
</ul></li>
<li>Clinical features :
<ul class="org-ul">
<li>Often asymptomatic</li>
<li>May cause abdominal pain, weight loss and vomiting</li>
<li>Eosinophilia</li>
</ul></li>
<li>Hosts :
<ul class="org-ul">
<li>Cattle - intermediate host</li>
<li>Human - Definitive host</li>
</ul></li>
<li>Morphology :
<ul class="org-ul">
<li>Scolex with 4 suckers, no rostellum.</li>
<li>Gravid proglottid with more than 12 uterine branches on each side</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org24d26a9" class="outline-4">
<h4 id="org24d26a9">Taenia Solium</h4>
<div class="outline-text-4" id="text-org24d26a9">
<ul class="org-ul">
<li>Pork tapeworm</li>
<li>Transmission :
<ul class="org-ul">
<li>Ingestion of larvae in raw or undercooked pork -+ Intestinal taeniasis</li>
<li>Fecal-oral: eggs are ingested from contaminated water -+ Cysticercosis</li>
</ul></li>
<li>Clinical features :
<ul class="org-ul">
<li>Often asymptomatic</li>
<li>May cause abdominal pain, weight loss and vomiting</li>
<li>Eosinophilia</li>
<li>May cause cysticerci accumulation in subcutaneous tissue, muscles and CNS</li>
</ul></li>
<li>Hosts :
<ul class="org-ul">
<li>Pigs - intermediate host</li>
<li>Humans - Definitive host</li>
</ul></li>
<li>Mophology :
<ul class="org-ul">
<li>Scolex - rostellum with 2 rows of 4 hooks and suckers</li>
<li>Gravid proglottid - less than 12 uterine brancehs on each side</li>
</ul></li>
<li><b><b>Neurocysticercosis</b></b> is an infection of the CNS that can develop following ingestion of Taenia Solium eggs
<ul class="org-ul">
<li>Taenia solium eggs can be transmitted via feces-contaminated water</li>
<li>Neurocysticercosis by T.Solium can lead to seizures</li>
<li>Neurocysticercosis shows characteristic cheese-like brain lesions on CT scan</li>
</ul></li>
<li>Neurocysticercosis occurs if T.Solium disseminates from the small intestine to CNS</li>
<li>Treatment :
<ul class="org-ul">
<li>Praziquantel for common infection, add albendazole+corticosteroids for neurocysticercosis</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4a66852" class="outline-4">
<h4 id="org4a66852">Life cycle</h4>
<div class="outline-text-4" id="text-org4a66852">
<ul class="org-ul">
<li>This applies to both Taenia spp.</li>
<li>Eggs hatch in the human intestine</li>
<li>Develop into adult worms</li>
<li>Produce proglottids which can detach from the tapeworm and are passed in the feces</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orge33ca68" class="outline-2">
<h2 id="orge33ca68">91. Echinococcus granulosus. Hymenolepis nana.</h2>
<div class="outline-text-2" id="text-orge33ca68">
<ul class="org-ul">
<li>Both are tapeworms(Cestodes)</li>
</ul>
</div>
<div id="outline-container-orgc0604ca" class="outline-4">
<h4 id="orgc0604ca">Echinococcus</h4>
<div class="outline-text-4" id="text-orgc0604ca">
<ul class="org-ul">
<li>Transmission :
<ul class="org-ul">
<li>Hand-to-mouth
<ul class="org-ul">
<li>From the fur of the definitive host(e.g dog)</li>
<li>Contaminated dirt(e.g dog feces)</li>
</ul></li>
<li>Fecal-oral
<ul class="org-ul">
<li>Consumption of food/water contaminated with fecal matter</li>
</ul></li>
</ul></li>
<li>Hosts :
<ul class="org-ul">
<li>Definitive hosts: <b><b>Dogs</b></b>, cats, foxes</li>
<li>Intermediate hosts : Hoofed animals(e.g <b><b>sheep</b></b>)</li>
<li>Humans are accidental host(e.g sheep farmets)</li>
</ul></li>
<li>Clinical features
<ul class="org-ul">
<li>Cystic echinococcosis
<ul class="org-ul">
<li>Usually asymptomatic</li>
<li>Single hepatic cyst</li>
<li>Cyst rupture causes anaphylactic reaction</li>
<li>Hepatomegaly -+ <b><b>RUQ pain</b></b></li>
</ul></li>
<li>Alveolar echinococcosis
<ul class="org-ul">
<li>Rarely affects humans</li>
<li>Hepatic cyst
<ul class="org-ul">
<li>Hepatomegaly -+ <b><b>RUQ pain</b></b></li>
<li>Cyst that invades and destroys the liver</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgb7f9224"></a>Life cycle<br />
<div class="outline-text-5" id="text-orgb7f9224">
<ul class="org-ul">
<li>Definitive host consumes hydatid cysts from an intermediate host</li>
<li>Adult tapeworms develop and inhabit the small intestine</li>
<li>Tapeworms produce eggs that are shed through stool, contaminating the ground</li>
<li>eggs are ingested by the intermediate hosts</li>
<li>eggs hatch within the intestine and penetrate the intestinal wall</li>
<li>travel trhough the bloodstream and into the lymphatic system -+ Liver and other organs</li>
<li>Form hydatid cysts</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgca3e1c2" class="outline-4">
<h4 id="orgca3e1c2">Hymenolepis nana</h4>
<div class="outline-text-4" id="text-orgca3e1c2">
<ul class="org-ul">
<li>Transmission
<ul class="org-ul">
<li>Ingestion of eggs from contaminated food or water</li>
<li>Infestion of cysticercoids from infected arthropods</li>
</ul></li>
<li>Clinical features :
<ul class="org-ul">
<li>Mostly asymptomatic</li>
<li>May cause weight loss, abdominal pain and diarrhea</li>
</ul></li>
<li>Morphology :
<ul class="org-ul">
<li>rostellum and <b><b>4 suckers</b></b></li>
<li>3 tester in each proglottid</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Ingestion of eggs</li>
<li>Develop into cysticercoid larvae in <b><b>small intestine</b></b></li>
<li>Cysticercoids develop into an adult worm in the intestinal lumen</li>
<li>Eggs are passed through stool</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8f021bf" class="outline-2">
<h2 id="org8f021bf">92. Phylum Nematoda. Ascaris lumbricoides.</h2>
<div class="outline-text-2" id="text-org8f021bf">
</div>
<div id="outline-container-orgd487f7a" class="outline-4">
<h4 id="orgd487f7a">Phylum Nematoda</h4>
<div class="outline-text-4" id="text-orgd487f7a">
<ul class="org-ul">
<li>Roundworms, males smaller than females, transmitted by arthropod vectors</li>
<li>Belong to a newly named group, Ecdysozoa(superphylum)</li>
<li>Characteristics of Ecdysozoa :
<ul class="org-ul">
<li>3 layered cuticle which is periodicly molted as the animal grows
<ul class="org-ul">
<li>This process is referred to as <b><b>ecdysis</b></b></li>
</ul></li>
<li>Protostomes</li>
</ul></li>
<li>Body structure :
<ul class="org-ul">
<li>Acellular covering - Cuticle</li>
<li>Hydrostatic skeleton</li>
<li>Sexual dimorphism - Females are larger than males</li>
</ul></li>
</ul>
</div>
</div>
