content/Biology.org
*** Ascaris Lumbricoides
+ Giant roundworm, fecal oral transmission, Nematode, Geohelminth
+ Transmission :
    + Fecal-oral - consumption of contaminated food
+ Life cycle :
    + Host ingests eggs
    + Eggs hatch and release larvae
    + Larvae invade the intestinal walls
    + Larvae migrate to lungs via portal vain
    + Larvae migrate to alveoli, trachea and Larynx
    + Larvae climb up to the mouth and swallowed back into the intestine
    + Larvae mature into adult worms in intestine, where they lay new eggs
+ Clinical features
    + Usually asymptomatic
    + Early symptoms :
        + Cough, bloody sputum
        + **Loeffler syndrome** - accumulation of eosinophils in the lungs
    + Late symptoms :
        + Weight loss, diarrhea, vomiting
        + May cause bowerl obstruction at the ileocecal calve
+ Diagnosis
    + Eosinophilia and presence of eggs in stool

* 93. Enterobius vermicularis. Trichuris trichiura (Trichocephalus trichiurus).
*** Enterobius vermicularis
+ Human pinworm, Nematode, Humans are the only host
+ Transmission :
    + Fecal oral
        + Consumtion of contaminated food/water
        + Reinfection: fecal-oral after scratching anal region(perianal itching at night)
+ Life cycle :
    + Eggs hatch and release larvae in the small intestine
    + Adults establish themselves in the colon
        + Life span ~ 2 months
    + Females migrate in the night outside the night and lay eggs in the perianal area
+ Clinical features :
    + Anal pruritus(especially at night)
    + Vulvovaginitis, especially in children
+ Diagnosis :
    + Scotch tape test
        + Egg detection using tape that has been pressed against the perianal region
*** Truchuris trichiura
+ Whipworm, Nematode
+ Transmission :
    + Fecal-oral
+ Life cycle :
    + host ingests eggs
    + Eggs hatch and release larvae in the small intestine
    + Larvae mature into adult worms in colon
    + Adult worms lay eggs, which are shed in feces
+ Clinical features
    + Usually asymptmatic, but in children may cause:
        + Diarrhea
        + **Rectal collapse**
+ Diagnosis :
    + Eggs in stool
+ Morphology :
    + Females larger than males
    + Females have blunt round posterior end, males end is coiled

* 94. Trichinella spiralis.
*** Trichinella spiralis
+ Nematodes, biohelminths, females larger than males
+ Transmission
    + Consumption of undercooked meat(usually pork) containing encysted larvae
    + Fecal-oral(rarely)
+ Life cycle :
    + Host ingests meat that contains cysts
    + Larvae invade the small intestine mucosa
    + Larvae develop into adult worms
    + Adult worms release larvae, which then migrate to muscles, where they encyst
+ Clinical features
    + Intestinal phase :
        + Diarrhea, vomiting
    + Muscle phase :
        + Myosis - Muscle swelling
        + **Periorbital edema**
        + Fever
+ Diagnosis :
    + Eosinophilia
    + Increased Creatine kinase
    + Confirmation teset - serological detection of antibodies

* 95. Ancylostoma duodenale. Strongyloides stercoralis.
*** Ancylostoma duodenale
+ Human hookwrom, nematode
+ Transmission :
    + Cutaneous penetration of larvae(enters primarly by penetrating feet, e.g by walking on a beach)
+ Life cycle :
        + Soil contaminated with human feces containing hookworm eggs
        + Eggs hatch and release larvae
        + Larvae penetrate skin(usually feet)
        + Larvae migrate to lungs via bloodstream
        + Larvae migrate to brochi and trachea
        + Larvae are swallowed back to the intestine
        + Larvae mature into adults, colonize intestinal tract
        + Female hookworms lay eggs in the intestine
        + Eggs are eliminated with feces
+ Clinical features
        + At entry site :
            + pruritus, erythema
        + **Loeffler syndrome** (pneumonia with eosinophilia)
        + microcytic anemia(hookwroms ingest blood from the intestinal wall)
+ Diagnosis
        + Eosinophilia and microcytic anemia
        + Stool examination fro eggs or worms
*** Strongyloides sterocalis
+ Threadworm, nematode
+ Transmission :
    + Cutaneous penetration of larvae(primarily via the feet)
+ Life cycle :
    + Eggs hatch in the human intestine and release larvae -+ Larvae are excreted with the feces and contaminate soil
    + Larvae penetrate the skin upon contact with contaminated soil
    + Larvae migrate to lungs via bloodstream
    + Larvae migrate to **pharynx** via the alveoli and bronchial system
    + Larvae are swallowed causing autoinfection
    + Larvae mature into adult, egg-producing worms in the intestine
    + Eggs develop into infectious larvae and are excreted in feces
+ Hyperinfection : Some Larvae may penetrate the intestinal and enter the bloodstream
+ Clinical features
    + Cutaneous phase
            + Swelling, erythema
            + Pruritus
    + Pulmonary phase
            + cough, hemoptysis, Loffler syndrome
    + Intestinal phase
            + Inflammation, abdominal pain with diarrhea
+ Diagnostics :
        + Eosinophilia and stool examination for mobile rhabditiform larvae

* 96. Dracunculus medinensis. Filarial worms: Wuchereria bancrofti, Loa loa, Onchocerca volvulus.
*** Dracunculus medinensis
+ Causes Dracunculiasis - Guinea worm disease
+ Transmission :
    + Consumption of unfiltered water containing copepods
+ Hosts
    + copepods(intemediate)
    + Humans(definitive)
+ Life cycle
    + Humans drinks unfiltered water containing infected copepods
    + Copepods die and release larvae, which enter the abdominal cavity
    + After maturation, males die and females migrate towards the surface of the skin
    + A year after infection, female worm induces a blister on the skin, which ruptures
        + When lesions comes to contact with water, discomfort is reduced.
    + The female worm emerges upon contact with water, and releases larvae
+ Worm can be extracted with slow traction by wrapping with a stick, apply antibiotic to wound

