public/Biology.html
<div id="outline-container-org23a5ad5" class="outline-4">
<h4 id="org23a5ad5">Ascaris Lumbricoides</h4>
<div class="outline-text-4" id="text-org23a5ad5">
<ul class="org-ul">
<li>Giant roundworm, fecal oral transmission, Nematode, Geohelminth</li>
<li>Transmission :
<ul class="org-ul">
<li>Fecal-oral - consumption of contaminated food</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Host ingests eggs</li>
<li>Eggs hatch and release larvae</li>
<li>Larvae invade the intestinal walls</li>
<li>Larvae migrate to lungs via portal vain</li>
<li>Larvae migrate to alveoli, trachea and Larynx</li>
<li>Larvae climb up to the mouth and swallowed back into the intestine</li>
<li>Larvae mature into adult worms in intestine, where they lay new eggs</li>
</ul></li>
<li>Clinical features
<ul class="org-ul">
<li>Usually asymptomatic</li>
<li>Early symptoms :
<ul class="org-ul">
<li>Cough, bloody sputum</li>
<li><b><b>Loeffler syndrome</b></b> - accumulation of eosinophils in the lungs</li>
</ul></li>
<li>Late symptoms :
<ul class="org-ul">
<li>Weight loss, diarrhea, vomiting</li>
<li>May cause bowerl obstruction at the ileocecal calve</li>
</ul></li>
</ul></li>
<li>Diagnosis
<ul class="org-ul">
<li>Eosinophilia and presence of eggs in stool</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2c3b25d" class="outline-2">
<h2 id="org2c3b25d">93. Enterobius vermicularis. Trichuris trichiura (Trichocephalus trichiurus).</h2>
<div class="outline-text-2" id="text-org2c3b25d">
</div>
<div id="outline-container-orge8ef40c" class="outline-4">
<h4 id="orge8ef40c">Enterobius vermicularis</h4>
<div class="outline-text-4" id="text-orge8ef40c">
<ul class="org-ul">
<li>Human pinworm, Nematode, Humans are the only host</li>
<li>Transmission :
<ul class="org-ul">
<li>Fecal oral
<ul class="org-ul">
<li>Consumtion of contaminated food/water</li>
<li>Reinfection: fecal-oral after scratching anal region(perianal itching at night)</li>
</ul></li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Eggs hatch and release larvae in the small intestine</li>
<li>Adults establish themselves in the colon
<ul class="org-ul">
<li>Life span ~ 2 months</li>
</ul></li>
<li>Females migrate in the night outside the night and lay eggs in the perianal area</li>
</ul></li>
<li>Clinical features :
<ul class="org-ul">
<li>Anal pruritus(especially at night)</li>
<li>Vulvovaginitis, especially in children</li>
</ul></li>
<li>Diagnosis :
<ul class="org-ul">
<li>Scotch tape test
<ul class="org-ul">
<li>Egg detection using tape that has been pressed against the perianal region</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org13729af" class="outline-4">
<h4 id="org13729af">Truchuris trichiura</h4>
<div class="outline-text-4" id="text-org13729af">
<ul class="org-ul">
<li>Whipworm, Nematode</li>
<li>Transmission :
<ul class="org-ul">
<li>Fecal-oral</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>host ingests eggs</li>
<li>Eggs hatch and release larvae in the small intestine</li>
<li>Larvae mature into adult worms in colon</li>
<li>Adult worms lay eggs, which are shed in feces</li>
</ul></li>
<li>Clinical features
<ul class="org-ul">
<li>Usually asymptmatic, but in children may cause:
<ul class="org-ul">
<li>Diarrhea</li>
<li><b><b>Rectal collapse</b></b></li>
</ul></li>
</ul></li>
<li>Diagnosis :
<ul class="org-ul">
<li>Eggs in stool</li>
</ul></li>
<li>Morphology :
<ul class="org-ul">
<li>Females larger than males</li>
<li>Females have blunt round posterior end, males end is coiled</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd82438c" class="outline-2">
<h2 id="orgd82438c">94. Trichinella spiralis.</h2>
<div class="outline-text-2" id="text-orgd82438c">
</div>
<div id="outline-container-org6df218f" class="outline-4">
<h4 id="org6df218f">Trichinella spiralis</h4>
<div class="outline-text-4" id="text-org6df218f">
<ul class="org-ul">
<li>Nematodes, biohelminths, females larger than males</li>
<li>Transmission
<ul class="org-ul">
<li>Consumption of undercooked meat(usually pork) containing encysted larvae</li>
<li>Fecal-oral(rarely)</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Host ingests meat that contains cysts</li>
<li>Larvae invade the small intestine mucosa</li>
<li>Larvae develop into adult worms</li>
<li>Adult worms release larvae, which then migrate to muscles, where they encyst</li>
</ul></li>
<li>Clinical features
<ul class="org-ul">
<li>Intestinal phase :
<ul class="org-ul">
<li>Diarrhea, vomiting</li>
</ul></li>
<li>Muscle phase :
<ul class="org-ul">
<li>Myosis - Muscle swelling</li>
<li><b><b>Periorbital edema</b></b></li>
<li>Fever</li>
</ul></li>
</ul></li>
<li>Diagnosis :
<ul class="org-ul">
<li>Eosinophilia</li>
<li>Increased Creatine kinase</li>
<li>Confirmation teset - serological detection of antibodies</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org665a8c1" class="outline-2">
<h2 id="org665a8c1">95. Ancylostoma duodenale. Strongyloides stercoralis.</h2>
<div class="outline-text-2" id="text-org665a8c1">
</div>
<div id="outline-container-org8ed61b8" class="outline-4">
<h4 id="org8ed61b8">Ancylostoma duodenale</h4>
<div class="outline-text-4" id="text-org8ed61b8">
<ul class="org-ul">
<li>Human hookwrom, nematode</li>
<li>Transmission :
<ul class="org-ul">
<li>Cutaneous penetration of larvae(enters primarly by penetrating feet, e.g by walking on a beach)</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Soil contaminated with human feces containing hookworm eggs</li>
<li>Eggs hatch and release larvae</li>
<li>Larvae penetrate skin(usually feet)</li>
<li>Larvae migrate to lungs via bloodstream</li>
<li>Larvae migrate to brochi and trachea</li>
<li>Larvae are swallowed back to the intestine</li>
<li>Larvae mature into adults, colonize intestinal tract</li>
<li>Female hookworms lay eggs in the intestine</li>
<li>Eggs are eliminated with feces</li>
</ul></li>
<li>Clinical features
<ul class="org-ul">
<li>At entry site :
<ul class="org-ul">
<li>pruritus, erythema</li>
</ul></li>
<li><b><b>Loeffler syndrome</b></b> (pneumonia with eosinophilia)</li>
<li>microcytic anemia(hookwroms ingest blood from the intestinal wall)</li>
</ul></li>
<li>Diagnosis
<ul class="org-ul">
<li>Eosinophilia and microcytic anemia</li>
<li>Stool examination fro eggs or worms</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4c00e0b" class="outline-4">
<h4 id="org4c00e0b">Strongyloides sterocalis</h4>
<div class="outline-text-4" id="text-org4c00e0b">
<ul class="org-ul">
<li>Threadworm, nematode</li>
<li>Transmission :
<ul class="org-ul">
<li>Cutaneous penetration of larvae(primarily via the feet)</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Eggs hatch in the human intestine and release larvae -+ Larvae are excreted with the feces and contaminate soil</li>
<li>Larvae penetrate the skin upon contact with contaminated soil</li>
<li>Larvae migrate to lungs via bloodstream</li>
<li>Larvae migrate to <b><b>pharynx</b></b> via the alveoli and bronchial system</li>
<li>Larvae are swallowed causing autoinfection</li>
<li>Larvae mature into adult, egg-producing worms in the intestine</li>
<li>Eggs develop into infectious larvae and are excreted in feces</li>
</ul></li>
<li>Hyperinfection : Some Larvae may penetrate the intestinal and enter the bloodstream</li>
<li>Clinical features
<ul class="org-ul">
<li>Cutaneous phase
<ul class="org-ul">
<li>Swelling, erythema</li>
<li>Pruritus</li>
</ul></li>
<li>Pulmonary phase
<ul class="org-ul">
<li>cough, hemoptysis, Loffler syndrome</li>
</ul></li>
<li>Intestinal phase
<ul class="org-ul">
<li>Inflammation, abdominal pain with diarrhea</li>
</ul></li>
</ul></li>
<li>Diagnostics :
<ul class="org-ul">
<li>Eosinophilia and stool examination for mobile rhabditiform larvae</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org483e87e" class="outline-2">
<h2 id="org483e87e">96. Dracunculus medinensis. Filarial worms: Wuchereria bancrofti, Loa loa, Onchocerca volvulus.</h2>
<div class="outline-text-2" id="text-org483e87e">
</div>
<div id="outline-container-org6d57b3f" class="outline-4">
<h4 id="org6d57b3f">Dracunculus medinensis</h4>
<div class="outline-text-4" id="text-org6d57b3f">
<ul class="org-ul">
<li>Causes Dracunculiasis - Guinea worm disease</li>
<li>Transmission :
<ul class="org-ul">
<li>Consumption of unfiltered water containing copepods</li>
</ul></li>
<li>Hosts
<ul class="org-ul">
<li>copepods(intemediate)</li>
<li>Humans(definitive)</li>
</ul></li>
<li>Life cycle
<ul class="org-ul">
<li>Humans drinks unfiltered water containing infected copepods</li>
<li>Copepods die and release larvae, which enter the abdominal cavity</li>
<li>After maturation, males die and females migrate towards the surface of the skin</li>
<li>A year after infection, female worm induces a blister on the skin, which ruptures
<ul class="org-ul">
<li>When lesions comes to contact with water, discomfort is reduced.</li>
</ul></li>
<li>The female worm emerges upon contact with water, and releases larvae</li>
</ul></li>
<li>Worm can be extracted with slow traction by wrapping with a stick, apply antibiotic to wound</li>
</ul>
</div>
</div>
