content/Biology.org
*** Wucheeria Bancrofti
+ Thread-like worm, Nematode, causes Lymphatic filariasis and Elephantiasis
+ Transmission
     + via Mosquitos bite
+ Life cycle :
    + Introduced larvae via bite wound
    + Larvae mature in the lympatic system
    + Adult worms produce microfilariae
    + Microfilariae are consued by mosquito during a blood meal
    + Microfilariae mature into larvae
+ Clinical features :
    + Paiful lumphadenopathy(worms invading lymph nodes -+ inflammation)
    + Elephantiasis
+ Diagnosis
    + Blood smear, visualization of microfilariae with Giemsa stain

*** Loa loa
+ Filarial nematode, causes Loiasis
+ Transmission
    + Deer fly
+ Life cycle
    + Larvae get into bite woud
    + Larvae mature into adult worms in subcutaneous tissue
    + Adult worms produce microfilariae and release them into the bloodstream
    + Deerfly ingests microfiliariae during blood meal
    + Microfilariae mature into larvae
+ Clinical features
    + Calabar swelling -+ transient, localized swelling.
    + Eye worm -+ Loa loa has a tendency to migrate to subconjuctival tissue
+ Diagnosis
    + Eosinophilia
    + Blood smear showing microfilariae
    + Seeing a worm in patients eye
*** Onchocerca volvulus
+Onchocerciasis - River blindness
+ Transmission
    + Bite by blackfly
+ Life cycle
    + Larvae introduced by bite from darkfly
    + Larvae mature into worms in subcutaneous tissue
    + Adult worms produce microfilariae
    + Microfilariae migrate through subcutaneous tissue
    + Darkfly ingest microfilariae during blood meal
    + Microfilariae mature into larvae
+ Clinical feautures
    + Ocular onchocerciasis
        + Leads to blindness
    + Onchocercal skin disease
        + Subcutaneous nodules
        + Hyperpigmented papules with skin atrophy
+ Diagnosis
    + Skin snips - skin bipsy causing microfilariae to leave the skin
+ Treatment
    + ivermectin
* 97. Phylum Annelida: important evolutionary changes. Lumbricus terrestris. Hirudo medicinalis.
*** Phylum Annelida
+Segmented Worms - polychaete worms, oligochaetes worms and leeches
+ All members of this group are segmented - also called metamerism
+ body made up of both longitudinal and circular muscles surrounded by acelular cuticle(secreted by epithelium)
+ All members have chaete(hair like structures projecting from cuticle), except leeches
+ True coelom
    + Polychaete worms
        + All are marine worms
    + Oligochaetes worms
        + Freshwater worms
        + Earthworm
            + burrows through the moist ground, extracting nutrients and aerating the soil
    + Leeches
        + less segmented
        + suckers at each end used for crawl
+ The **important evolutionary changes in annelids are:**
    + Coelom
    + Metamerism -Segmentation
    + Setae
    + Cerebral ganglia
    + Blood vessels
    + Metanephridia
*** Lumbrius terrestrisl
+ Common earth worm
+ Segmentation
    + Each segment has muscles and detae
    + Setae help anchor to the ground, aiding movement
+ Closed circulatory system
    + Aortic arches that function like a heart
+ Respiration
    + Breaths through skin
+ Reproduction
    + Hermaphrodites, but need a mate to reproduce
*** Hirudo Medicinalis
+ European medicinal leech
+ Leech saliva contains about 100 pharmacologically active substances
    + includes hirudin, hyaluronidase, vasodilators and anesthetics
    + These substances are injected in human body during 'sucking'
    + The proteins in leech saliva reduce pain and swelling




* 98. Phylum Arthropoda: important evolutionary changes. Class Crustacea: general characterization.Class Arachnida. Orders Scorpiones and Araneae.
*** Phylum Arthropoda
+ Segmented body
    + Covered by chitin and exoskeleton
    + Arthropods molt, exoskeleton does not grow with them
+ Open circulatory system
    + consisting of a dorsal heart which collects blood and pumps it back
+ Nerve system
    + Well developed sense organs
+ Jointed appendages
    + antennae, mouthparts and walking legs
*** Class Crustacea
+ Lobsters, crabs, shrips
+ Most crustaceans are aquatic, the majority are marine
+ All have :
    + 2 pairs of antennae
    + 1 pair of eyes(usually on stalks)
    + a pair of appendages on each body segment
+ Major groups
    + Branchiopoda e.g Brine shrimp
    + Maxillopoda e.g Copepod
    + Ostracoda e.g Ostracod
    + Malacostraca e.g MANTIS SHRIMP(my fav), Crab
**** Genus Cyclops
+ Water copepods
+ Intermediate host of Dracunculus and Diphylloborthrium
*** Class Arachnida
+ Includes spiders, scorpions, harvestman and ticks
+ All arachnids have **8 legs**
+ Almost all are terrestrial
*** Order Arenae
+ Spiders
+ Air breathing arthropods that have 8 legs and fangs that inject venom
+ Largest order of arachnids
+ Two tagmata :
    + Cephalothorax
        + their ganglia are fused in one in the cephalothorax(centralized NS)
    + Abdomen
        + Abdomen has appendages that can produce silk
+ Spiders have centralized nervous system
    + their ganglia are fused into one in the cephalothorax
+ 4 pairs of eyes
+ Reproduce sexually and fertilization is internal

*** Order Scorpiones
+ Scorpions have large pedipalps which end in a chela (hand or pincer)
+ 5 segmented metasoma(tail) that bears a stinger
+ Common genus include
    + Euscorpius
        + "small wood scorpions"
        + varies in color
        + Venom has local effect
