public/Biology.html

<div id="outline-container-orgcf28e3e" class="outline-4">
<h4 id="orgcf28e3e">Wucheeria Bancrofti</h4>
<div class="outline-text-4" id="text-orgcf28e3e">
<ul class="org-ul">
<li>Thread-like worm, Nematode, causes Lymphatic filariasis and Elephantiasis</li>
<li>Transmission
<ul class="org-ul">
<li>via Mosquitos bite</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Introduced larvae via bite wound</li>
<li>Larvae mature in the lympatic system</li>
<li>Adult worms produce microfilariae</li>
<li>Microfilariae are consued by mosquito during a blood meal</li>
<li>Microfilariae mature into larvae</li>
</ul></li>
<li>Clinical features :
<ul class="org-ul">
<li>Paiful lumphadenopathy(worms invading lymph nodes -+ inflammation)</li>
<li>Elephantiasis</li>
</ul></li>
<li>Diagnosis
<ul class="org-ul">
<li>Blood smear, visualization of microfilariae with Giemsa stain</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8c62a71" class="outline-4">
<h4 id="org8c62a71">Loa loa</h4>
<div class="outline-text-4" id="text-org8c62a71">
<ul class="org-ul">
<li>Filarial nematode, causes Loiasis</li>
<li>Transmission
<ul class="org-ul">
<li>Deer fly</li>
</ul></li>
<li>Life cycle
<ul class="org-ul">
<li>Larvae get into bite woud</li>
<li>Larvae mature into adult worms in subcutaneous tissue</li>
<li>Adult worms produce microfilariae and release them into the bloodstream</li>
<li>Deerfly ingests microfiliariae during blood meal</li>
<li>Microfilariae mature into larvae</li>
</ul></li>
<li>Clinical features
<ul class="org-ul">
<li>Calabar swelling -+ transient, localized swelling.</li>
<li>Eye worm -+ Loa loa has a tendency to migrate to subconjuctival tissue</li>
</ul></li>
<li>Diagnosis
<ul class="org-ul">
<li>Eosinophilia</li>
<li>Blood smear showing microfilariae</li>
<li>Seeing a worm in patients eye</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbeefdb2" class="outline-4">
<h4 id="orgbeefdb2">Onchocerca volvulus</h4>
<div class="outline-text-4" id="text-orgbeefdb2">
<p>
+Onchocerciasis - River blindness
</p>
<ul class="org-ul">
<li>Transmission
<ul class="org-ul">
<li>Bite by blackfly</li>
</ul></li>
<li>Life cycle
<ul class="org-ul">
<li>Larvae introduced by bite from darkfly</li>
<li>Larvae mature into worms in subcutaneous tissue</li>
<li>Adult worms produce microfilariae</li>
<li>Microfilariae migrate through subcutaneous tissue</li>
<li>Darkfly ingest microfilariae during blood meal</li>
<li>Microfilariae mature into larvae</li>
</ul></li>
<li>Clinical feautures
<ul class="org-ul">
<li>Ocular onchocerciasis
<ul class="org-ul">
<li>Leads to blindness</li>
</ul></li>
<li>Onchocercal skin disease
<ul class="org-ul">
<li>Subcutaneous nodules</li>
<li>Hyperpigmented papules with skin atrophy</li>
</ul></li>
</ul></li>
<li>Diagnosis
<ul class="org-ul">
<li>Skin snips - skin bipsy causing microfilariae to leave the skin</li>
</ul></li>
<li>Treatment
<ul class="org-ul">
<li>ivermectin</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgeac13e8" class="outline-2">
<h2 id="orgeac13e8">97. Phylum Annelida: important evolutionary changes. Lumbricus terrestris. Hirudo medicinalis.</h2>
<div class="outline-text-2" id="text-orgeac13e8">
</div>
<div id="outline-container-org1cb33ae" class="outline-4">
<h4 id="org1cb33ae">Phylum Annelida</h4>
<div class="outline-text-4" id="text-org1cb33ae">
<p>
+Segmented Worms - polychaete worms, oligochaetes worms and leeches
</p>
<ul class="org-ul">
<li>All members of this group are segmented - also called metamerism</li>
<li>body made up of both longitudinal and circular muscles surrounded by acelular cuticle(secreted by epithelium)</li>
<li>All members have chaete(hair like structures projecting from cuticle), except leeches</li>
<li>True coelom
<ul class="org-ul">
<li>Polychaete worms
<ul class="org-ul">
<li>All are marine worms</li>
</ul></li>
<li>Oligochaetes worms
<ul class="org-ul">
<li>Freshwater worms</li>
<li>Earthworm
<ul class="org-ul">
<li>burrows through the moist ground, extracting nutrients and aerating the soil</li>
</ul></li>
</ul></li>
<li>Leeches
<ul class="org-ul">
<li>less segmented</li>
<li>suckers at each end used for crawl</li>
</ul></li>
</ul></li>
<li>The <b><b>important evolutionary changes in annelids are:</b></b>
<ul class="org-ul">
<li>Coelom</li>
<li>Metamerism -Segmentation</li>
<li>Setae</li>
<li>Cerebral ganglia</li>
<li>Blood vessels</li>
<li>Metanephridia</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6bd79e0" class="outline-4">
<h4 id="org6bd79e0">Lumbrius terrestrisl</h4>
<div class="outline-text-4" id="text-org6bd79e0">
<ul class="org-ul">
<li>Common earth worm</li>
<li>Segmentation
<ul class="org-ul">
<li>Each segment has muscles and detae</li>
<li>Setae help anchor to the ground, aiding movement</li>
</ul></li>
<li>Closed circulatory system
<ul class="org-ul">
<li>Aortic arches that function like a heart</li>
</ul></li>
<li>Respiration
<ul class="org-ul">
<li>Breaths through skin</li>
</ul></li>
<li>Reproduction
<ul class="org-ul">
<li>Hermaphrodites, but need a mate to reproduce</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb1405c3" class="outline-4">
<h4 id="orgb1405c3">Hirudo Medicinalis</h4>
<div class="outline-text-4" id="text-orgb1405c3">
<ul class="org-ul">
<li>European medicinal leech</li>
<li>Leech saliva contains about 100 pharmacologically active substances
<ul class="org-ul">
<li>includes hirudin, hyaluronidase, vasodilators and anesthetics</li>
<li>These substances are injected in human body during 'sucking'</li>
<li>The proteins in leech saliva reduce pain and swelling</li>
</ul></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgb96606c" class="outline-2">
<h2 id="orgb96606c">98. Phylum Arthropoda: important evolutionary changes. Class Crustacea: general characterization.Class Arachnida. Orders Scorpiones and Araneae.</h2>
<div class="outline-text-2" id="text-orgb96606c">
</div>
<div id="outline-container-org3d658ae" class="outline-4">
<h4 id="org3d658ae">Phylum Arthropoda</h4>
<div class="outline-text-4" id="text-org3d658ae">
<ul class="org-ul">
<li>Segmented body
<ul class="org-ul">
<li>Covered by chitin and exoskeleton</li>
<li>Arthropods molt, exoskeleton does not grow with them</li>
</ul></li>
<li>Open circulatory system
<ul class="org-ul">
<li>consisting of a dorsal heart which collects blood and pumps it back</li>
</ul></li>
<li>Nerve system
<ul class="org-ul">
<li>Well developed sense organs</li>
</ul></li>
<li>Jointed appendages
<ul class="org-ul">
<li>antennae, mouthparts and walking legs</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgce90ece" class="outline-4">
<h4 id="orgce90ece">Class Crustacea</h4>
<div class="outline-text-4" id="text-orgce90ece">
<ul class="org-ul">
<li>Lobsters, crabs, shrips</li>
<li>Most crustaceans are aquatic, the majority are marine</li>
<li>All have :
<ul class="org-ul">
<li>2 pairs of antennae</li>
<li>1 pair of eyes(usually on stalks)</li>
<li>a pair of appendages on each body segment</li>
</ul></li>
<li>Major groups
<ul class="org-ul">
<li>Branchiopoda e.g Brine shrimp</li>
<li>Maxillopoda e.g Copepod</li>
<li>Ostracoda e.g Ostracod</li>
<li>Malacostraca e.g MANTIS SHRIMP(my fav), Crab</li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgcf7b0d4"></a>Genus Cyclops<br />
<div class="outline-text-5" id="text-orgcf7b0d4">
<ul class="org-ul">
<li>Water copepods</li>
<li>Intermediate host of Dracunculus and Diphylloborthrium</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5701401" class="outline-4">
<h4 id="org5701401">Class Arachnida</h4>
<div class="outline-text-4" id="text-org5701401">
<ul class="org-ul">
<li>Includes spiders, scorpions, harvestman and ticks</li>
<li>All arachnids have <b><b>8 legs</b></b></li>
<li>Almost all are terrestrial</li>
</ul>
</div>
</div>
<div id="outline-container-orge990ccd" class="outline-4">
<h4 id="orge990ccd">Order Arenae</h4>
<div class="outline-text-4" id="text-orge990ccd">
<ul class="org-ul">
<li>Spiders</li>
<li>Air breathing arthropods that have 8 legs and fangs that inject venom</li>
<li>Largest order of arachnids</li>
<li>Two tagmata :
<ul class="org-ul">
<li>Cephalothorax
<ul class="org-ul">
<li>their ganglia are fused in one in the cephalothorax(centralized NS)</li>
</ul></li>
<li>Abdomen
<ul class="org-ul">
<li>Abdomen has appendages that can produce silk</li>
</ul></li>
</ul></li>
<li>Spiders have centralized nervous system
<ul class="org-ul">
<li>their ganglia are fused into one in the cephalothorax</li>
</ul></li>
<li>4 pairs of eyes</li>
<li>Reproduce sexually and fertilization is internal</li>
</ul>
</div>
</div>

<div id="outline-container-orgd4ec81d" class="outline-4">
<h4 id="orgd4ec81d">Order Scorpiones</h4>
<div class="outline-text-4" id="text-orgd4ec81d">
<ul class="org-ul">
<li>Scorpions have large pedipalps which end in a chela (hand or pincer)</li>
<li>5 segmented metasoma(tail) that bears a stinger</li>
<li>Common genus include
<ul class="org-ul">
<li>Euscorpius
<ul class="org-ul">
<li>"small wood scorpions"</li>
<li>varies in color</li>
<li>Venom has local effect</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
