public/Biology.html
<div id="outline-container-org0049d91" class="outline-2">
<h2 id="org0049d91">99. Order Acari. Medical importance of ticks and mites.</h2>
<div class="outline-text-2" id="text-org0049d91">
<ul class="org-ul">
<li>Class of Arachnids</li>
<li>Contains mites and ticks</li>
<li>2 tagmata
<ul class="org-ul">
<li>Cephalothorax</li>
<li>Abdomen</li>
</ul></li>
<li>Mouth parts may have adapted to biting or stringing</li>
<li>They breath through trachea, stigmata and skn itself</li>
<li>Ticks are larger than mites</li>
<li>Ticks are primarly on land</li>
<li>Life cycle :
<ul class="org-ul">
<li>Egg -+ Prelarval stage -&gt; larval stage -&gt; series of nypmphal stages</li>
</ul></li>
<li>Important mites include
<ul class="org-ul">
<li>Sacroptes scabiei
<ul class="org-ul">
<li>Skin parasite that causes severe itching, especially at night</li>
<li>Transmission : Direct physical contact</li>
</ul></li>
</ul></li>
<li>Important Tick-borne diseases
<ul class="org-ul">
<li>e.g Lyme dissease - Borrelia, Rocky Mountain Spotted Fever - Ricketsia</li>
<li>Ixodes tick:
<ul class="org-ul">
<li>transmit both bacterial and viral pathogens</li>
<li>Has no eyes</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgdedb6d4" class="outline-2">
<h2 id="orgdedb6d4">100. Class Insecta. The role of insects as vectors and mechanical carriers.</h2>
<div class="outline-text-2" id="text-orgdedb6d4">
</div>
<div id="outline-container-orgc3a3f82" class="outline-4">
<h4 id="orgc3a3f82">Class Insecta</h4>
<div class="outline-text-4" id="text-orgc3a3f82">
<ul class="org-ul">
<li>Composed of
<ul class="org-ul">
<li>Three tagmata - Head, thorax and abdomen</li>
<li>Three pairs of walking legs</li>
<li>One pair of antennae on the had</li>
<li>Two pairs of wings</li>
<li>Open circulatory system</li>
<li>Circulatory system in insects does NOT carry oxygen
<ul class="org-ul">
<li>Insect blood contains 10% hemocytes(blood cells) and 90% blood plasma</li>
</ul></li>
<li><b><b>Development</b></b>, insects have 3 different manners of development
<ul class="org-ul">
<li>Ametabolous
<ul class="org-ul">
<li>Hatching eggs produce <b><b>miniature copies of adults</b></b>, which to grow undergo <b><b>ecdysis</b></b></li>
</ul></li>
<li>Holometabolous
<ul class="org-ul">
<li>Completely different appearance of newly hatched and adults</li>
<li>Larval forms that live in different habitats</li>
<li>Undergo pupa(metamorphosis in cocoon)</li>
</ul></li>
<li>Hemimetabolous
<ul class="org-ul">
<li>The young in these category are called nymphs</li>
<li>nymphs are similar to adults, but smaller, lack winds and sexaully immature</li>
</ul></li>
</ul></li>
<li><b><b>Digestive System</b></b>
<ul class="org-ul">
<li>Complex digestive tract</li>
<li>Additional structues - glands producing digestive enzymes</li>
</ul></li>
<li>Respiration
<ul class="org-ul">
<li>insects breathe through a tracheal system</li>
</ul></li>
<li>Reproduction
<ul class="org-ul">
<li>two sexes, fertilization is internal in most</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org051ce39" class="outline-2">
<h2 id="org051ce39">101. Pediculus humanus. Phthirius pubis. Cimex lectularius. Pulex irritans.</h2>
<div class="outline-text-2" id="text-org051ce39">
</div>
<div id="outline-container-orgd2e3837" class="outline-4">
<h4 id="orgd2e3837">Pediculus humanus</h4>
<div class="outline-text-4" id="text-orgd2e3837">
<ul class="org-ul">
<li>Head louse, does NOT transmist infection, usually refers to Pediculus vestimeti(body louse) as well</li>
<li>Lice are obligate, permanent parasites of humans</li>
<li>Transmission
<ul class="org-ul">
<li>contact with an infected human host</li>
<li>Egg laying behavior is temperature dependant, they seek new host if temperature rises(e.g fever)
<ul class="org-ul">
<li>To attach eggs, female secretes glue from her reproductive organs</li>
<li>Lause eggs are also known as <b><b>nits</b></b></li>
</ul></li>
<li>Vectors of Ricketsia Prowazeki
<ul class="org-ul">
<li>Causes Ricketsia Typhi, can lead to explosive epidemics</li>
</ul></li>
<li>Vector of Borellia recurrentis
<ul class="org-ul">
<li>Causes relapsing fever</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org94fb0d2" class="outline-4">
<h4 id="org94fb0d2">Phthirius pubis</h4>
<div class="outline-text-4" id="text-org94fb0d2">
<ul class="org-ul">
<li>The 'Crab Louse', also known as the pubic louse</li>
<li>Obligate ectoparasite of humans</li>
<li>They cannot jump and live exclusively on blood</li>
<li>Does not transmit disease</li>
</ul>
</div>
</div>
<div id="outline-container-org5ffb4f2" class="outline-4">
<h4 id="org5ffb4f2">Cimex Lectularius</h4>
<div class="outline-text-4" id="text-org5ffb4f2">
<ul class="org-ul">
<li>Bed Bug</li>
<li>Blood feeding parasites of humans and domesticated animals</li>
<li>Have been suspected as carriers of leprosy and Q-fever but have never been implicated in the spread of disease to humans</li>
<li>Bed bugs are most active at night, their infestations are not easily located</li>
<li>They follow hemimetabolous development</li>
</ul>
</div>
</div>
<div id="outline-container-orgf24ee6a" class="outline-4">
<h4 id="orgf24ee6a">Pulex irritans</h4>
<div class="outline-text-4" id="text-orgf24ee6a">
<ul class="org-ul">
<li>Human flea, prefers human blood, but will feed on other animals</li>
<li>Has big legs relative to its size, giving it extensive jumping abilities</li>
<li>Transmitted diseases :
<ul class="org-ul">
<li>Yersinia Pestis - Plague</li>
<li>Ricketsia Typhi</li>
</ul></li>
<li>Life cycle :
<ul class="org-ul">
<li>Eggs are shed into the environment by female</li>
<li>Eggs hatch into larvae</li>
<li>Larvae form pupae(cocoo)</li>
<li>Adults hatch, infect host</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4285853" class="outline-2">
<h2 id="org4285853">102. Genus Culex and genus Anopheles: morphological differences. Phlebotomus papatasii.</h2>
<div class="outline-text-2" id="text-org4285853">
</div>
<div id="outline-container-org6dffc20" class="outline-4">
<h4 id="org6dffc20">Genus Culex and Genus Anopheles</h4>
<div class="outline-text-4" id="text-org6dffc20">
<ul class="org-ul">
<li>Mosquitos</li>
<li>Life cycle
<ul class="org-ul">
<li>Female mosquito lay eggs on fresh water</li>
<li>Eggs hatch into larvae within 48h</li>
<li>Larvae develop into pupa ~ in about 5 days, anopheles mosquito takes 5-10 days</li>
<li>Develop into adult mosquitos within 2 days</li>
</ul></li>
<li>How to distinguish them
<ul class="org-ul">
<li>Culex mosquito do a C curve when sitting e.g on a wall, while anopheles keeps its back straight</li>
</ul></li>
<li>Anopheles mosquito is defitive host/vector for Plasmodium/malaria and dengue fever</li>
</ul>
</div>
</div>
<div id="outline-container-org502faa5" class="outline-4">
<h4 id="org502faa5">Phlebotomus papatsii</h4>
<div class="outline-text-4" id="text-org502faa5">
<ul class="org-ul">
<li>Vector of visceral leishmaniasis</li>
<li>Sandfly</li>
<li>Carries Leishmania protozoa from infected animals after feeding</li>
<li>Yellow color</li>
<li><b><b>Difference between sanfly and mosquito</b></b>
<ul class="org-ul">
<li>Mosquitos require aquatic environment to lay eggs, sandfly does not.
<ul class="org-ul">
<li>Females lay their eggs in soil or any place with decaying organic material</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org12a1179" class="outline-2">
<h2 id="org12a1179">103. Overview of parasitism.parasitism</h2>
<div class="outline-text-2" id="text-org12a1179">
<ul class="org-ul">
<li>Commensalism
<ul class="org-ul">
<li>Class of relationship between 2 organisms where one organisms benefits <b><b>without</b></b> affecting the other</li>
</ul></li>
<li>Mutualism
<ul class="org-ul">
<li>Both organisms benefit from each other relationship</li>
</ul></li>
<li>Amenalism
<ul class="org-ul">
<li>One is harmed and the other is unaffected</li>
</ul></li>
<li>Parasitism
<ul class="org-ul">
<li>Where one benefits while the other is harmed</li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgc01d96c"></a>Main characteristics of Parasites<br />
<div class="outline-text-5" id="text-orgc01d96c">
<ul class="org-ul">
<li>smaller than their host</li>
<li>high degree of specialization</li>
<li>faster rate of reproduction than thier host</li>
<li>reduce host biological fitness while increasing their fitness by exploiting host for resources</li>
</ul>
</div>
</li>

<li><a id="org708724b"></a>Types of Parasites<br />
<div class="outline-text-5" id="text-org708724b">
<ul class="org-ul">
<li>Ectoparasites
<ul class="org-ul">
<li>Live on the surface of host</li>
</ul></li>
<li>Endoparasites
<ul class="org-ul">
<li>live inside the host</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orge4cbef3"></a>Hosts<br />
<div class="outline-text-5" id="text-orge4cbef3">
<ul class="org-ul">
<li>Definitive - Primary host
<ul class="org-ul">
<li>Host where parasite reaches maturity and reproduces sexually</li>
</ul></li>
<li>Intermediate - Secondary host
<ul class="org-ul">
<li>a host where the parasite passes its asexual/larval stages</li>
</ul></li>
<li>Reservoir host
<ul class="org-ul">
<li>Alternative host</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
